main.floors.BMT1=
{
    "floorId": "BMT1",
    "title": "地下 1 层",
    "name": "地下-1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground2",
    "bgm": "area3.mp3",
    "color": [
        0,
        0,
        0,
        0.9
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "if",
            "condition": "(!flag:12Fmission)",
            "true": [
                {
                    "type": "hide",
                    "loc": [
                        [
                            11,
                            1
                        ]
                    ],
                    "floorId": "MT12",
                    "remove": true
                }
            ]
        },
        {
            "type": "moveHero",
            "time": 200,
            "steps": [
                "down",
                "down"
            ]
        },
        {
            "type": "closeDoor",
            "id": "specialDoor",
            "loc": [
                5,
                0
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "up"
        },
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": "hero"
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "down"
        },
        {
            "type": "animate",
            "name": "E_dots",
            "loc": "hero"
        },
        "\t[hero]（这就是地下层吗……感觉敌人好强……）",
        "\t[芳芷,hero2]看来他们所修的\r[yellow]匙之力\r还是有些成果的。借助附近的钥匙，他们的战斗力能获得显著的提升。",
        "\t[芳芷,hero2]尽量想办法先把他们附近的钥匙拿走再跟他们打。当然有些钥匙偷不到，就只能强上了。",
        {
            "type": "animate",
            "name": "E_dots",
            "loc": "hero"
        },
        {
            "type": "if",
            "condition": "(flag:hard==1)",
            "true": [
                {
                    "type": "setValue",
                    "name": "flag:生命",
                    "value": "1"
                },
                {
                    "type": "choices",
                    "text": "\t[系统提示]简化难度下，此区域怪物攻防是普通难度的85%。\n注：匙之力给怪物带来的能力加成效果不变，且晚于难度带来的百分比修正进行计算。\n对于之后有类似的影响怪物攻防的特技，其计算方式同理。",
                    "choices": [
                        {
                            "text": "我知道了",
                            "action": []
                        }
                    ]
                }
            ]
        }
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[4, 3, 150],\n\t[6, 3, 150],\n\t[9, 3, 150],\n\t[7, 8, 150],\n\t[7, 10, 150],\n\t[2, 6, 150],\n\t[2, 10, 150],\n\t[10, 7, 150],\n\t[12, 7, 150]\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "5,3": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[双剑兵,swordsman]圣匙帮领地，闲人勿扰！",
                {
                    "type": "battle",
                    "loc": [
                        5,
                        3
                    ]
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[芳芷,hero2]呀，见面就开打，这样真的好吗？",
                {
                    "type": "animate",
                    "name": "E_love",
                    "loc": "hero"
                },
                "\t[芳芷,hero2]看来你还挺习惯战斗的。跟你的外表不太相称呢。",
                {
                    "type": "animate",
                    "name": "E_unhappy",
                    "loc": "hero"
                }
            ]
        }
    },
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [310,310,310,310,310,  0,310,310,310,310,310,310,310],
    [310, 63, 63,310, 21,  0, 21,310, 32,224,  0, 34,310],
    [310, 63, 63,310, 21,  0, 21,310,  0,310,310,360,310],
    [310,216,310,310,310,224,310,310,271,310, 23,  0,310],
    [310, 82,310,248,324, 34,325,310, 82,310,310,310,310],
    [310,386,224,325,310,310,248,324, 32,235,  0,325,310],
    [310, 81,310,310,310,310,310,310,310,310,310, 21,310],
    [310,248, 32,326,310,325,224,326,224,325,310,  0,310],
    [310,310,310, 81,310,271,310,310,310,360,310,248,310],
    [310,325, 32,235,310, 22, 81, 23, 83, 32, 82,324,310],
    [310, 81,310,310,310,360,310,310,310,271,310, 33,310],
    [310,253, 34, 33,310,324,224,326,224,324,310, 88,310],
    [310,310,310,310,310,310,310,310,310,310,310,310,310]
],
    "bgmap": [
    [  0,  0,  0,  0,  0, 87,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,103,  0,103,  0,  0,103,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,103,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,103,  0,103],
    [  0,  0,  0,  0,  0,  0,  0,103,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,103,  0,  0,  0,  0,103,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "hard1_enemy_ratio": 85,
    "underGround": true,
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}