main.floors.BMT12=
{
    "floorId": "BMT12",
    "title": "地下 12 层",
    "name": "地下-12",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 1,
    "defaultGround": "ground2",
    "bgm": "area4.mp3",
    "color": [
        0,
        0,
        0,
        0.9
    ],
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[4, 1, 180],\n\t[4, 4, 180],\n\t[4, 9, 180],\n\t[8, 1, 180],\n\t[8, 4, 180],\n\t[8, 9, 180],\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "6,3": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    {
                        "type": "animate",
                        "name": "E_question",
                        "loc": "hero"
                    },
                    "\t[hero]\b[down,hero]（怎么又是这家伙？！）",
                    "\t[杜衡,N340]\b[down,6,2]哦哦，我的忠实客户来啦，欢迎欢迎。可惜我这里没什么可招待的，实在不好意思啊。",
                    "\t[芳芷,hero2]\b[down,hero]客套话就免了，直说吧，你怎么会出现在这里？",
                    "\t[杜衡,N340]\b[down,6,2]我出现在这里很奇怪吗？给圣匙帮打工赚点外快，就当工作之余的休闲了。\n毕竟这塔里也实在没什么别的事情可做。",
                    "\t[杜衡,N340]\b[down,6,2]至于我的工作内容，就是炼铜！\n上面的人似乎非常喜欢铜质装备，你们一路走来应该也看到了，圣匙帮虽然主修匙之力，但战斗用的武器还是冷兵器，刀剑这类的。",
                    "\t[杜衡,N340]\b[down,6,2]说起来青铜装备是比铁质装备更落后的东西，脆，容易折断。鬼知道圣匙帮的人为什么偏好铜质装备，不过我连所谓匙之力的本质都搞不明白……这个世界，何等奇妙啊。",
                    {
                        "type": "animate",
                        "name": "E_unhappy",
                        "loc": "hero"
                    },
                    "\t[杜衡,N340]\b[down,6,2]说实话，我觉得你比他们更奇葩，一个穿着水手服的机器人，拿着银质装备打架，简直比上个世纪的老动画还土……",
                    {
                        "type": "animate",
                        "name": "E_sweat",
                        "loc": "hero"
                    },
                    "\t[芳芷,hero2]\b[down,hero]虽然你所说的确是事实，不过这也是无奈之举，毕竟找不到更合适的武器了。",
                    {
                        "type": "animate",
                        "name": "E_love",
                        "loc": "hero"
                    },
                    "\t[杜衡,N340]\b[down,6,2]嘿嘿，要不我试试用这些铜给你强化一下？银剑·强力改装融合超威力最终真隐藏版-改，听着都觉得NB。",
                    {
                        "type": "animate",
                        "name": "E_unhappy",
                        "loc": "hero"
                    },
                    "\t[芳芷,hero2]\b[down,hero]你会强化武器？这银剑给你改造完恐怕就废了。",
                    "\t[杜衡,N340]\b[down,6,2]那……要不我直接改装它本体？这样改装效果就能一直陪伴你了。",
                    {
                        "type": "animate",
                        "name": "E_love",
                        "loc": "hero"
                    },
                    "\t[芳芷,hero2]\b[down,hero]等等，改装本体是个什么改装法……算了，既然它都答应了，我就不问了。",
                    {
                        "type": "animate",
                        "name": "E_dots",
                        "loc": "hero"
                    },
                    "\t[杜衡,N340]\b[down,6,2]不用担心，就是些表面上的修修补补。毕竟这里的条件也不允许我把它拆开做大幅度的改装。",
                    "\t[杜衡,N340]\b[down,6,2]考虑好了就拿着钱找我吧。",
                    {
                        "type": "openShop",
                        "id": "B12FShop"
                    },
                    {
                        "type": "exit"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(!flag:B12FShop_finish)",
                "true": [
                    {
                        "type": "openShop",
                        "id": "B12FShop",
                        "open": true
                    }
                ],
                "false": [
                    "\t[杜衡,N340]\b[down,6,2]最稳妥的强化方式已经完成了。怎么样，有了铜属性之后感觉就是不一样吧？\n想试试更刺激的手段吗？",
                    {
                        "type": "animate",
                        "name": "E_love",
                        "loc": "hero"
                    },
                    "\t[芳芷,hero2]\b[down,hero]（这家伙……完全不长记性啊……）",
                    "\t[杜衡,N340]\b[down,6,2]算了算了，万一把你搞得原地爆炸，我的小命也得搭进去，不值得。",
                    {
                        "type": "animate",
                        "name": "E_unhappy",
                        "loc": "hero"
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "1,6": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "11,6": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "afterBattle": {
        "5,6": [
            {
                "type": "setValue",
                "name": "flag:door_BMT12_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "7,6": [
            {
                "type": "setValue",
                "name": "flag:door_BMT12_6_5",
                "operator": "+=",
                "value": "1"
            }
        ],
        "5,10": [
            {
                "type": "setValue",
                "name": "flag:door_BMT12_6_9",
                "operator": "+=",
                "value": "1"
            }
        ],
        "7,10": [
            {
                "type": "setValue",
                "name": "flag:door_BMT12_6_9",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,5": {
            "0": {
                "condition": "flag:door_BMT12_6_5==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            },
            "1": null
        },
        "6,9": {
            "0": {
                "condition": "flag:door_BMT12_6_9==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    }
                ]
            }
        }
    },
    "cannotMove": {},
    "map": [
    [311,311,311,311,311,20142, 17,311,311,311,311,311,311],
    [311, 33,327,334,311,20059,20060,20061,311,334,328, 33,311],
    [311,311,254,311,311,20067,20068,20069,311,311,254,311,311],
    [311, 34,328, 34,311,  0,340,  0,311, 34,327, 34,311],
    [311,311,251,311,311,  0,  0,20103,311,311,251,311,311],
    [311, 33,  0, 21,311,311, 85,311,311, 21,  0, 33,311],
    [311, 87,275,  0,311,241,  0,241,311,  0,275, 88,311],
    [311,311,311,  0, 23,  0,321,  0, 23,  0,311,311,311],
    [311,327,311,275,311, 33,  0, 33,311,275,311,328,311],
    [311,  0,277,  0,311,311, 85,311,311,  0,277,  0,311],
    [311, 33,311, 21,311,218,  0,218,311, 21,311, 33,311],
    [311,  0,277,  0,275,  0,394,  0,275,  0,277,  0,311],
    [311,311,311,311,311,311,311,311,311,311,311,311,311]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,311,311,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,20052,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,103,  0,  0,  0,103,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,20095,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,103,  0,  0,  0,103,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,103,  0,  0,  0,103,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "underGround": true,
    "hard1_enemy_ratio": 80,
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}