main.floors.Cave2=
{
    "floorId": "Cave2",
    "title": "特训营-2",
    "name": "特训营-2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "ground7",
    "bgm": "area12.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "area12.mp3"
        },
        {
            "type": "setVolume",
            "value": 90,
            "time": 0
        },
        {
            "type": "moveHero",
            "steps": [
                "down",
                "down"
            ]
        },
        "\t[hero]……原来特训营内部是这个样子吗，我还以为就只是个山洞呢。",
        "\t[芳芷,hero2]嗯，这里是智械进行战斗训练的核心场所，当然不会那么穷酸。",
        "\t[hero]但是这训练对手都好强啊……我之前见过的任何智械参赛者，恐怕都没有能力挑战这里——\n不对，应该说是，他们如果挑战这里，完全是自寻死路。\n我也比他们强不到哪去。",
        "\t[芳芷,hero2]因为启动了最高级别警戒，所以各种最强的训练对手都被放了出来。\n原本预计好几年内都不会再用上呢。",
        "\t[hero]……这么强的敌人，真的是我能抗衡的吗……",
        "\t[芳芷,hero2]不用担心，不论是各种敌人的信息还是布局的设置，我都了如指掌！\n毕竟……很多设计工作都是我完成的。",
        "\t[晴芸,hero3]原来如此，绿姐姐一定搞了很多坑人的机关吧？赶快告诉我们怎么能躲开！",
        "\t[芳芷,hero2]才没有！特训营的存在是为了锻炼和考察智械的战斗能力，\n那种坑人的机关不能达成这个目的，我肯定不搞那种东西的。",
        {
            "type": "if",
            "condition": "core.itemCount(\"redKey\") > 0",
            "true": [
                "\t[芳芷,hero2]总之大胆地前进吧！小心那些\\i[E578]追击怪，运用好你的技能躲避或者堵住它们就行啦！\n是不是很简单？"
            ],
            "false": [
                "\t[芳芷,hero2]总之大胆地前进吧！小心那些\\i[E578]追击怪，运用好你的技能躲避或者堵住它们，并且\r[yellow]留好回来的道路\r就行啦！\n是不是很简单？"
            ]
        },
        "\t[hero]……我尽量。",
        {
            "type": "waitAsync"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "10,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "afterBattle": {
        "9,8": [
            {
                "type": "setValue",
                "name": "flag:door_Cave2_10_9",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(10, 9);\n}"
            }
        ],
        "11,8": [
            {
                "type": "setValue",
                "name": "flag:door_Cave2_10_9",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(10, 9);\n}"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "10,9": {
            "0": {
                "condition": "flag:door_Cave2_10_9==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_Cave2_10_9",
                        "value": "null"
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.hideBgFgMap(\"bg2\", [\n\t[9, 8],\n\t[11, 8]\n]);\n\n}"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "map": [
    [145,145,145,145,145,145, 87,145,145,145,145,145,145],
    [145,570,334, 23,145,331,  0,334, 84,  0, 88,  0,145],
    [145,332,594,327,145,  0,  0,  0,145,593, 21,593,145],
    [145,145, 82,145,145,145,579,145,145,145, 81,145,145],
    [145,334,  0,557, 21,145,  0,145, 21,  0,331,  0,145],
    [145,  0,324,  0,  0,594,  0, 82,  0,145,  0,578,145],
    [145,585,145,145, 81,145,145,145, 81,145,145, 82,145],
    [145,  0,  0,604,  0,334,145,  0,586,  0,330,  0,145],
    [145,331,145,145,145,  0, 81, 21,  0,595,  0,595,145],
    [145,557,145,327,145,580,145,581,145,145, 85,145,145],
    [145,  0,145,594,145,  0,145,  0,145,327,570,328,145],
    [145, 22,585,325, 81, 21,  0,332,145,331, 21,330,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,865,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,168,  0,168,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "hard1_enemy_ratio": 80,
    "color": null,
    "underGround": true,
    "upFloor": [
        6,
        0
    ],
    "downFloor": [
        10,
        1
    ],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}