main.floors.Cave17=
{
    "floorId": "Cave17",
    "title": "幻境",
    "name": "幻境",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "sand",
    "bgm": "story2.mp3",
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "story2.mp3"
        },
        {
            "type": "setVolume",
            "value": 90,
            "time": 0
        },
        "\t[hero]\b[this,hero]咦，这里是？",
        "\t[古亦,N605]\b[this,6,1]长期以来，智械的平均智力水平都比不上械灵——\n你们都知道械灵是什么吧。",
        "\t[hero]\b[this,hero]嗯。",
        "\t[古亦,N605]\b[this,6,1]现在你们看到的，就是智械们上课学习的情景。\n这些都是诞生于3年前的新一代智械。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[芳芷,hero2]\b[down,6,7]今天我们的话题是\r[yellow]理想\r。\n各位都有什么追求，想做什么事情呢？",
        "\t[1185,N610]\b[down,7,5]我想认识很多很多人，交很多很多朋友！",
        "\t[芳芷,hero2]\b[down,6,7]诶，真是简单而实用的理想呢。\n不过你要注意多提升自己的知识水平，才能让大家更愿意与你做朋友呀。",
        "\t[1857,N618]\b[down,8,4]什么，这也太难了吧！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[2274,N614]\b[down,5,5]我想做厨师！我喜欢煮东西！有食材就煮食材，没有的话……煮人也行！",
        {
            "type": "animate",
            "name": "E_sweat",
            "loc": [
                6,
                7
            ],
            "async": true
        },
        "\t[芳芷,hero2]\b[down,6,7]喂，煮人是不好的。",
        "\t[1857,N618]\b[down,8,4]什么，这也太难了吧！",
        {
            "type": "waitAsync"
        },
        "\t[2221,N600]\b[down,6,4]哼，你们短浅的目光也就能看到这些了。",
        {
            "type": "move",
            "loc": [
                6,
                4
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "down:1"
            ]
        },
        "\t[2221,N600]\b[down,7,4]我跟你们不一样。我的理想不局限在我个人，而在于更宏大的、跟我们每一个智械都息息相关的事情。",
        "\t[1857,N618]\b[down,8,4]什么，太难了，太难了吧！",
        {
            "type": "animate",
            "name": "E_angry",
            "loc": [
                6,
                7
            ],
            "async": true
        },
        "\t[芳芷,hero2]\b[down,6,7]1857，安静！",
        {
            "type": "animate",
            "name": "E_dots",
            "loc": [
                8,
                4
            ]
        },
        {
            "type": "waitAsync"
        },
        "\t[2221,N600]\b[down,7,4]我最近学习了一些历史知识。你们知道吗，就在几年前，智械研究长期没有突破，研究者们能获得的经费越来越少，进一步地使得研究的进行更加困难，形成了恶性循环。",
        "\t[2221,N600]\b[down,7,4]按这个趋势发展下去，我们根本就不会诞生！",
        "\t[2221,N600]\b[down,7,4]是\r[yellow]1188\r拯救了我们！在普遍无能的老一代智械中，他毫无疑问是一个异类。\n不仅能力远超其他智械，甚至还去挑战械灵，屡战屡胜！",
        "\t[2221,N600]\b[down,7,4]是1188让人类高层看到了智械身上的潜力，我们身上的潜力！\n所以智械研究项目才得以顺利地进行下去，才有了我们的今天。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[1185,N610]\b[down,7,5]我也看过这段历史，老一代智械是在城里简陋的实验室里诞生和成长的，不像我们新一代智械能有特训营这样的条件。",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[2221,N600]\b[down,7,4]但是，械灵的整体能力一直压在我们智械头上，这个情况到今天都还没扭转。\n毕竟，1188只是个体，不足以扭转整个智械群体的态势。",
        "\t[2221,N600]\b[down,7,4]所以，我要变得像1188一样NB！我们要和他并肩战斗，让智械整体的实力全面发展，最终完成对械灵的反超！",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[1857,N618]\b[down,8,4]哼，吹牛皮说大话一套一套的，就是不知道你能做出什么行动。",
        "\t[2221,N600]\b[down,7,4]你还不知道吧，几天之后就是\r[yellow]第一届激励大赛\r开始的日期了。我一定会在比赛中把那些械灵踩！在！脚！下！",
        {
            "type": "playSound",
            "name": "059-Applause01.ogg"
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    4
                ],
                [
                    5,
                    5
                ],
                [
                    7,
                    5
                ],
                [
                    8,
                    4
                ],
                [
                    6,
                    7
                ],
                [
                    6,
                    5
                ]
            ],
            "remove": true,
            "time": 1000
        },
        "\t[hero]\b[this,hero]（感觉除了2221之外，这些智械的心理年龄都只相当于人类10岁小孩的程度……\n虽然刚才古亦说它们的实际年龄是3岁，不过这种成长速度还是太慢了，就连跟我比都差得远。\n难怪绿姐姐说智械=智障，给它们上课肯定很痛苦吧。）",
        {
            "type": "playSound",
            "name": "mteleport.wav"
        },
        {
            "type": "changeFloor",
            "floorId": "Cave18",
            "loc": [
                7,
                12
            ],
            "direction": "up",
            "time": 800
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [60057,60057,60057,60057,60057,60057,60057,60057,60058,  0, 17,  0,  0],
    [  0,  0,  0,  0,  0,522,605,  0,  0,60015, 17,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 17,  0,  0],
    [ 17, 17, 17, 17,393,  0,600,  0,618,  0, 17,  0,  0],
    [  0,  0,  0, 17,  0,614,  0,610,  0,  0, 17,  0,  0],
    [  0,  0,  0, 17,  0,  0,  0,  0,  0,  0, 17,  0,  0],
    [  0,  0,  0, 17,  0,  0,339,  0,  0,  0, 17,  0,  0],
    [  0,  0,  0, 17, 17,  0,  0,  0,  0, 17, 17,  0,  0],
    [  0,  0,  0,  0, 17, 17, 17, 17, 17, 17,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,150,154,155,156],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,150,154,155,156],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,150,154,155,156],
    [150,150,150,150,150,  0,  0,  0,  0,150,154,155,156],
    [154,154,154,154,150,  0,  0,  0,  0,150,154,155,156],
    [155,155,155,154,150,  0,  0,  0,  0,150,154,155,156],
    [156,156,155,154,150,  0,  0,  0,  0,150,154,155,156],
    [156,156,155,154,150,150,  0,  0,150,150,154,155,156],
    [156,156,155,154,154,150,150,150,150,154,154,155,156],
    [156,156,155,155,154,154,154,154,154,154,155,155,156],
    [156,156,156,155,155,155,155,155,155,155,155,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,60006,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {}
}