main.floors.Ch4_70_2=
{
    "floorId": "Ch4_70_2",
    "title": "隐居小屋",
    "name": "隐居小屋",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "ground3",
    "bgm": null,
    "color": null,
    "firstArrive": [
        {
            "type": "pauseBgm"
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "setValue",
            "name": "flag:a18_mid",
            "value": "2"
        },
        "\t[hero]\b[down,null]这……这里是哪？",
        "\t[？？,N786]\b[down,null]稍安勿躁，来先喝点茶。\n哦这位是智械……要不要充点电？",
        "\t[晴芸,hero3]\b[down,null]套近乎之前应该先自我介绍。",
        "\t[？？,N786]\b[down,null]咳……你还是那么毒舌。",
        "\t[晴芸,hero3]\b[down,null]我不认识你。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[？？,N786]\b[down,null]哎，一般是下属单方面认识领导，偏偏我这里是反过来的，我果然是不适合……",
        "\t[福平,N786]\b[down,null]我的代号是\r[yellow]福平\r，前\r[orange]第零公民\r——",
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": "hero",
            "async": true
        },
        {
            "type": "jumpHero",
            "dxy": [
                0,
                0
            ],
            "time": 300,
            "async": true
        },
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": [
                5,
                7
            ]
        },
        {
            "type": "waitAsync"
        },
        "\t[hero]\b[down,null]你跟福博是什么关系？",
        "\t[福平,N786]\b[down,null]只有代号的第一个字相同的关系。\n我被排挤出来的原因是，支持智械和械灵研究，与福博的理念相悖。\n不谦虚地讲，如果当初没有我支持，智械和械灵的研究早就被扼杀在摇篮里了。",
        {
            "type": "animate",
            "name": "E_dots",
            "loc": [
                5,
                7
            ]
        },
        "\t[福平,N786]\b[down,null]看来仅凭这些话还不足以令你信任我。\n那么，如果我说，\r[yellow]第零公民不做人的计划，正是我泄露出来的呢\r？",
        {
            "type": "playBgm",
            "name": "secret.mp3"
        },
        {
            "type": "jump",
            "from": [
                5,
                7
            ],
            "dxy": [
                0,
                0
            ],
            "time": 300,
            "keep": true,
            "async": true
        },
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": [
                5,
                7
            ]
        },
        {
            "type": "waitAsync"
        },
        "\t[晴芸,hero3]\b[down,null]你！",
        "\t[福平,N786]\b[down,null]他们不当人还不是最糟的。\n更糟的消息是，他们是\r[yellow]纯净派\r的！",
        "\t[hero]\b[down,null]纯净派？",
        "\t[福平,N786]\b[down,null]我提倡求同存异，善于发现各种不同的人身上的闪光点，这种理念的拥有者被称为\r[yellow]共存派\r。\n纯净派则认为大家都应该拥有一致的思想和理念，这样才能构建最高效、最和谐的社会。",
        "\t[hero]\b[down,null]大家想法都一样，社会运转就高效了，似乎挺有道理的……",
        "\t[福平,N786]\b[down,null]但是为了达成这个目标，他们首先要\r[orange]把想法不同的人都消灭\r。",
        "\t[福平,N786]\b[down,null]比如，福博认为机器人必须完全听从人的命令，像你这样有自主思考能力的机器人就是祸害，若是让他得知你的存在，那么你跟他，只能活一个。",
        "\t[hero]\b[down,null]这听起来就很恶劣了……\n所以，他们不做人的手段是？",
        "\t[福平,N786]\b[down,null]用各种方式将自己强化成究极生命体，彻底斩断自己作为人的社会性。\n没有任何法律能限制真正的修仙者——凭他们的行事风格，很可能在时机成熟之后反手就将这个世界吞噬，化为进阶路上的养料。",
        "\t[hero]\b[down,null]这……难以置信。",
        "\t[晴芸,hero3]\b[down,null]修仙者，真的存在？他们是从哪得到的消息？",
        "\t[福平,N786]\b[down,null]\r[yellow]至尊碎片\r。说起来从第一次发现至尊碎片到现在，已经过去快十年了……\n自那以后，我们的世界逐步与另一个世界建立起了联系。",
        "\t[福平,N786]\b[down,null]那个世界名为\r[yellow]玉梅天\r。\n从至尊碎片中的信息推测，这是一个比我们的世界更高等的位面，其中万物运转的规则与这里完全不同。",
        "\t[福平,N786]\b[down,null]至尊碎片从那里流入我们的世界，造成了深远的影响。比如出现在我们这里的“魔法”，就是那个世界的规则所塑造的。\n这位智械现在手上佩戴的毁灭拳套，也是一种至尊碎片。",
        "\t[hero]\b[down,null]……之前的皇极徽章看来也是，里面甚至还有一缕意识。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[福平,N786]\b[down,null]至尊碎片的出现是一切变故的开端。来自玉梅天的信息，使那些人看到了成为真正的神的可能性。\n很不幸的是，这帮人都不是什么善茬，他们的成神计划，不管最后是谁率先完成，对我们来讲恐怕都会是一场大灾难。",
        "\t[福平,N786]\b[down,null]我无法在明面上反对，只能在暗地里组织、培养反抗力量。我们必须在不被察觉的前提下，培养出一支战斗力强大的军队……",
        "\t[晴芸,hero3]\b[down,null]……智能机械。明面上说是为了更好地服务人类，其实它们就是为战斗而生的。",
        "\t[福平,N786]\b[down,null]正是。起初这个计划很成功，但是四年前，智械研究受到了福博的打压——于是我被排挤出第零公民的圈子，智械研究也被迫迁移到其他人的管辖范围外秘密进行。",
        "\t[福平,N786]\b[down,null]我做的最后一件事，是带领反抗力量在偏远地区建立格沃堡作为新的基地，让秉凌接替我的工作，然后宣称自己的研究失败，主动要求被软禁在这里，断绝与外界的一切联系。",
        "\t[晴芸,hero3]\b[down,null]通过这种方式，你尽可能地保护了你的下属。",
        "\t[福平,N786]\b[down,null]正是，我希望他们尽量不要被我牵连。\n他们都是意志坚定的人，即使没有我，他们也会继续完成计划。\n不过，有些时候，事与愿违……",
        {
            "type": "animate",
            "name": "E_dots",
            "loc": [
                5,
                7
            ],
            "async": true
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[福平,N786]\b[down,null]现在，可以告诉我你们来此的真实目的了吗？",
        {
            "type": "setVolume",
            "value": 0,
            "time": 1000,
            "async": true
        },
        {
            "type": "animate",
            "name": "E_dots",
            "loc": [
                5,
                7
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "E_dots",
            "loc": "hero"
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "setCurtain",
            "color": [
                0,
                0,
                0,
                1
            ],
            "time": 1000,
            "keep": true
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    5
                ]
            ],
            "remove": true
        },
        {
            "type": "setCurtain",
            "time": 1000
        },
        {
            "type": "waitAsync"
        },
        {
            "type": "setVolume",
            "value": 90,
            "time": 0
        },
        {
            "type": "pauseBgm"
        },
        "\t[福平,N786]\b[down,null]原来如此，原来如此！\nU型械灵，想不到秉凌他竟然真的做出来了！",
        "\t[晴芸,hero3]\b[down,null]前辈，我们有多大胜算？",
        "\t[福平,N786]\b[down,null]100%。",
        "\t[hero]\b[down,null]啊？这么有信心？\n我们刚刚还在外面被虎魔帮的人打得抱头鼠窜呢。",
        "\t[福平,N786]\b[down,null]但你也在迅速地学习和适应，不是吗？\n很快就会轮到你把他们打得抱头鼠窜了。",
        "\t[晴芸,hero3]\b[down,null]对了，说起虎魔帮，这里到底怎么回事，就没人管管他们？",
        "\t[福平,N786]\b[down,null]这里的管理者\r[yellow]秩见\r主修信仰之力，能够从虎魔帮成员极端的膜拜情绪中获得力量，然后他再将力量分出一部分赐予这些人作为奖励。",
        "\t[hero]\b[down,null]管理者真的叫秩见？那我们去哪找他？他们一直嚷嚷的洛渔神又是怎么回事？",
        "\t[福平,N786]\b[down,null]洛渔是秩见创造的工具人，专门负责煽动情绪和收集信仰。",
        {
            "type": "animate",
            "name": "E_unhappy",
            "loc": "hero"
        },
        "\t[晴芸,hero3]\b[down,null]换句话说就是给秩见干活的打工人。\n大老板在幕后对发生的一切都不闻不问，只等力量被送上门，还真是自在啊。",
        "\t[hero]\b[down,null]……我感觉已经全完了，面都没见到先打伤了他一堆信徒，这还怎么和平交流？",
        "\t[福平,N786]\b[down,null]你根本不用考虑怎么与他们交流，道不同不相为谋。\n这帮人跟福博一样，任何善意的批评都会被理解成恶意的抹黑，然后成为他们打倒你的借口。",
        "\t[hero]\b[down,null]那就好，说实话我真觉得那些家伙挺欠打的。\n唯一的问题是，我可能打不过他们了。",
        "\t[晴芸,hero3]\b[down,null]是呀，帮帮我们吧！",
        "\t[福平,N786]\b[down,null]属于我的斗争早就结束了——我现在除了这个住的地方，几乎一无所有。",
        {
            "type": "animate",
            "name": "E_unhappy",
            "loc": "hero"
        },
        "\t[福平,N786]\b[down,null]外面有几颗祖传的宝石，你们去拿吧。\n我能做的就这些。不要再回来找我了。",
        {
            "type": "animate",
            "name": "E_dots",
            "loc": "hero"
        },
        "\t[晴芸,hero3]\b[down,null]对了，我最后还有一个问题……",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[晴芸,hero3]\b[down,null]你支持智械研究的初衷，是为了抗衡其余可能打破力量平衡的第零公民。\n但现在你并不能掌控智能机械，你就不担心它们成为平衡的打破者吗？",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[晴芸,hero3]\b[down,null]我信任咕姐，我相信它是善良的。\n你能保证其他智械或械灵也是善良的吗？",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "E_dots",
            "loc": [
                6,
                4
            ]
        },
        "\t[福平,N786]\b[down,null]好问题。你的思维果然很敏锐。",
        "\t[福平,N786]\b[down,null]不用担心，这个问题我早有考虑。\n你相信，\r[yellow]人之初，性本善\r吗？",
        "\t[晴芸,hero3]\b[down,null]我不相信。人性是丑恶的，尤其是灾难来临时，为了自己的生存，什么卑劣的事情都可以做出来。这是生物的天性，只有极少拥有崇高追求的人，能用自己的理性压制对生存的渴望。",
        "\t[福平,N786]\b[down,null]但是机器人没有这种生物本能。",
        "\t[晴芸,hero3]\b[down,null]……是，这样吗……",
        "\t[hero]\b[down,null]为了达成目标，哪怕需要我将自己的生命值变成1，我也会毫不犹豫地去做。\n如果我死掉可以达成目标，我也会选择去死。",
        "\t[晴芸,hero3]\b[down,null]……",
        "\t[福平,N786]\b[down,null]但是要完成任务，首先必须要好好活着，这可能比死更困难。\n加油，前方的道路很艰难，祝你们好运。",
        {
            "type": "function",
            "function": "function(){\ncore.hideBgFgMap(\"bg2\", [\n\t[5, 7],\n\t[6, 7]\n], \"Ch4_70\");\ncore.flags.blurFg = 1;\n}"
        },
        {
            "type": "playSound",
            "name": "mteleport.wav"
        },
        {
            "type": "openDoor",
            "loc": [
                6,
                7
            ],
            "floorId": "Ch4_69"
        },
        {
            "type": "changeFloor",
            "floorId": "Ch4_70",
            "loc": [
                6,
                8
            ],
            "direction": "down",
            "time": 1000
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [141,141,141,141,141,141,141,141,141,141,141,141,141],
    [141,10080,10081,  0,10111,10056,10057,10058,120250,  0,10072,10073,141],
    [141,10088,10089,  0,  0,10064,10065,10066,  0,  0,10088,10089,141],
    [141,10096,10097,  0,  0,  0,  0,  0,  0,  0,10096,10097,141],
    [141,  0,110311,  0,  0,  0,786,  0,  0,  0,10167,10166,141],
    [141,110263,110319,  0,799,10040,10041,10042,  0,  0,  0,10144,141],
    [141,110271,  0,  0,  0,10048,10049,10050,  0,  0,  0,10152,141],
    [141,110279,  0,  0,  0,795,  0,  0,  0,  0,  0,10160,141],
    [141,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,141],
    [141,10095,  0,10092,10093,  0,  0,  0,  0,10077,10078,10095,141],
    [141,10103,  0,10100,10101,  0,  0,  0,  0,10085,10086,10103,141],
    [141,141,141,141,141,141, 93,141,141,141,141,141,141],
    [141,141,141,141,141,141,141,141,141,141,141,141,141]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,10032,10033,10034,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,20006,10055,20007,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,110099,  0,110099,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,10016,10017,10017,10017,10017,10017,10017,10017,10017,10017,10018,  0],
    [  0,10024,10025,10025,10025,10025,10025,10025,10025,10025,10025,10026,  0],
    [  0,  0,  0,  0,  0,  0,110090,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,110098,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,10035,10036,10037,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,10043,10044,10045,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,10051,10044,10053,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "hard1_enemy_ratio": 95
}