main.floors.Ch4_119=
{
    "floorId": "Ch4_119",
    "title": "柏兰大道-7",
    "name": "柏兰大道-7",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T754",
    "bgm": "area20.mp3",
    "color": [
        255,
        0,
        0,
        0.1
    ],
    "firstArrive": [
        {
            "type": "setBlock",
            "number": "N917",
            "loc": [
                [
                    11,
                    1
                ]
            ],
            "time": 500
        },
        "\t[修仙者,N917]\b[down,11,1]可恶，就差一点就能晋升塑神境了，到时候整个望梅界的强者榜也必定有我一席之地！\n哪个狗日的把电给断了，我定要他好看！",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "turnBlock",
            "direction": "left",
            "loc": [
                [
                    11,
                    1
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    11,
                    1
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    11,
                    1
                ]
            ]
        },
        "\t[修仙者,N917]\b[down,11,1]谔谔，这是什么邪火，我堂堂元魂境圆满的强者，竟然拿它没有任何办法！",
        {
            "type": "animate",
            "name": "fire",
            "loc": [
                11,
                1
            ]
        },
        "\t[修仙者,N917]\b[down,11,1]谔谔，啊啊啊啊啊啊！",
        {
            "type": "setBlock",
            "number": "A861",
            "loc": [
                [
                    11,
                    1
                ]
            ]
        },
        {
            "type": "function",
            "function": "function(){\ncore.hideBgFgMap(\"bg2\", [11, 1]);\n}"
        },
        {
            "type": "animate",
            "name": "fire2",
            "loc": [
                11,
                1
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,7": {
            "floorId": "Ch4_118",
            "loc": [
                12,
                6
            ]
        },
        "7,12": {
            "floorId": "Ch4_120",
            "loc": [
                6,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150318,150318,150318,150318,150318,150318,150318,150318,150318,861,861,861,861],
    [150318,334,569,150318,334,150318,569,334,150318,861,861,  0,861],
    [150318,569,334, 83,334, 83,334,569,150318, 22,861,861,861],
    [150318,334,568,150318,334,150318,568,334,150318,  0,334,861,861],
    [150318, 84,150318,150318, 82,150318,150318, 84,150318,877,861,861,861],
    [861,567,664,880,  0,666,  0,567,876,  0,861, 21,861],
    [861,861, 81,861,861,880,861,861,861, 81,878,665,861],
    [  0,  0,  0,334,861,  0,334,861,847,  0,861,861,861],
    [861,861,567,  0,877,566,  0, 81,  0,566, 82,567,861],
    [881,861,861,861,861,875,  0, 81,861,  0,861,569,861],
    [ 82,861,567,  0,873,  0,861,884,861,861,861, 82,861],
    [881, 82,  0,664,861,566,861,567,664,665,861,567,569],
    [861,861, 21,  0,877,  0,861,  0,861,861,861,861,861]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 89,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0, 93,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "hard1_enemy_ratio": 95,
    "downFloor": [
        0,
        7
    ],
    "upFloor": [
        7,
        12
    ]
}