main.floors.Ch4_93=
{
    "floorId": "Ch4_93",
    "title": "望梅界-1",
    "name": "望梅界-1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "area19_2.png",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 50,
    "defaultGround": "ground5",
    "bgm": "area19_2.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 400,
            "steps": [
                "up:1"
            ]
        },
        "\t[hero]\b[down,null]这就是望梅界吗……不知道怎么形容，总之跟外面确实大不相同。",
        "\t[晴芸,hero3]\b[down,null]这片空间可以让普通人体验异世修仙、成就一代至尊的感觉——不过只要离开，这种力量就失去作用了。\n有许多人来过这里之后就无法适应外面的生活了呢。",
        "\t[系统提示]\b[down,null]你可以从外面传送到望梅界入口，但在望梅界内无法使用\\i[fly]楼层传送器。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,10": [
            {
                "type": "function",
                "function": "function(){\ncore.hideBgFgMap(\"bg2\", [6, 10]);\n}"
            },
            "\t[hero]\b[down,null]坏了……这怎么刚进来就遇到这么强的人拦路……",
            "\t[夕月,E828]\b[up,6,8]晴芸，好久不见，你总算回来了……以\r[yellow]反叛者\r的身份。\n望梅界的最高管理者，现任“大魔王”，在此热烈欢迎二位尊贵的客人。",
            "\t[晴芸,hero3]\b[down,null]夕月……还是应该恭喜你，如愿达到了与你的能力相匹配的位置。\n一个区域的最高管理，城主的直属下级，是一等公民所能达到的顶点了。",
            "\t[hero]\b[down,null]？？什么情况，你们认识？",
            "\t[夕月,E828]\b[up,6,8]何止认识，两年前望梅界二代大魔王选举，她可是头号种子呢。",
            {
                "type": "animate",
                "name": "E_surprise",
                "loc": "hero"
            },
            "\t[hero]\b[down,null]我去，还有这种事情！",
            "\t[晴芸,hero3]\b[down,null]……",
            "\t[夕月,E828]\b[up,6,8]她竟然没跟你说过吗？\n不过后来的事情你应该已经知道了，因为某种原因，她不得不离开摩宇城，才让我侥幸坐上了这个位置。",
            "\t[夕月,E828]\b[up,6,8]话虽如此，但是城主下令防卫军进驻望梅界的时候，我什么都做不了。\n而且，还有一些其他的事情，我也是有心无力……",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[夕月,E828]\b[up,6,8]对于你们的行为，我持中立态度。\n有一些区域被我藏起来了，有许多人还躲在那里接着“修仙”，他们甚至还不知道已经开战了。\n希望你们尽量不要牵扯无关的人进来。",
            "\t[hero]\b[down,null]没问题，我们只走必经之路。",
            "\t[夕月,E828]\b[up,6,8]那么，祝你们好运。",
            {
                "type": "openDoor",
                "loc": [
                    5,
                    7
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    7
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    7,
                    7
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    1,
                    2
                ],
                "floorId": "Ch4_85"
            },
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        8
                    ]
                ],
                "remove": true
            },
            {
                "type": "animate",
                "name": "light2",
                "loc": [
                    6,
                    8
                ]
            },
            "\t[hero]\b[up,hero]走了……还好不是敌人。她的力量真不是一般的强，真打起来我恐怕是要原地暴毙给你看。",
            {
                "type": "changePos",
                "direction": "down"
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[hero]\b[up,hero]所以，我之前真的小看你了。\n万万没想到你在一等公民当中也相当不凡，她刚才说你是二代大魔王候选的头号种子……也难怪，如果只是一般的一等公民，恐怕不会被2221这么重视吧？",
            "\t[hero]\b[up,hero]如果不是那件事，我来到这里见到的大概就是“晴芸大魔王”了？\n然后你见面手起刀落，一刀结束战斗……",
            "\t[晴芸,hero3]\b[down,null]才不会，你把我想成什么人了。\n名为大魔王，实为偶像。职责主要是接受普通人的崇拜和追捧，再反过来给他们以精神慰藉，帮助维护社会稳定。",
            "\t[hero]\b[up,hero]偶像？还有这种职业？\n听起来好像跟之前在拓岩镇见到的“洛渔”差不多。",
            "\t[晴芸,hero3]\b[down,null]没错，就是那个意思。\n说起来看你这装束也像个偶像的样子，居然连这都不知道。\n万一你以后也成了偶像，然后有粉丝管你叫爹，你是不是就直接脑袋短路了？",
            {
                "type": "animate",
                "name": "E_sweat",
                "loc": "hero",
                "async": true
            },
            "\t[hero]\b[up,hero]会有这种粉丝吗……还真不知道该怎么处理……",
            "\t[晴芸,hero3]\b[down,null]当然，虽然她的实际职业是偶像，但同时也是望梅界的最高管理者，能够操控的力量非常庞大。\n不过这也就只局限于这片空间内而已，你如果转身逃出这里，她拿你一点办法都没有。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[hero]\b[up,hero]她刚才提到，有一些事情是她有心无力的，这就是原因吧。\n不知是什么事情。",
            "\t[晴芸,hero3]\b[down,null]她很显然是有意提到的，说不定我们，或者说“反抗军”，能帮上忙。",
            {
                "type": "changePos",
                "direction": "up"
            },
            "\t[hero]\b[up,hero]嗯，继续前进吧。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "12,7": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,12": {
            "floorId": "Ch4_83",
            "loc": [
                11,
                1
            ],
            "time": 500
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 82,702,566, 17,333, 17,334, 81,566, 17, 21, 17,566],
    [702, 17,  0, 17,  0, 22,810, 17,332, 17,661, 17,334],
    [ 23, 17,660,809,334,  0,332, 17,820, 17,807, 17,807],
    [ 17, 17, 81, 17, 17, 82, 17, 17, 21, 81,  0,662,  0],
    [334, 17,332, 17,566,  0, 21, 17,815, 17, 17, 17,660],
    [ 81, 17,  0, 17,  0,333,  0, 17,  0, 17,334, 83,  0],
    [ 21,  0,661,807, 22, 85, 85, 85,  0, 81,  0, 17, 87],
    [ 17, 81, 17, 17,811, 17,828, 17, 17, 17,809, 17, 17],
    [660,820,811,  0,  0, 17,  0, 17, 22,807, 21,332, 17],
    [  0,333, 17, 17, 17, 17,  0, 17, 17, 17,820, 17, 17],
    [ 21,  0,661, 17, 17,  0,  0,  0, 17,660,  0,333, 17],
    [ 17, 17, 17, 17, 17,  0, 89,  0, 17, 17, 17, 17, 17]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [308,308,308,  0,308,  0,308,308,308,  0,308,  0,308],
    [308,  0,308,  0,308,308,308,  0,308,  0,308,  0,308],
    [308,  0,308,308,308,308,308,  0,308,  0,308,  0,308],
    [  0,  0,308,  0,  0,308,  0,  0,308,308,308,308,308],
    [308,  0,308,  0,308,308,308,  0,308,  0,  0,  0,308],
    [308,  0,308,  0,308,308,308,  0,308,  0,308,308,308],
    [308,308,308,308,308,308,308,308,308,308,308,  0,308],
    [  0,308,  0,  0,308,  0,308,  0,  0,  0,308,  0,  0],
    [308,308,308,308,308,  0,308,  0,308,308,308,308,  0],
    [308,308,  0,  0,  0,  0,308,  0,  0,  0,308,  0,  0],
    [308,308,308,  0,  0,308,308,308,  0,308,308,308,  0],
    [  0,  0,  0,  0,  0,308,308,308,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,168,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        6,
        12
    ],
    "hard1_enemy_ratio": 95
}