main.floors.Ch4_117=
{
    "floorId": "Ch4_117",
    "title": "柏兰大道-5",
    "name": "柏兰大道-5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T754",
    "bgm": "area20.mp3",
    "color": [
        255,
        0,
        0,
        0.1
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,2": {
            "floorId": "Ch4_116",
            "loc": [
                12,
                8
            ]
        },
        "6,12": {
            "floorId": "Ch4_118",
            "loc": [
                1,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "10,8": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_116_10_11",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(10, 11);\n}"
            }
        ],
        "9,9": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_116_10_11",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(10, 11);\n}"
            }
        ],
        "10,10": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_116_10_11",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(10, 11);\n}"
            }
        ],
        "11,9": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_116_10_11",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(10, 11);\n}"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "10,11": {
            "0": {
                "condition": "flag:door_Ch4_116_10_11==4",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_Ch4_116_10_11",
                        "value": "null"
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.hideBgFgMap(\"bg2\", [\n\t[10, 8],\n\t[9, 9],\n\t[10, 10],\n\t[11, 9]\n]);\n}"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150318,567,664,876,861,665,150468,569,150468,  0,665,  0,150468],
    [150318,861,861,  0,877,  0,150468, 83,150468,334,847,566,  0],
    [  0,  0,874,861,334,861,861,  0,887, 81,  0,150464,664],
    [150318, 81,  0,861,847,  0, 21,  0,885,861,567,150464,150464],
    [874,  0,874,861,  0,566,861, 82,  0,334,876,  0,  0],
    [  0, 81,861, 81,  0, 81,567,  0, 21, 81,  0,334,150464],
    [874,  0, 81,  0,861,  0,861, 82,  0,  0,878,  0,847],
    [150318,874,  0,874,861,566,  0,873,334,861, 83,150468,665],
    [150318,150318, 82,150318,  0,  0,847,  0,861,  0,879,  0,150468],
    [150318,567,884,150318, 83,334,  0,566,861,879,  0,879,  0],
    [150318,880,150318,666,830,150318, 84,861,861,  0,879,  0,861],
    [150318, 22,884,665,150318,880,334,861,861,861, 85,861,861],
    [150318,150318,150318,150318,861,861,  0,861,334,830,831,830,666]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,867,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,168,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,168,  0,168,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,168,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0, 93,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "hard1_enemy_ratio": 95,
    "upFloor": [
        6,
        12
    ],
    "downFloor": [
        0,
        2
    ]
}