main.floors.Ch4_67=
{
    "floorId": "Ch4_67",
    "title": "拓岩镇-7",
    "name": "拓岩镇-7",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T770",
    "bgm": "area18.mp3",
    "color": [
        0,
        0,
        0,
        0.4
    ],
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[9, 6, 100]\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "0,1": {
            "floorId": "Ch4_66",
            "loc": [
                12,
                0
            ]
        },
        "12,1": {
            "floorId": "Ch4_68",
            "loc": [
                0,
                1
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {
        "1,10": [
            {
                "type": "animate",
                "name": "E_surprise",
                "loc": [
                    0,
                    9
                ]
            },
            "\t[五等公民,N691]\b[up,0,9]哇，好汉饶命，好汉饶命啊！",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            {
                "type": "moveHero",
                "steps": [
                    "left:1"
                ]
            },
            {
                "type": "trigger",
                "loc": [
                    0,
                    10
                ]
            },
            {
                "type": "moveHero",
                "steps": [
                    "left:1"
                ]
            },
            {
                "type": "changePos",
                "direction": "up"
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[五等公民,N691]\b[up,0,9]谔，你们，不是虎魔帮的人？",
            "\t[晴芸,hero3]\b[up,hero]你这小地方躲得倒是不错，外面虎魔帮的人为了追杀我们叫得呼天号地，你都不知道。",
            "\t[五等公民,N691]\b[up,0,9]这！能够被虎魔帮追杀还如此镇定自若，这是何等的狠人！\n二位大姐饶命，小的什么都不知道，也什么钱都没有！",
            "\t[hero]\b[up,hero]……我们没有那个想法。",
            "\t[五等公民,N691]\b[up,0,9]那，那你们闯进来是为啥？\n不谋财不害命……难，难道是劫色的？",
            "\t[晴芸,hero3]\b[up,hero]……噗。",
            {
                "type": "animate",
                "name": "E_sweat",
                "loc": "hero"
            },
            "\t[晴芸,hero3]\b[up,hero]不胡闹了，我就是很好奇，虎魔帮这么嚣张地迫害别人，你怎么还不跑路？\n在这躲得了一时，还能躲得了一世？",
            "\t[五等公民,N691]\b[up,0,9]哎，跑路也需要条件啊，那些有钱的四等公民早跑了。\n何况，虎魔帮这种扫荡活动已经举行过很多次了，我可是躲藏好手，只要熬过这阵，他们就不会对普通人出手了。",
            "\t[晴芸,hero3]\b[up,hero]哦？",
            "\t[五等公民,N691]\b[up,0,9]是的，平日里虎魔帮成员不会迫害其他人，据说这叫“洛渔神对异端的怜悯”。\n抛开这偶尔的扫荡活动来讲，在这生活不愁吃不愁穿，我的心里只有感恩。",
            "\t[晴芸,hero3]\b[up,hero]……不打扰了，告辞。\n我们帮你把门关上？",
            "\t[五等公民,N691]\b[up,0,9]太好了，多谢二位不杀之恩，让我自己在这静静。",
            {
                "type": "changePos",
                "direction": "right"
            },
            {
                "type": "jumpHero",
                "loc": [
                    2,
                    10
                ],
                "time": 500
            },
            {
                "type": "changePos",
                "direction": "left"
            },
            {
                "type": "closeDoor",
                "id": "specialDoor",
                "loc": [
                    1,
                    10
                ]
            }
        ]
    },
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150120,150121,150122,150120,150121,150122,150120,150121,150122,150120,150121,150122,150120],
    [  0,  0,  0,331,  0, 81, 81,180,333,180,180,  0,  0],
    [180,180, 84,180,784,180, 21,180, 81,180,180,799,180],
    [ 22,180, 23,180,656,  0,772,180,331,  0, 81,  0,180],
    [774,180,180,180,775,180, 82,656, 81,657,180,773,180],
    [  0,331,772,  0,  0,334,  0,777, 21,779,180,332,180],
    [150004,797,180, 82,180,  0,180,180,180,180, 81,  0,180],
    [150004,334,656,657,180,778,180,657,  0,775,  0,774,  0],
    [150013,150004,180,180,180,  0,180,180, 21,150116,180,  0, 21],
    [691,150013, 21,  0,180,331,  0,773,  0,180,180, 83,180],
    [ 21, 81,  0,656,777,  0,330,180,775,180, 21,660, 21],
    [150013,150013,150013, 81,180,774,180,180,  0, 82,776,334,662],
    [150013,334, 81,334,180,  0,334,180,332,180,331, 23,331]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150003,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,150100,  0,  0,  0],
    [  0,150003,  0,  0,  0,  0,  0,  0,  0,150108,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150003,150003,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 94],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "upFloor": [
        12,
        1
    ],
    "downFloor": [
        0,
        1
    ],
    "hard1_enemy_ratio": 95
}