main.floors.Ch4_20=
{
    "floorId": "Ch4_20",
    "title": "遗落之蔽-12",
    "name": "遗落之蔽-12",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T670",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "E_dots",
            "loc": "hero"
        },
        "\t[hero]\b[up,hero]这里应该就是最后的考验了。",
        "\t[晴芸,hero3]\b[up,hero]守关的boss看起来不好对付，先拿这里的黄宝石解锁能力，把前面清理一遍吧。",
        {
            "type": "loadBgm",
            "name": "area15.mp3"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,7": [
            "\t[系统提示]需要清理前面所有敌人。正在检测中……",
            {
                "type": "function",
                "function": "function(){\ncore.plugin.checkEnemy(\"Ch4_11\", \"Ch4_20\");\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainEnemyCount>1)",
                "true": [
                    "共有${flag:remainEnemyCount}个敌人未清除。",
                    {
                        "type": "if",
                        "condition": "(flag:remainEnemyCount>641)",
                        "true": [
                            "当前剩余敌人较多，请自行检查。"
                        ],
                        "false": [
                            "剩余敌人：${flag:remainEnemyInfo}"
                        ]
                    }
                ],
                "false": [
                    "检测通过！\n剩余敌人：${flag:remainEnemyInfo}",
                    {
                        "type": "hide"
                    },
                    {
                        "type": "sleep",
                        "time": 500
                    },
                    "\t[械灵-Evil,E261]\b[down,6,4]这次来到我面前的，竟然是一个智械和一个上等人。",
                    "\t[hero]\b[down,6,4]最后的考验，就是将你击败了吧。",
                    "\t[械灵-Evil,E261]\b[down,6,4]没错，虽然我觉得既然你们最先闯过前面的阻碍，直接把“资格”给你们也不是不行，但是……",
                    "\t[械灵-Evil,E261]\b[down,6,4]械灵化技术还几乎从未被用在上等人身上。",
                    "\t[晴芸,hero3]\b[down,6,4]怎么，你们技术不成熟，做不到？",
                    "\t[械灵-Evil,E261]\b[down,6,4]理论是成熟的，械灵化技术已经改造过不少下等人，而下等人和上等人其实是一个物种。\n我只是不明白，为什么会有上等人带着一个智械，跑到这里接受械灵化改造。",
                    "\t[晴芸,hero3]\b[down,6,4]那你不用明白了，我没想接受械灵化改造，只是想上楼而已。",
                    "\t[械灵-Evil,E261]\b[down,6,4]这样吗，那我们走个流程就行。\n打败我，你们就可以上去了。",
                    {
                        "type": "animate",
                        "name": "E_unhappy",
                        "loc": "hero",
                        "async": true
                    },
                    "\t[hero]\b[down,hero]所以说了半天还是要打……"
                ]
            },
            {
                "type": "function",
                "function": "function(){\ncore.removeFlag(\"remainEnemyInfo\");\ncore.removeFlag(\"remainEnemyCount\");\n}"
            }
        ],
        "6,1": [
            {
                "type": "confirm",
                "text": "上去就无法返回了。",
                "yes": [
                    {
                        "type": "changeFloor",
                        "floorId": "Ch4_21",
                        "loc": [
                            6,
                            4
                        ],
                        "direction": "down",
                        "time": 1000
                    }
                ],
                "no": [
                    {
                        "type": "moveHero",
                        "steps": [
                            "backward"
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "Ch4_1B",
            "loc": [
                6,
                0
            ]
        }
    },
    "afterBattle": {
        "6,4": [
            {
                "type": "setBlock",
                "number": "E261",
                "loc": [
                    [
                        6,
                        4
                    ]
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    8,
                    4
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    7,
                    6
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    5,
                    6
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    4,
                    4
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    3
                ]
            },
            "\t[械灵-Evil,E261]\b[down,6,4]……没想到，还真有些本事。\n但是你们实在是太可疑了，一个上等人带着一个似乎不太简单的智械……",
            "\t[晴芸,hero3]\b[down,hero]怎么，你要食言，不放我们过去了？",
            "\t[械灵-Evil,E261]\b[down,6,4]情况特殊，我需要上报……等等……",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": [
                    6,
                    4
                ]
            },
            "\t[械灵-Evil,E261]\b[down,6,4]……我明白了。二位是很重要的客人。",
            {
                "type": "animate",
                "name": "E_question",
                "loc": "hero",
                "async": true
            },
            "\t[hero]\b[down,hero]（客人？？？）",
            "\t[械灵-Evil,E261]\b[down,6,4]没什么，刚刚接到了上面的指示而已。\n继续前进吧，祝你们一路顺风。",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "animate",
                "name": "zone",
                "loc": [
                    6,
                    4
                ]
            },
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[晴芸,hero3]\b[down,hero]这片区域这么快就通关啦~怎么样，是不是挺轻松的？",
            "\t[hero]\b[down,hero]唔，还好吧。有些怪物特技实在是够阴间的。。",
            "\t[晴芸,hero3]\b[down,hero]我倒是觉得一般般吧，而且我有预感，后面会遇到更阴间的特技~",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero",
                "async": true
            },
            "\t[hero]\b[down,hero]话说，刚才那家伙说他接到了上面的指令。\n我们来这里果然早就被预料到了吗……",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[晴芸,hero3]\b[down,hero]就算是那样又如何……没什么是我们解决不了的！\n冲吖~",
            {
                "type": "animate",
                "name": "E_unhappy",
                "loc": "hero",
                "async": true
            },
            "\t[hero]\b[down,hero]（又是这种，一切都被算计好了的情况……\n到底要变得多强，才能真正掌控自己的命运呢……）"
        ]
    },
    "afterGetItem": {
        "6,2": [
            "\t[hero]咦，又一张纸条。",
            "神看低等公民工作劳累 于心不忍\n神说 要提升低等公民的阶级 让他们拥有更多的自由\n神创造了机器人 要它们代替低等公民 完成他们的工作\n机器人逐渐多起来 原本的低等公民大多变为中等公民\n只余下那些曾经冒犯过神或其他神之子民的人 连同他们的子孙后代 都是低等公民 不得翻身",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero",
                "async": true
            },
            "\t[hero]这段内容……你怎么看？",
            "\t[晴芸,hero3]据我了解，机器人出现之后，镇和村里的低等公民的确少了许多，只剩下大城市中还有不少低等公民——也就是九等中的第三等。\n他们的工作有较高的学历和技巧要求，机器人暂时还不能取代他们。",
            "\t[hero]是吗，那太可惜了……\n如果所有工作都能由机器人代替人类去完成就好了。",
            "\t[晴芸,hero3]……你真的是这样想的？",
            "\t[hero]这不就是我们存在的意义吗？",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[晴芸,hero3]……",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[晴芸,hero3]不……不是这样的……",
            {
                "type": "animate",
                "name": "E_question",
                "loc": "hero"
            },
            "\t[晴芸,hero3]先不提那个了。我现在更关心的问题是，我们为什么会看到这个。\n它落在这里太巧了，仿佛是有什么人故意想让我们看到。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[晴芸,hero3]继续前进吧，说不定还能收集到这个故事的后续呢。",
            {
                "type": "setValue",
                "name": "flag:zzzl_1_2",
                "value": "1"
            }
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [174,110412,110412,110412,110412,110412,110412,110412,110412,110412,110412,110412,174],
    [174, 22,110280,334,  0,110235, 89,110235,  0,334,110280, 22,174],
    [174,334,333,110280,331,  0,320,  0,331,110280,333,334,174],
    [174,331, 21, 30,110280,110280, 85,110280,110280, 30, 21,331,174],
    [174,110280, 30, 21, 85,  0,261,  0, 85, 21, 30,110280,174],
    [174,110280,110280,332,110280,  0,  0,  0,110280,332,110280,110280,174],
    [174,332,110280,110280,660, 85,  0, 85,661,110280,110280,332,174],
    [174, 81,331,110280,110280,110280,126,110280,110280,110280,331, 81,174],
    [174,566, 82, 22,683,652,654,653,683, 22, 82,566,174],
    [174,331,110280, 30,110280, 81,671, 82,110280, 30,110280,331,174],
    [174,110280,110280,110280,110280,688,696,  0,110280,110280,110280,110280,174],
    [174,386, 82,386, 82,  0,  0,  0,679,334, 22,332,174],
    [174,174,174,174,174,174,  0,174,174,174,174,174,174]
],
    "bgmap": [
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,172,172,172,172,172,172,172],
    [172,172,172,172,172,172,110433,172,172,172,172,172,172]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0, 93,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "bgm": "area14.mp3",
    "hard1_enemy_ratio": 95,
    "flyPoint": [
        6,
        12
    ],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}