main.floors.Ch4_60=
{
    "floorId": "Ch4_60",
    "title": "拓岩镇外围",
    "name": "拓岩镇外围",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T770",
    "firstArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.setFlag(\"__visited__\", { Ch4_60: true });\ncore.values.animateSpeed = 450;\ncore.setFlag(\"fire_light_a\", 0.01);\n}"
        },
        {
            "type": "playBgm",
            "name": "area18.mp3",
            "keep": true
        },
        {
            "type": "pauseBgm"
        },
        {
            "type": "follow",
            "name": "hero3.png"
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "playSound",
            "name": "hint.mp3"
        },
        "\t[System]\b[down,null]已到达预设目的地，本次行程结束。",
        {
            "type": "playSound",
            "name": "飞行器"
        },
        {
            "type": "changePos",
            "loc": [
                0,
                8
            ],
            "direction": "down"
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]\b[down,null]这么快就到了。\n这次的任务只是送个信，实在有些无聊，这种跑腿的任务干嘛非要让我们来……",
        "\t[晴芸,hero3]\b[down,null]这信里面的内容肯定不简单，假如你是2221，攻打摩宇城之前要先做什么准备？",
        "\t[hero]\b[down,null]……不知道，我是22。",
        "\t[晴芸,hero3]\b[down,null]如果是我的话，首先要对不相干的第零公民表明自己的目的，避免把他们牵扯进来徒增事端。",
        "\t[晴芸,hero3]\b[down,null]另一方面也要尽可能地获取信息，据说这“秩见”是宗教方向的第零公民，远离世俗纷争，应该是比较好说话的。\n从他这里很可能可以打听到关于狱贤和福博的信息，知己知彼方能百战不殆。",
        "\t[hero]\b[down,null]听起来好有道理，这么看来我们的任务还挺重要的。",
        {
            "type": "moveHero",
            "time": 150,
            "steps": [
                "down:1",
                "right:4"
            ]
        },
        {
            "type": "animate",
            "name": "E_dots",
            "loc": "hero"
        },
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[hero]\b[down,null]话说这车就扔这了？",
        "\t[晴芸,hero3]\b[down,null]唔……这应该不属于我们的负责范围。\n前进吧。",
        {
            "type": "animate",
            "name": "E_unhappy",
            "loc": "hero",
            "async": true
        },
        {
            "type": "changePos",
            "direction": "right"
        },
        "\t[hero]\b[down,null]嗯……话说这街道也太空旷了……",
        "晴芸扶了扶头顶的兔耳朵。",
        "\t[晴芸,hero3]\b[down,null]我能听到远处传来的声音，这次其中夹杂的情绪是，盲从和狂热……",
        "\t[hero]\b[down,null]希望我不会被卷进去。"
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[0, 2, 100],\n\t[5, 2, 100],\n\t[10, 2, 100],\n\t[0, 10, 100],\n\t[5, 10, 100],\n\t[10, 10, 100],\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,8": {
            "floorId": "Ch4_61",
            "loc": [
                0,
                7
            ],
            "time": 2000
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150066,150067,150066,150067,150066,150067,150066,150067,150066,150067,150066,150067,150066],
    [150074,150075,150074,150075,150074,150075,150074,150075,150074,150075,150074,150075,150074],
    [150084,150085,150084,150085,150084,150085,150084,150085,150084,150085,150084,150085,150084],
    [150092,150093,150092,150093,150092,150093,150092,150093,150092,150093,150092,150093,150092],
    [150116,  0,  0,  0,  0,150116,  0,  0,  0,  0,150116,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,150452,150453,150454,150455,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,150460,150461,150462,150463,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150116,  0,  0,  0,  0,150116,  0,  0,  0,  0,150116,  0,  0]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150100,  0,  0,  0,  0,150100,  0,  0,  0,  0,150100,  0,  0],
    [150108,  0,  0,  0,  0,150108,  0,  0,  0,  0,150108,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,150444,150445,150446,150447,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150100,  0,  0,  0,  0,150100,  0,  0,  0,  0,150100,  0,  0],
    [150108,  0,  0,  0,  0,150108,  0,  0,  0,  0,150108,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150103,150103,150103,150103,150103,150103,150103,150103,150103,150103,150103,150103,150103],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150126,150126,150126,150126,150126,150126,150126,150126,150126,150126,150126,150126,150126],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 94],
    [150126,  0,150126,  0,150126,  0,150126,  0,150126,  0,150126,  0,150126],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150103,150103,150103,150103,150103,150103,150103,150103,150103,150103,150103,150103,150103],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "color": [
        0,
        0,
        0,
        0.4
    ],
    "bgm": null,
    "upFloor": [
        12,
        8
    ],
    "downFloor": [
        0,
        8
    ],
    "hard1_enemy_ratio": 95
}