main.floors.Ch4_104=
{
    "floorId": "Ch4_104",
    "title": "锻庚路-6",
    "name": "锻庚路-6",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T916",
    "bgm": "area19_2.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "up:1"
            ]
        },
        "\t[hero]\b[up,hero]咦，这不是铁焚吗？你不跑了？",
        "\t[铁焚,E818]\b[down,6,3]嘿嘿，呵哈哈哈哈！",
        {
            "type": "animate",
            "name": "E_question",
            "loc": "hero"
        },
        "\t[铁焚,E818]\b[down,6,3]就在刚才，狱贤大人将他的姓赐予我了！\n这是至高无上的荣耀！我\r[yellow]狱铁焚\r，必将为狱贤大人奋战至最后一刻！",
        "\t[hero]\b[up,hero]铁焚就是铁焚，管你什么鱼铁焚羊铁焚，姓什么都一样。",
        "\t[晴芸,hero3]\b[up,hero]而且嘴上说着狠话，身体却老老实实地躲在一串红门后面。",
        "\t[铁焚,E818]\b[down,6,3]哼，这可是狱贤大人亲自设置的三连红门阵，我倒要看看你们如何越过！\n只要等到增援到来，嘿嘿嘿……"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "Ch4_103",
            "loc": [
                6,
                0
            ]
        },
        "11,5": {
            "floorId": "Ch4_96",
            "loc": [
                2,
                6
            ],
            "time": 500
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,3": [
            {
                "type": "setBlock",
                "number": "E818",
                "loc": [
                    [
                        6,
                        3
                    ]
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    3,
                    2
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    9,
                    2
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    5,
                    4
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    5,
                    3
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    2
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    7,
                    3
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    7,
                    4
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "animate",
                "name": "E_dots",
                "loc": [
                    6,
                    3
                ]
            },
            "\t[铁焚,E818]\b[down,6,3]我败了……你们，怎么还不动手？莫非又想开嘴炮？\n不过，别以为我跟孤鸣那个废物一样！他只不过是追求力量和地位而已，但我不一样，追随狱贤大人就是我的人生信条！",
            "\t[晴芸,hero3]\b[down,hero]我有个问题。\n你如何看待反抗军的智能机械技术？机器人不应该只会听从命令，你如何评价这种设计理念？",
            "\t[铁焚,E818]\b[down,6,3]什么技术，什么理念，通通都没用！你们一堆无名小卒，跑到伟大的摩宇城来碰瓷的废物！\n你们击败我，也不过是获得了被狱贤大人踩！在！脚！下！的资格而已！",
            "\t[晴芸,hero3]\b[down,hero]还真是不加掩饰……看来你不仅地位比孤鸣更高，而且受到“那个”的影响也更深。\n那么，我问完了。",
            "\t[铁焚,E818]\b[down,6,3]我永远是狱贤大人的信徒，我的忠诚比机器更可靠，你们说什么都无法动摇！\n能够为狱贤大人献身，是我最大的荣耀！来杀了我吧！",
            "\t[hero]\b[down,hero]我曾经以为人都是有着复杂思维和情感的生物，远远比我们智能机械复杂，身居高位的人更是如此。\n想不到你堂堂摩宇城防卫军总指挥，脑子比虎魔帮那些人还简单。",
            "\t[铁焚,E818]\b[down,6,3]啥？什么虎魔帮？",
            "\t[hero]\b[down,hero]一帮整天就知道膜拜某只人造神明的家伙。",
            "\t[铁焚,E818]\b[down,6,3]哦，那他们是够傻的。\n有狱贤这种真神不去膜拜？",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            {
                "type": "animate",
                "name": "zhanji",
                "loc": [
                    6,
                    3
                ]
            },
            {
                "type": "hide",
                "remove": true
            },
            {
                "type": "animate",
                "name": "explosion",
                "loc": [
                    6,
                    3
                ],
                "async": true
            },
            {
                "type": "closeDoor",
                "id": "specialDoor",
                "loc": [
                    6,
                    0
                ]
            },
            {
                "type": "closeDoor",
                "id": "specialDoor",
                "loc": [
                    5,
                    1
                ]
            },
            {
                "type": "closeDoor",
                "id": "specialDoor",
                "loc": [
                    6,
                    1
                ]
            },
            {
                "type": "closeDoor",
                "id": "specialDoor",
                "loc": [
                    7,
                    1
                ]
            },
            "\t[铁焚,E818]\b[down,6,3]狱贤大人，我滴任务，完成啦……",
            "\t[hero]\b[down,hero]临死还不忘把路堵上，这铁焚，脑子不好使，给人添堵可真有一手。",
            "\t[晴芸,hero3]\b[down,hero]没关系，我知道这附近有通往望梅界的传送门，我们可以从那里进入摩极大厦内部。\n正好顺路，我现在有问题想问她……",
            {
                "type": "openDoor",
                "loc": [
                    11,
                    6
                ]
            },
            {
                "type": "changePos",
                "direction": "right"
            },
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            {
                "type": "waitAsync",
                "excludeAnimates": true
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,9": {
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [197,197,197,197,197,197,  0,197,197,197,197,197,197],
    [197,661, 21,160787,568,  0,  0,  0,569,160787, 22,661,197],
    [197,662,660, 85,  0,567, 85,566,  0, 85,660,662,197],
    [197,825,197,197,197, 85,843, 85,197,197,197, 23,197],
    [197,197,197,661,821, 85,  0, 85,821,660,197,197,197],
    [197,566,197,197,197, 82, 83, 82,197,197,197, 89,197],
    [197,566, 81,660,197,197, 83,197,197,661,197, 85,197],
    [197,197,197,566,821,  0, 83,  0,821,  0,567,  0,197],
    [197,566,566, 81,197,566,834,333,197,197,197, 82,197],
    [197,197,197,197,197,197, 81,197,197, 23,197, 82,197],
    [197,568, 82,566,197,  0,834,  0,197, 84,197, 82,197],
    [197,566,197,566, 81,333,  0,566, 84, 23,197, 23,197],
    [197,197,197,197,197,197,  0,197,197,197,197,197,197]
],
    "bgmap": [
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145]
],
    "fgmap": [
    [  0,  0,  0,160779,  0,  0,  0,  0,  0,160779,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0, 91,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0, 93,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "color": [
        0,
        0,
        0,
        0.1
    ],
    "downFloor": [
        6,
        12
    ],
    "upFloor": [
        11,
        5
    ],
    "hard1_enemy_ratio": 95
}