main.floors.Ch4_70=
{
    "floorId": "Ch4_70",
    "title": "拓岩镇-10",
    "name": "拓岩镇-10",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T770",
    "bgm": "area18.mp3",
    "color": [
        0,
        0,
        0,
        0.4
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": [
                7,
                11
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": [
                9,
                11
            ]
        },
        "\t[虎魔剑士,E772]\b[up,7,11]哈哈，我就知道你们肯定会往这种偏僻的地方逃跑，这下被抓个正着了吧！",
        "\t[hero]\b[up,hero]就凭你们？该去世了。"
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[4, 5, 100],\n\t[7, 5, 100]\n]);\n}"
        },
        {
            "type": "if",
            "condition": "(flag:a18_mid == 2)",
            "true": [
                {
                    "type": "openDoor",
                    "loc": [
                        2,
                        8
                    ]
                },
                {
                    "type": "openDoor",
                    "loc": [
                        10,
                        9
                    ]
                },
                {
                    "type": "follow",
                    "name": "hero3.png"
                },
                {
                    "type": "setValue",
                    "name": "flag:a18_mid",
                    "value": "3"
                },
                {
                    "type": "moveHero",
                    "steps": [
                        "down:1"
                    ]
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "animate",
                    "name": "E_dots",
                    "loc": "hero"
                },
                "\t[hero]\b[up,hero]想不到竟然在这里碰到了一位前第零公民。",
                "\t[晴芸,hero3]\b[up,hero]而且还是跟智械颇有关系的，说是你们智械的前任大领导也不为过。\n2221作为械灵之王，秉凌的后继者，应该是知道这个信息的，这也许是他派我们来这里的目的之一。",
                "\t[hero]\b[up,hero]不光是“这位前任大领导在这里”这件事本身，还有他刚才对我们所说的一切，2221应该都知道……\n这家伙，到底还隐瞒了多少信息没跟我们说……",
                "\t[晴芸,hero3]\b[up,hero]只可惜从他那里没能得到更多的帮助，比如直接帮我们扫平虎魔帮、核平拓岩镇之类的……",
                "\t[hero]\b[up,hero]这倒无妨，他给的帮助足够我对付虎魔帮了。",
                "\t[晴芸,hero3]\b[up,hero]咕姐强！无敌！冲！"
            ]
        }
    ],
    "parallelDo": "",
    "events": {
        "6,7": [
            {
                "type": "if",
                "condition": "(!flag:a18_mid)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "flag:a18_mid",
                        "value": "1"
                    },
                    {
                        "type": "animate",
                        "name": "E_dots",
                        "loc": "hero"
                    },
                    "\t[hero]\b[down,null]就是这里？看起来只是个废弃的工厂而已。\n等等，这是，传送！",
                    {
                        "type": "playSound",
                        "name": "mteleport.wav"
                    },
                    {
                        "type": "unfollow",
                        "name": "hero3.png"
                    },
                    {
                        "type": "setCurtain",
                        "color": [
                            255,
                            255,
                            255,
                            1
                        ],
                        "time": 1000,
                        "keep": true
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.flags.blurFg = 0;\n}"
                    },
                    {
                        "type": "changeFloor",
                        "floorId": "Ch4_70_2",
                        "loc": [
                            7,
                            7
                        ],
                        "direction": "up",
                        "time": 1000
                    }
                ],
                "false": [
                    "这里什么都没有。"
                ]
            }
        ],
        "5,7": [
            {
                "type": "insert",
                "loc": [
                    6,
                    7
                ]
            }
        ],
        "8,9": [
            {
                "type": "moveHero",
                "steps": [
                    "left:1"
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[晴芸,hero3]\b[up,8,9]呼……总算找到个地方能暂时歇一歇……",
            {
                "type": "changePos",
                "direction": "right"
            },
            "\t[hero]\b[up,hero]接下来怎么办？抓捕力量越来越强了，而他们那什么洛渔神还没现身，秩见更是不知去向。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": [
                    8,
                    9
                ]
            },
            "\t[晴芸,hero3]\b[up,8,9]等等，我在这里感受到了一种奇怪的力量……",
            {
                "type": "animate",
                "name": "E_question",
                "loc": "hero"
            },
            "\t[晴芸,hero3]\b[up,8,9]那边的建筑。去看看。",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "8,12": {
            "floorId": "Ch4_69",
            "loc": [
                6,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "7,11": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_70_8_10",
                "operator": "+=",
                "value": "1"
            }
        ],
        "9,11": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_70_8_10",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "8,10": {
            "0": {
                "condition": "flag:door_Ch4_70_8_10==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_Ch4_70_8_10",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150365,  0,  0,  0,  0,  0,  0,  0,  0,180,180,180,180],
    [150373,150374,150375,  0,  0,  0,  0,  0,  0,180,180,180,180],
    [150381,150382,150383,  0,  0,  0,  0,  0,  0,180,180,180,180],
    [150389,150390,150391,150344,150348,150344,150348,150344,150348,  0,  0,  0,  0],
    [180,180,  0,150344,150348,150344,150348,150344,150348,150371,150372,150373,150374],
    [180,180,150014,150318,150348,  0,  0,150344,150318,150379,150380,150381,150382],
    [150023,785,150014,150326,150356, 17, 17,150352,150326,150387,150388,150389,150390],
    [150013,664,150022,  0,150116,  0,  0,150116,150022,386,150385,150386,150011],
    [150013,665, 85,  0,  0,  0,  0,  0,150022, 82,150393,150394,150013],
    [150013,662,150369,150370,  0,  0,  0,  0,  0,  0, 85,331,150013],
    [150013,785,150377,150378, 84,150013,150013,150013, 85,150013,150013,332,150013],
    [150013,150013,150013,150013,568, 22,150013,771,  0,772,150013,333,150013],
    [150013,150013,150013,150013,150013,150013,150013,150013,  0,150013,150013,150013,150013]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,150144,150145,150146,150147,150148,150149,  0,  0,  0,  0],
    [  0,  0,  0,150152,150153,150154,150155,150156,150157,  0,  0,  0,  0],
    [  0,  0,  0,150152,150153,150154,150155,150156,150157,  0,  0,  0,  0],
    [  0,  0,  0,150160,150161,150162,150163,150164,150165,  0,150364,150365,150366],
    [  0,  0,150015,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [150015,  0,  0,  0,150100,  0,  0,150100,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,150108,  0,  0,150108,150015,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,150015,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,150302,150303,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,150310,150311,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0, 91, 91,  0,  0,150400,150401,150402,  0],
    [  0,150400,150401,150402,  0,  0,  0,  0,  0,150408,150409,150410,  0],
    [  0,150408,150409,150410,  0,  0,  0,  0,  0,150416,150417,150418,  0],
    [  0,150416,150417,150418,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0, 93,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        8,
        12
    ],
    "hard1_enemy_ratio": 95
}