main.floors.Ch4_121=
{
    "floorId": "Ch4_121",
    "title": "千虹广场-1",
    "name": "千虹广场-1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T754",
    "bgm": "area21.mp3",
    "color": [
        0,
        0,
        0,
        0.3
    ],
    "firstArrive": [
        {
            "type": "setCurtain",
            "time": 0
        },
        {
            "type": "playBgm",
            "name": "area21.mp3"
        },
        {
            "type": "function",
            "function": "function(){\ncore.removeFlag(\"__weather__\");\ncore.setFlag(\"__visited__\", { Ch4_121: true });\ncore.values.animateSpeed = 400;\ncore.setFlag(\"zone_animate\", \"zone2\");\ncore.drawHero();\n}"
        },
        "\t[hero]就是这里了，前方的能量波动越来越强大了，想必便是2221跟福博大战的地方。\n以我现在的实力，应该也能帮上点忙了。",
        {
            "type": "show",
            "loc": [
                [
                    6,
                    2
                ]
            ]
        },
        {
            "type": "animate",
            "name": "light2",
            "loc": [
                6,
                2
            ]
        },
        "\t[械灵-Angel,E862]总算找到你了！快跑吧，现在情况很不妙，无数被封印的怪物都从地下钻了出来，正常人也纷纷变异成战斗力极其恐怖的怪物，甚至在摩宇城外都有这种现象出现。",
        "\t[械灵-Angel,E862]那位大人又被福博缠住帮不了我们，虽然还有9961在保护大家进行避难，但还是有很多人来不及获救……",
        "\t[hero]不用担心我。我现在状态很好。\n该对这一切做个了断了。\n我一定要做到。我一定能做到。",
        "\t[械灵-Angel,E862]姐姐……保重。",
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    2
                ]
            ],
            "remove": true
        },
        {
            "type": "animate",
            "name": "light2",
            "loc": [
                6,
                2
            ]
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,11": [
            "\t[系统提示]拾取\\i[redRHeart]可爱元素会受到大量伤害。\n如果拾取时拥有临时护盾，会\r[orange]消耗1层临时护盾以抵挡伤害\r，抵挡量等同于所有临时护盾在战斗中的抵挡数值（也就是每\r[yellow]1\r点临时护盾抵挡\r[yellow]2\r点伤害）。"
        ],
        "6,2": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "10,12": {
            "floorId": "Ch4_122",
            "loc": [
                2,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {
        "10,11": [
            "\t[hero]\b[up,hero]？？？这是什么鬼东西？\n一接触到它，一阵侵蚀感就涌上来……\n难道是，“那个”的力量结晶？"
        ]
    },
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [197,197,197,197,197,197,  0,197,197,197,197,197,197],
    [197,851,852,851, 83,  0,  0,  0, 83,881,881,881,197],
    [197,197,197, 84,197,  0,890,  0,197, 84,197,197,197],
    [197, 23, 84, 23, 84,  0,  0,  0, 84, 23, 84, 23,197],
    [197, 84,197,197,197,881,  0,569,197,197,197, 84,197],
    [197, 23,702, 82,702,  0, 23,  0, 82,702, 82, 23,197],
    [197, 84,197,702,197,569,  0,881,197, 82,197, 84,197],
    [197, 23,702, 82,197,  0,  0,  0,197,702, 82, 23,197],
    [197,197,197,197,197,  0,  0,  0,197,197,197,197,197],
    [197,568,197,568, 81,  0,  0,  0,  0,  0,  0,  0,  0],
    [197, 81,197, 81,197,197,197, 82,197,149,149, 83,149],
    [197,568, 81,568,197,881, 82,881,197,129,891,  0,149],
    [197,197,197,197,197,197,197,197,197,149,  0,149,149]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,301,301,301,301],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,301,301,301,301],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,301,301,301,301]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 93,  0,  0]
],
    "fg2map": [

],
    "hard1_enemy_ratio": 95,
    "weather": [
        "rain",
        1
    ],
    "upFloor": [
        10,
        12
    ],
    "downFloor": [
        6,
        0
    ]
}