main.floors.Ch4_42=
{
    "floorId": "Ch4_42",
    "title": "摩极大厦90F",
    "name": "摩极大厦90F",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "images": [],
    "ratio": 50,
    "defaultGround": "T754",
    "bgm": "CutterUp.mp3",
    "color": [
        0,
        0,
        0,
        0.01
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "playBgm",
            "name": "CutterUp.mp3",
            "keep": true
        },
        "\t[终端]\b[down,6,2]除灵者首领请求呼叫。",
        "\t[？？？,N750]\b[down,6,7]接通。",
        "\t[除灵者首领]\b[down,6,2]报告大人，我们于今天下午击毙械灵U，摧毁智械特训营，随后展开对格沃堡的强攻。\n现在我们已肃清所有高层械灵，占领了格沃堡。",
        "\t[？？？,N750]\b[down,6,7]动作有点慢。\n“诱饵”下落如何？",
        "\t[除灵者首领]\b[down,6,2]在我们大多数兵力用于强攻格沃堡的时候，被一个叫“2221”的智械夺走了。\n根据“诱饵”上面的定位装置，它正在往\r[yellow]荒烟村\r的方向逃窜。",
        "\t[？？？,N750]\b[down,6,7]先完成原定计划的最后一步。",
        "\t[除灵者首领]\b[down,6,2]是，大人。这就将实况转播给您。",
        {
            "type": "move",
            "loc": [
                6,
                7
            ],
            "time": 300,
            "keep": true,
            "steps": [
                "left:2",
                "up:3",
                "right:2"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    6,
                    4
                ]
            ]
        },
        "这位第零公民眼前的终端上出现了一个巨大的黑色机甲，其背后是一片黑色的森林，上方是同样漆黑的星空。\n边上有一些高等型号的除灵者正在休整，显然刚刚经历过战斗。",
        "远处是矗立在森林中央的格沃堡。\n一阵亮光出现，数秒后爆炸声响起，格沃堡开始摇晃着下沉，最后在即将消失在树木顶端的时候，一团蘑菇云升起，将其彻底吞没。",
        "\t[？？？,N750]\b[down,6,4]呵呵，好，很好。这么多年了，总算是彻底纠正你当初犯下的错误了，秉凌。\n如今我已经晋升为第零公民了，而你，只有这格沃堡的废墟作为你的纪念碑。可悲，可叹。",
        {
            "type": "sleep",
            "time": 500
        },
        "似乎是想起了一些往事，这位第零公民停顿了几秒。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[？？？,N750]\b[down,6,4]械灵高层已灭，剩下一堆低等械灵和尚未成长起来的智械，群龙无首，再也不成气候。\n对了，还有一件事，务必把“诱饵”追回来。上次的“诱饵”下落不明，可是让\r[red]那位\r非常不满，你们也不想惹他生气吧？",
        "\t[除灵者首领]\b[down,6,2]是，大人，我们这就往荒烟村方向前进。",
        {
            "type": "playSound",
            "name": "取消"
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[？？？,N750]\b[down,6,4]调出特训营区域的监控。",
        "\t[终端]\b[down,6,2]找不到相关信息，特训营建立在裕麓山山体内部，从外部无法观测，唯一的入口戒备森严，常人无法入内。",
        "\t[？？？,N750]\b[down,6,4]我们给比赛主办人员身上都安装了芯片，肯定有什么信息。",
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[终端]\b[down,6,2]我们此次派出的比赛主办人员仅有一人曾进入过特训营，随后来自其体内植入的微型芯片的信号便中断了。",
        "\t[？？？,N750]\b[down,6,4]信号屏蔽。",
        "\t[终端]\b[down,6,2]是的。之后不久特训营被炸毁，信号屏蔽失效，但也未再能够与该芯片建立连接，推测芯片在爆炸发生前就被摧毁了，携带者大概率已死亡。",
        "\t[？？？,N750]\b[down,6,4]其他人那里有什么信息？",
        "\t[终端]\b[down,6,2]在特训营爆炸之后，其余主办人员也陆续遭到袭击，我已接收到他们身上芯片被摧毁前发送的信息，确认袭击者是2221。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[？？？,N750]\b[down,6,4]哼，智械里面也诞生这种高智商个体了，竟然能感知并摧毁这些“眼睛”。\n这么多芯片，可惜了……",
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    6,
                    4
                ]
            ]
        },
        "\t[？？？,N750]\b[down,6,4]荒烟村……呵呵，\r[yellow]那家伙\r正好在那边做实验，配合除灵者形成两面包夹之势，这2221必死无疑。\n此事想必无需我再费心，我要继续修炼了，接下来勿要打扰。",
        "\t[终端]\b[down,6,2]收到。",
        {
            "type": "changeFloor",
            "floorId": "Ch4_50",
            "loc": [
                6,
                12
            ],
            "direction": "up",
            "time": 1000
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [178,178,178,178,178,178,178,178,178,178,178,178,178],
    [178,178,140435,140436,140432,140621,140622,140623,140432,140435,140436,178,178],
    [178,178,140443,140444,140440,140629,140630,140631,140440,140443,140444,178,178],
    [178,178,140451,140452,140456,140637,140638,140639,140456,140451,140452,178,178],
    [178,178,  0,30033,  0,  0,  0,  0,  0,30033,  0,178,178],
    [178,178,30000,30001,  0,140272,140273,140274,  0,30000,30001,178,178],
    [178,178,30002,30003,  0,140280,140281,140282,  0,30014,30015,178,178],
    [178,178,30008,30009,  0,  0,750,  0,  0,30020,30021,178,178],
    [178,178,30018,30019,  0,  0,110320,  0,  0,30018,30019,178,178],
    [178,178,  0,  0,30026,  0,110328,  0,30026,  0,  0,178,178],
    [178,178,30027,  0,30032,  0,  0,  0,30032,  0,30027,178,178],
    [178,178,178,178,178,178,  0,178,178,178,178,178,178],
    [178,178,178,178,178,178,178,178,178,178,178,178,178]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,140264,140265,140266,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}