main.floors.Ch4_41=
{
    "floorId": "Ch4_41",
    "title": "通幽径",
    "name": "通幽径",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "images": [],
    "ratio": 50,
    "defaultGround": "T641",
    "bgm": null,
    "color": [
        0,
        0,
        0,
        0.6
    ],
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "CutterUp.mp3"
        },
        {
            "type": "loadBgm",
            "name": "area17.mp3"
        },
        {
            "type": "moveHero",
            "steps": [
                "down:1"
            ]
        },
        "\t[2 2 2 1,N2221_down]\b[down,null]就是这里，单向传送门给你们开好了，过去可就回不来了。\n真的准备好了？",
        "\t[晴芸,hero3]\b[down,null]我没问题了！想不到格沃堡还有这么神奇的休息室，半小时就能完全补足精力，摩宇城最高级的酒店都比不上呢。\n我现在感觉就像清晨的太阳！",
        "\t[2 2 2 1,N2221_down]\b[down,null]毕竟那是秉凌大人的故居，里面有不少黑科技，自从他走了以后，这是头一次对其他人开放……",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]\b[down,null]我们的任务，是什么来着？",
        "\t[2 2 2 1,N2221_down]\b[down,null]这么简单的任务你还记不住吗？\n过去，打怪，练级。掌握我刚刚给你的\r[yellow]毁灭拳套\r的力量。",
        "\t[hero]\b[down,null]还是有点难以相信，团战要开打了，我却在打野练级。",
        "\t[2 2 2 1,N2221_down]\b[down,null]相信我，这样对你我都好。\n遇到麻烦听晴芸的，她比你聪明多了。",
        {
            "type": "animate",
            "name": "E_sweat",
            "loc": "hero"
        },
        "\t[hero]\b[down,null]那，出发了。",
        {
            "type": "moveHero",
            "steps": [
                "left:1",
                "down:3",
                "right:1",
                "down:1"
            ]
        },
        {
            "type": "animate",
            "name": "yongchang",
            "loc": [
                6,
                9
            ]
        },
        {
            "type": "playSound",
            "name": "mteleport.wav"
        },
        {
            "type": "changeFloor",
            "floorId": "Ch4_41",
            "loc": [
                641,
                0
            ]
        },
        {
            "type": "hide",
            "loc": [
                [
                    6,
                    9
                ]
            ],
            "remove": true
        },
        {
            "type": "sleep",
            "time": 1000
        },
        "\t[2 2 2 1,N2221_down]\b[down,null]9961。",
        {
            "type": "show",
            "loc": [
                [
                    6,
                    5
                ]
            ],
            "time": 1000
        },
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[2, 6, 100],\n\t[10, 6, 100],\n\t[6, 7, 120],\n\t[6, 5, 100]\n]);\n}"
        },
        "\t[9961,N749]\b[down,null]你要我变的，是这个样子吧？",
        {
            "type": "turnBlock",
            "direction": "up",
            "loc": [
                [
                    6,
                    7
                ]
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[2 2 2 1,N2221_down]\b[down,null]一模一样，真不愧是你。\n改变形态的能力比我这易容术强太多了。",
        "\t[9961,N749]\b[down,null]维持这个形态可不太容易，这除灵者首领的块头太大了，我只能模仿个空壳。\n在这种状态下我能发挥的战斗力不到一成。",
        "\t[2 2 2 1,N2221_down]\b[down,null]无妨，我们不演打戏。\n演员道具都就位了，现在该呼叫观众了。",
        {
            "type": "changeFloor",
            "floorId": "Ch4_42",
            "loc": [
                641,
                0
            ],
            "time": 1000
        }
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[2, 6, 100],\n\t[10, 6, 100],\n\t[6, 7, 120]\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "6,5": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [159,159,159,159,159,159,  0,159,159,159,159,159,159],
    [159,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,159],
    [159,  0,  0,  0,159,  0,  0,  0,159,  0,  0,  0,159],
    [159,  0,159,159,159,159,  0,159,159,159,159,  0,159],
    [159,  0,159,  0,159,  0,  0,  0,159,  0,  0,  0,159],
    [159,  0,159,  0,159,  0,749,  0,159,  0,  0,  0,159],
    [159,  0,669,  0,159,  0,  0,  0,159,  0,669,  0,159],
    [159,  0,  0,  0,159,  0,350,  0,159,  0,159,  0,159],
    [159,  0,159,  0,159,  0,  0,  0,159,  0,159,  0,159],
    [159,  0,159,  0,159,159, 89,159,159,  0,159,159,159],
    [159,159,159,159,159,  0,  0,  0,159,  0,  0,  0,159],
    [159,  0,  0,  0,  0,  0,  0,  0,159,  0,  0,  0,159],
    [159,159,159,159,159,159,  0,159,159,159,159,159,159]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,668,  0,  0,  0,  0,  0,  0,  0,668,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

]
}