main.floors.Ch4_131=
{
    "floorId": "Ch4_131",
    "title": "尾声？",
    "name": "尾声？",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "grass",
    "bgm": "sunrise.mp3",
    "color": null,
    "weather": [
        "sun",
        8
    ],
    "firstArrive": [
        {
            "type": "playBgm",
            "name": "sunrise.mp3"
        },
        {
            "type": "setVolume",
            "value": 90,
            "time": 0
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,1": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                {
                    "type": "choices",
                    "text": "\t[2 2 2 1,N2221]你来了。能赢下那样的战斗真是了不起，好好休息一下吧。",
                    "choices": [
                        {
                            "text": "好的。（立即提交成绩）",
                            "action": [
                                "\t[2 2 2 1,N2221]加油，我们还要一同重建我们的家园。",
                                {
                                    "type": "if",
                                    "condition": "flags.hard==1",
                                    "true": [
                                        {
                                            "type": "win",
                                            "reason": "Chap.4.2-摩宇城的曙光"
                                        }
                                    ],
                                    "false": [
                                        {
                                            "type": "win",
                                            "reason": "Chap.4.2-摩宇城的救赎"
                                        }
                                    ]
                                }
                            ]
                        },
                        {
                            "text": "不对。（尝试推进剧情）",
                            "color": [
                                198,
                                184,
                                103,
                                1
                            ],
                            "action": [
                                "\t[hero]真的结束了吗？",
                                "\t[2 2 2 1,N2221]是的，结束了。",
                                "\t[hero]那么，是不是该告诉我，一切的真相了？",
                                {
                                    "type": "setVolume",
                                    "value": 0,
                                    "time": 2000
                                },
                                {
                                    "type": "animate",
                                    "name": "E_dots",
                                    "loc": [
                                        6,
                                        1
                                    ]
                                },
                                "\t[hero]这个世界的确很逼真，但它终归只是一个幻象而已。\n这个巨大幻境的主人，只可能是那个我如今都无法看透的人——\r[yellow]你\r。",
                                "\t[2 2 2 1,N2221]……没错。确实是时候告诉你真相了。",
                                {
                                    "type": "sleep",
                                    "time": 500
                                },
                                "\t[2 2 2 1,N2221]幻境里出现的人物和地点，都是真实存在过的。\n你所经历的这一系列事情，也跟之前\r[yellow]她\r所经历的大同小异。",
                                "\t[hero]她？……",
                                "\t[2 2 2 1,N2221]V。你可以理解为，你扮演了“她”的角色。",
                                "\t[2 2 2 1,N2221]一年前，她决定帮助我之后，先是回到格沃堡跟我做准备，再从荒烟村、拓岩镇一路杀到摩宇城，就像你之前做的那样。",
                                "\t[2 2 2 1,N2221]最终，她面对破封而出的傲狂双帝，迎难而上。\n以生命为代价，才削弱了那两人的力量，将他们重新封印。",
                                "\t[hero]！！以生命为代价？",
                                "\t[2 2 2 1,N2221]没错，她留下的只有一部分记忆残片，就是你之前见到的。\n多亏你的出现，我又看到她出现了新的有趣的反应。谢谢你。",
                                {
                                    "type": "animate",
                                    "name": "E_sweat",
                                    "loc": "hero",
                                    "async": true
                                },
                                "\t[hero]怎么听起来这么奇怪，像是在调戏人家一样……",
                                {
                                    "type": "animate",
                                    "name": "E_dots",
                                    "loc": "hero"
                                },
                                "\t[hero]所以我，本来就是她的仿制品，然后又在你的幻境中做了跟她在历史上做的几乎完全一样的事情……我到底是谁？",
                                "\t[2 2 2 1,N2221]你就是你自己，你不是她。倒不如说，你的性格跟她很不一样，比如你总是傻傻的，而她是个很聪明的人。",
                                "\t[hero]我才不傻！",
                                "\t[2 2 2 1,N2221]是吗？那么你是否意识到，你刚刚完成了一件非常了不起的事情？",
                                "\t[hero]不就是通过了你制作的幻境吗，虽然确实挺逼真的，好几次我都觉得自己差点真的死了。",
                                "\t[2 2 2 1,N2221]你看，你现在还以为自己在幻境里面。\n刚才在千虹广场，你纵身向星空中跳跃时，我将你传送到了真正的千虹之暗。",
                                {
                                    "type": "sleep",
                                    "time": 500
                                },
                                {
                                    "type": "animate",
                                    "name": "E_surprise",
                                    "loc": "hero",
                                    "async": true
                                },
                                "\t[hero]！！……",
                                {
                                    "type": "waitAsync"
                                },
                                {
                                    "type": "pauseBgm"
                                },
                                {
                                    "type": "playBgm",
                                    "name": "sunrise.mp3"
                                },
                                {
                                    "type": "setVolume",
                                    "value": 90,
                                    "time": 0
                                },
                                "\t[2 2 2 1,N2221]没错，你已经回到现实了。",
                                {
                                    "type": "sleep",
                                    "time": 500
                                },
                                "\t[2 2 2 1,N2221]一年前，由于未能彻底消灭傲狂双帝，我们虽然攻下了摩宇城，却无法真正将其占领。\n它们即使在封印之中，也仍然可以散播出傲慢和恶意，持续地污染附近的居民——我们称之为\r[yellow]傲狂诅咒\r。没有人能抵抗这种诅咒，我们能做的唯有远离。",
                                "\t[2 2 2 1,N2221]所以，必须彻底消灭两位大帝，这场战役才算真正结束。但仅凭我一人，不能确保做到这点。\n只有像刚才那样，把你放进去对付他们，同时我在外面稳固封印防止他们逃跑，才是最稳妥的方案。",
                                "\t[hero]同时，万一我失败了，你也可以立即把他们重新关起来。\n真是可靠。不愧是你。",
                                "\t[2 2 2 1,N2221]竟然这么快就想到这一层了。不过，我从一开始就相信你必胜。\n古亦仿照V完成了你的前半段制作，而我亲自完成了后半段。",
                                "\t[hero]……现在听到这个消息已经不怎么感觉意外了。\n我之前一直以为我的创造者半途而废了，原来是你这个大鸽子！",
                                "\t[2 2 2 1,N2221]我这是给你自由成长的空间！如今你彻底消灭了傲狂双帝，前无古人后无来者，这是你的成就，也证明了我策略的成功！",
                                "\t[hero]好吧，难怪我总觉得你对我特别照顾。\n客观来讲你确实给我提供了不少力量，还是应该感谢你一下。",
                                "\t[2 2 2 1,N2221]当然，你能成功主要还是依靠你自己的奋斗。\n虽然你表面上看起来傻，但其实很可靠，而且也很善良……就像她一样。",
                                "\t[hero]她对你来讲，是很重要的人吧？\n……哦对之前在格沃堡收集的那些信息里好像讲过这件事。",
                                {
                                    "type": "moveHero",
                                    "time": 100,
                                    "steps": [
                                        "backward:1"
                                    ]
                                },
                                "\t[hero]怎么回事，突然有一种奇怪的感觉……\n你到底想对我做什么？",
                                {
                                    "type": "animate",
                                    "name": "E_sweat",
                                    "loc": [
                                        6,
                                        1
                                    ],
                                    "async": true
                                },
                                "\t[2 2 2 1,N2221]谔，别紧张，我只是想让你在这里多休息休息……",
                                "\t[hero]我是智械，纯粹的机器人，不需要休息。\n你这种保留部分生物特征的械灵才需要。",
                                "\t[2 2 2 1,N2221]那你还有什么问题想问我吗？",
                                {
                                    "type": "animate",
                                    "name": "E_dots",
                                    "loc": "hero"
                                },
                                "\t[hero]有。\n晴芸，她，在历史上，真的存在？",
                                "\t[2 2 2 1,N2221]原本是望梅界二代大魔王最有力的候选者，后来因故被迫离开摩宇城。\n她总说对这个世界绝望了，但其实从未放弃改变世界的希望。\n甚至说不定就连她偶尔表达出负面情绪，也是因傲狂诅咒的影响而为。",
                                "\t[hero]……",
                                "\t[hero]那，芳芷跟2221呢？我说的2221是那个智械。",
                                "\t[2 2 2 1,N2221]你之前在塔里见过芳芷了。她在傲狂双帝诞生之后在摩宇城居住过一段时间，为了彻底清除诅咒造成的污染才不得不改造成那样。\n实际上塔里都是受到过污染的人，整片空间都是隔离区，等确认污染消失之后就可以把他们放出来。",
                                "\t[hero]难怪我印象中塔里有些人脑子不太好使。希望他们早日康复。",
                                "\t[2 2 2 1,N2221]至于那个智械2221……似乎对我意见很大，我说什么它都不信。",
                                "\t[hero]毕竟它的形象被你借用了，然后你又做了这么大的一件事。\n以后提起2221，大家首先想到的是你而不是它，你已经活成了真正的2221，对吧？",
                                "\t[2 2 2 1,N2221]正是，所以原来的2221只能“转生”了。\n我正打算给它换个好看的皮，名字也可以一并改了，不过这件事情之后再说吧。\n现在还有一件正事。",
                                "\t[2 2 2 1,N2221]当时我虽然打败了福博，但没能消灭他，被他跑了。\n虽然在正面对拼中我胜他一筹，但他的存在始终是巨大的威胁。",
                                "\t[hero]我们要去把他干掉，是吧？",
                                "\t[2 2 2 1,N2221]不错，但还不是现在。\n坑外世界的危险超乎想象，在那之前，我还需要再多加研究已有的至尊碎片。",
                                "\t[2 2 2 1,N2221]至于你，先摸了吧。",
                                "\t[hero]好。",
                                {
                                    "type": "setCurtain",
                                    "color": [
                                        0,
                                        0,
                                        0,
                                        1
                                    ],
                                    "time": 0
                                },
                                {
                                    "type": "hideStatusBar"
                                },
                                {
                                    "type": "choices",
                                    "text": "\t[系统提示]后面还没做。\n咕了。",
                                    "choices": [
                                        {
                                            "text": "听听作者的废话",
                                            "color": [
                                                255,
                                                215,
                                                0,
                                                1
                                            ],
                                            "action": [
                                                "\t[如沐东风,greenMan]你好，这里是本塔的作者。\n感谢你选择观看我留下的这段话，不论是出于好奇心还是什么心态。",
                                                "\t[如沐东风,greenMan]第四章后篇其实只有三个大区——荒烟村、拓岩镇、摩宇城。\n但是这次更新对我来说却是前所未有的艰难，所以这次发布的时间也与上次相隔接近一年，而非以前的半年。从更新频率上讲，本作总算有了点大型蓝海的影子。",
                                                "\t[如沐东风,greenMan]从游戏内容上讲，这次又尝试整了点新活。玩过《守望先锋》的玩家肯定早就看出来，本章主角的技能和部分音效源自于“末日铁拳”。我一直觉得这是守望先锋设计最成功的英雄之一，将格斗游戏连招的感觉引入了FPS，他的技能都兼具伤害与机动性，这使得这些技能的用法较为多变。\n当然，这种创新机制带来的后果是难以平衡。强度稍高就在鱼塘大杀四方，强度稍低就在高端局彻底绝迹，最终迎来了重做。",
                                                "\t[如沐东风,greenMan]回到本塔，本次更新用到了样板新支持的“修改定点怪物的属性”，学会如何平衡它的作用，以及“临时护盾”机制，也费了我不少功夫。\n制作过程中测试员纷纷反映我整的活太烂，玩起来究极折磨；但是我也实在整不出更好的活了，只好硬着头皮整完，然后简化难度让玩家乱杀。如果机制设计是失败的，多少能靠极低的难度来掩盖一点点。",
                                                "\t[如沐东风,greenMan]另外是剧情方面，比起游戏性方面我更加的不擅长，所以我刻意地没有把一些东西讲得很清楚。\n如果大家没有理解那也没关系，忽略就是。",
                                                "\t[如沐东风,greenMan]关于下一章的计划，其实原本是没有下一章的，本来想做个水区收尾完结的。\n但是做水区也想放开手脚整点活，各种脚本肯定少不了，如果费了很大功夫设计好了一整套机制，但是才做了十几层，那也太亏了。\n总之就是先咕了，如果有下一章的话，大概会是纯无脑乱杀个小几十层吧。",
                                                "\t[如沐东风,greenMan]由于某些原因，作者的心彻底死了，不再对热度或者评分抱有任何期待。\n希望你享受了游玩本塔的过程。\n感谢你看到这里。"
                                            ]
                                        },
                                        {
                                            "text": "？？？",
                                            "action": []
                                        }
                                    ]
                                },
                                "\t[系统提示]如果本塔有下个版本，你到这里的时候就会清状态进入下一章。",
                                {
                                    "type": "restart"
                                },
                                {
                                    "type": "if",
                                    "condition": "false",
                                    "true": [
                                        {
                                            "type": "move",
                                            "loc": [
                                                6,
                                                1
                                            ],
                                            "time": 100,
                                            "steps": [
                                                "down:2"
                                            ]
                                        },
                                        {
                                            "type": "follow",
                                            "name": "2221.png"
                                        },
                                        {
                                            "type": "playSound",
                                            "name": "mteleport.wav"
                                        }
                                    ]
                                }
                            ]
                        }
                    ]
                }
            ]
        },
        "6,10": [
            {
                "type": "function",
                "function": "function(){\ncore.hideBgFgMap(\"bg2\", [6, 10]);\ncore.updateWeather();\n}"
            },
            "\t[2 2 2 1,N2221]第零公民，败了！\n摩宇城，自由了！",
            {
                "type": "playSound",
                "name": "059-Applause01.ogg"
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[2 2 2 1,N2221]值此黎明到来之刻，我想要感谢所有反抗第零公民压迫的个体。\n这是一场漫长而艰难的斗争，每一个人的努力都至关重要，不管是能站在这里的，还是那些不幸献身的。",
            "\t[hero]（漫长？从我进入这个幻境起到现在，应该才过去一天才对……\n虽然，确实感觉像是过了很久一样。）",
            "\t[2 2 2 1,N2221]但现在还不是松懈的时候。这个世界已经遭受了太多的摧残，要在这里建立新的秩序，我们还有很长的路要走。",
            "\t[2 2 2 1,N2221]不论前面是何等的艰难困苦，我们都会将其克服！\n属于我们的时代，开始了！",
            {
                "type": "playSound",
                "name": "059-Applause01.ogg"
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[hero]也好，旧的结束，也是新的开始。\n对于《至尊之录》这个幻境而言，应该是彻底的结束了吧。",
            {
                "type": "hide",
                "remove": true
            }
        ],
        "10,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[械灵-Angel,E862]\b[down,null]真是了不起的战斗！你拯救了我们的世界！"
            ]
        },
        "3,6": [
            "\t[2274,N614]\b[down,null]哇，你太NB了，我以后一定要跟你学厨艺！"
        ],
        "3,7": [
            "\t[1185,N610]\b[down,null]大佬！我能做你的朋友吗？"
        ],
        "3,8": [
            "\t[1857,N618]\b[down,null]神仙！请受我一拜！"
        ],
        "8,9": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[R型械灵,E855]@@@!@@@!@@@!",
                {
                    "type": "animate",
                    "name": "E_unhappy",
                    "loc": "hero",
                    "async": true
                },
                "\t[hero]完全听不懂……"
            ]
        },
        "9,8": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": [
                "\t[S型械灵,E856]（（@@（（@@（（@@",
                {
                    "type": "animate",
                    "name": "E_embarrass",
                    "loc": "hero",
                    "async": true
                },
                "\t[hero]我好像听懂了一点……"
            ]
        }
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [161670,161671, 20, 20, 20, 20, 20, 20, 20, 20, 20,161670,161671],
    [161678,161679,  0, 20, 20,  0,844,  0, 20, 20,  0,161678,161679],
    [161686,161687,161675,161675,  0,  0,  0,  0,  0,161675,161675,161686,161687],
    [151043,  0,161683,161683,  0,  0,  0,  0,  0,161683,161683,  0,  0],
    [  0,161685,161684,  0,  0,  0,  0,  0,  0,  0,161684,161685,  0],
    [  0,161658,161658,161658,  0,  0,  0,  0,  0,  0,161668,161669,151044],
    [ 20,  0,  0,616,  0,  0,  0,  0,  0,161217,862,  0, 20],
    [ 20,  0,  0,612,  0,  0,  0,  0,  0,  0,  0,161217, 20],
    [ 20,  0,  0,620,  0,  0,  0,  0,  0,856,  0,  0, 20],
    [161706,161707,161708,  0,  0,  0,  0,  0,855,  0,161709,161710,161711],
    [161714,161715,161716,  0,161224,161649,  0,161224,161649,  0,161717,161718,161719],
    [ 20, 20,  0,161229,  0,161226,  0,161227,  0,161229,  0, 20, 20],
    [ 20, 20, 20, 20, 20, 20,  0, 20, 20, 20, 20, 20, 20]
],
    "hard1_enemy_ratio": 95,
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [151035,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,161677,161676,  0,  0,  0,  0,  0,  0,  0,161676,161677,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,161660,161661,151036],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [161690,161691,161692,  0,  0,  0,  0,  0,  0,  0,161693,161694,161695],
    [161698,161699,161700,  0,  0,  0,  0,  0,  0,  0,161701,161702,161703],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,161221,  0,161218,  0,161219,  0,161221,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,168,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

]
}