main.floors.Ch4_5H=
{
    "floorId": "Ch4_5H",
    "title": "？？？",
    "name": "？？？",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "images": [],
    "ratio": 50,
    "defaultGround": "sand",
    "color": [
        0,
        0,
        0,
        0.6
    ],
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[6, 4, 100]\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "6,4": [
            {
                "type": "playBgm",
                "name": "story2.mp3"
            },
            {
                "type": "turnBlock",
                "direction": "down",
                "loc": [
                    [
                        6,
                        4
                    ]
                ]
            },
            "\t[晴芸,hero3]\b[down,6,4]咕姐姐。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[hero]\b[down,hero]其实，我的年龄应该比你小得多……经历过的事情也少很多。",
            "\t[晴芸,hero3]\b[down,6,4]但是每次遇到危险都是你挡在前面呀。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[hero]\b[down,hero]那个，我……\n（不知道说什么好，这种时候应该怎么安慰别人？）",
            "\t[晴芸,hero3]\b[down,6,4]我在想，人生的意义。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            {
                "type": "jumpHero",
                "loc": [
                    5,
                    4
                ],
                "time": 300
            },
            {
                "type": "changePos",
                "direction": "down"
            },
            "\t[晴芸,hero3]\b[down,6,4]我时常会梦到小时候的场景，就在这次行动之前，在那短暂的半个小时的睡梦中，我又一次见到了……\n天是蓝的，草是绿的，灿烂的阳光照耀着摩宇城的每一个角落，人们满怀期望地忙碌着，他们不仅享受当下，还坚信未来会更加光明。",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[晴芸,hero3]\b[down,6,4]后来不知什么时候起，我感觉……人心变了。",
            "\t[晴芸,hero3]\b[down,6,4]有的人开始表现出极端的利己主义，真正的实事一件不做，整天研究如何用最少的努力获得最多的认同、最高的地位。",
            "\t[晴芸,hero3]\b[down,6,4]还有的人干脆躺平摆烂，沉浸在虚拟世界里修仙，能乐一天算一天，钱快花完的时候给自己安排个安乐。",
            "\t[晴芸,hero3]\b[down,6,4]当然，也许有一小部分人还是很努力、积极向上，但他们就像这荒漠中的一汪清潭，终究会被无边的沙尘掩埋。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[hero]\b[down,5,4]你认为这种变化的根源在哪？",
            "\t[晴芸,hero3]\b[down,6,4]有很多种理论，我最认同的一种说法是——\n\r[yellow]科技发展陷入了停滞。\r\n当大家都没有能力把蛋糕做大的时候，就只好把心思全部投入在抢蛋糕上。",
            "\t[hero]\b[down,5,4]可是，为什么发展会陷入停滞……",
            "\t[晴芸,hero3]\b[down,6,4]也许这就是规律。科技的发展不会永远保持指数级速度，总会遇到些困难。\n根据历史经验，这种抢蛋糕的内斗同样不会永远保持下去，在大多数人钻研驭人之术时，也有一小部分人在缓慢地攻克那道科技壁垒。等到他们引领新一轮的技术革命时，蛋糕的大小再度开始迅速膨胀，社会发展进入新一轮的周期。",
            "\t[晴芸,hero3]\b[down,6,4]听起来不差，对吧？\n以前的管理者眼光足够长远，他们不介意付出一点余力投资到这些人身上。一旦被他们投资的人取得突破性的进展，他们也会成为最大的受益者之一。\n但现在不是了。",
            "\t[晴芸,hero3]\b[down,6,4]这届的管理者，以摩宇城城主狱贤为代表的那些第零公民，就是一帮目光短浅的奴隶主。\n他们的私有财产，那些只知道服从指令的打工机器人，就是他们最忠实、最可靠的奴隶。",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[晴芸,hero3]\b[down,6,4]至今为止，还有许多工作是无法让机器人代替人类的。\n但是可怕的事情已经开始发生了，劳动者即使做到最顶尖，地位也完全无法与这些奴隶主相比，而那些尝试攻克科技壁垒的人，更是被这些奴隶主视为骗子。",
            "\t[晴芸,hero3]\b[down,6,4]以前的资本家，尚且需要防止工人罢工。\n现在，奴隶主可以随意地羞辱劳动者：\n“你大可以试试看你罢工以后，这世界还转不转。”",
            "\t[晴芸,hero3]\b[down,6,4]一个普通人所拥有的天赋、所付出的努力，在地位的碾压面前毫无价值。",
            "\t[hero]\b[down,5,4]社会这样发展下去，就只剩下奴隶主和他的奴隶们了。",
            "\t[晴芸,hero3]\b[down,6,4]对我们来讲很可怕吧？但这正是那些奴隶主想要的。\n早在\r[red]那件事\r发生之前，我就已经感觉不对劲了。即使现在我的家人还住在摩宇城，我也不会喜欢那里。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[hero]\b[down,5,4]……我现在，真的理解你为什么对人类社会失望了。\n我们该怎么办？",
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        2
                    ]
                ],
                "time": 500
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.setBgLight([\n\t[6, 4, 100],\n\t[6, 2, 120]\n]);\n}"
            },
            "\t[2 2 2 1,N2221]\b[down,6,2]问题的根源出在顶层。\n干死那些第零公民，由我来建立新的秩序，一切问题都会解决。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": [
                    6,
                    4
                ]
            },
            {
                "type": "changePos",
                "direction": "up"
            },
            "\t[hero]\b[down,5,4]虽然还不知道你是否靠谱，但似乎也只能如此了。",
            "\t[2 2 2 1,N2221]\b[down,6,2]很幸运，我们的目标相同。\n不论是为了打破腐朽的旧秩序，还是因我们所受的压迫而反抗，我们都必须杀入摩宇城，根除那里的邪恶力量。",
            {
                "type": "turnBlock",
                "direction": "up",
                "loc": [
                    [
                        6,
                        4
                    ]
                ]
            },
            "\t[晴芸,hero3]\b[down,6,4]我当然愿意。但我可不想再拉着咕姐卷入危险了，这件事本来跟她无关的。\n刚才你出现的若是再慢一点，她真的要被那大狗舔碎了。",
            "\t[hero]\b[down,5,4]不用担心我，我也愿意。",
            {
                "type": "turnBlock",
                "direction": "left",
                "loc": [
                    [
                        6,
                        4
                    ]
                ]
            },
            "\t[晴芸,hero3]\b[down,6,4]这真的是自己的想法？",
            "\t[hero]\b[down,5,4]是我自己的想法。\n刚才在荒烟村发生的一切，以及对你刚才那番话的思考，让我相信我们做的事情是正确的。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": [
                    6,
                    4
                ]
            },
            {
                "type": "turnBlock",
                "direction": "up",
                "loc": [
                    [
                        6,
                        4
                    ]
                ]
            },
            "\t[2 2 2 1,N2221]\b[down,6,2]很好，那么现在就出发吧，我已经给你们安排好下一个任务了……",
            {
                "type": "setCurtain",
                "color": [
                    0,
                    0,
                    0,
                    1
                ],
                "time": 500,
                "keep": true
            },
            "在2221的带领之下，9922和晴芸很快坐进一辆卡车的货箱。\n晴芸不知在思考什么，9922也没有主动搭话，只是暗自揣摩着2221交代的任务。",
            "\t[hero]\r[yellow]拓岩镇\r的最高管理者是一位名为\r[yellow]秩见\r的第零公民，我的任务就是找到他，然后给他这封信。\n但是我们不知道他的具体位置，而且送信这种事情为什么一定要我们来做……",
            {
                "type": "if",
                "condition": "flags.hard==2",
                "true": [
                    {
                        "type": "setValue",
                        "name": "status:hp",
                        "operator": "*=",
                        "value": "1.5",
                        "norefresh": true
                    },
                    {
                        "type": "setValue",
                        "name": "status:hp",
                        "operator": "+=",
                        "value": "50000000",
                        "norefresh": true
                    },
                    {
                        "type": "setValue",
                        "name": "status:mana",
                        "operator": "+=",
                        "value": "1000"
                    },
                    {
                        "type": "setValue",
                        "name": "item:yellowKey",
                        "operator": "+=",
                        "value": "3"
                    },
                    {
                        "type": "setValue",
                        "name": "item:blueKey",
                        "operator": "+=",
                        "value": "1"
                    },
                    "经过休息，\r[orange]生命*1.5（普通难度福利）\r，然后再回复5000w生命和1000能量。\n获得3把黄钥匙和1把蓝钥匙。"
                ],
                "false": [
                    {
                        "type": "setValue",
                        "name": "status:hp",
                        "operator": "+=",
                        "value": "50000000",
                        "norefresh": true
                    },
                    {
                        "type": "setValue",
                        "name": "status:mana",
                        "operator": "+=",
                        "value": "1000"
                    },
                    {
                        "type": "setValue",
                        "name": "item:yellowKey",
                        "operator": "+=",
                        "value": "3"
                    },
                    {
                        "type": "setValue",
                        "name": "item:blueKey",
                        "operator": "+=",
                        "value": "1"
                    },
                    "经过休息，回复5000w生命和1000能量。\n获得3把黄钥匙和1把蓝钥匙。"
                ]
            },
            {
                "type": "changeFloor",
                "floorId": "Ch4_60",
                "loc": [
                    0,
                    641
                ],
                "direction": "down",
                "time": 2000
            }
        ],
        "6,2": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,0": {
            "floorId": "Ch4_5G",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [176,176,176,176,176,130036,  0,130035,176,176,176,176,176],
    [176,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,176],
    [176,  0,  0,  0,  0,  0,844,  0,  0,  0,  0,  0,176],
    [176,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,176],
    [176,  0,  0,130032,  0,  0,374,  0,  0,130032,  0,  0,176],
    [176,  0,130026,  0, 17, 17, 17, 17, 17,  0,130026,  0,176],
    [  0,130034,  0,  0, 17, 17, 17, 17, 17,  0,  0,130034,  0],
    [  0,  0,  0,  0, 17, 17, 17, 17, 17,  0,  0,  0,  0],
    [130025,  0,130017,  0, 17, 17, 17, 17, 17,  0,130017,  0,130025],
    [130033,  0,  0,  0, 17, 17, 17, 17, 17,  0,  0,  0,130033],
    [  0,  0,130027,  0,  0,  0,  0,  0,  0,  0,130028,  0,  0],
    [176,  0,130035,  0,  0,  0,130016,  0,  0,  0,130036,  0,176],
    [176,176,  0,  0,130034,  0,  0,  0,130026,  0,  0,176,176]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,150,150,150,150,150,150,150,  0,  0,  0],
    [  0,  0,  0,150,154,154,154,154,154,150,  0,  0,  0],
    [  0,  0,  0,150,154,155,155,155,154,150,  0,  0,  0],
    [  0,  0,  0,150,154,155,156,155,154,150,  0,  0,  0],
    [  0,  0,  0,150,154,155,155,155,154,150,  0,  0,  0],
    [  0,  0,  0,150,154,154,154,154,154,150,  0,  0,  0],
    [  0,  0,  0,150,150,150,150,150,150,150,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0, 91,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "hard1_enemy_ratio": 95
}