main.floors.Ch4_13=
{
    "floorId": "Ch4_13",
    "title": "遗落之蔽-3",
    "name": "遗落之蔽-3",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T670",
    "bgm": "area14.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "9,10": [
            {
                "type": "animate",
                "name": "E_surprise",
                "loc": [
                    11,
                    10
                ]
            },
            {
                "type": "changePos",
                "direction": "right"
            },
            "\t[青铜斗士,E680]\b[up,11,10]哇，总算得救了！",
            "\t[青铜斗士,E680]\b[up,11,10]如您所见，我们之前被这个突然出现的K型械灵堵在了这里。\n这家伙本身硬实力不强，但技能实在太阴间了，我们联手都完全无法与之抗衡。",
            "\t[hero]（确实，不过对我来讲，麻烦的主要还是背后这个散发着恶臭气味的目力莱姆……）",
            "\t[青铜斗士,E680]\b[up,11,10]非常感谢二位，那边机关门里面的宝藏就作为谢礼了，还望二位不要嫌弃。",
            {
                "type": "openDoor",
                "loc": [
                    3,
                    6
                ]
            },
            "\t[青铜斗士,E680]\b[up,11,10]再见，我们溜了。",
            {
                "type": "hide",
                "loc": [
                    [
                        10,
                        11
                    ],
                    [
                        11,
                        10
                    ],
                    [
                        11,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "animate",
                "name": "zone",
                "loc": [
                    10,
                    11
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "zone",
                "loc": [
                    11,
                    10
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "zone",
                "loc": [
                    11,
                    11
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        9,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        11
                    ]
                ],
                "remove": true
            }
        ],
        "8,11": [
            {
                "type": "animate",
                "name": "E_surprise",
                "loc": [
                    11,
                    10
                ]
            },
            "\t[青铜斗士,E680]\b[up,11,10]哇，总算得救了！",
            "\t[青铜斗士,E680]\b[up,11,10]如您所见，我们之前被这个突然出现的K型械灵堵在了这里。\n这家伙本身硬实力不强，但技能实在太阴间了，我们联手都完全无法与之抗衡。",
            "\t[hero]（确实，不过对我来讲，麻烦的主要还是背后这个散发着恶臭气味的目力莱姆……）",
            "\t[晴芸,hero3]（而且开这两个蓝门，感觉好亏吖~）",
            "\t[青铜斗士,E680]\b[up,11,10]非常感谢二位，那边机关门里面的宝藏就作为谢礼了，还望二位不要嫌弃。",
            {
                "type": "openDoor",
                "loc": [
                    3,
                    6
                ]
            },
            "\t[hero]你们就这样直接走过来没问题吗？",
            "\t[青铜斗士,E680]\b[up,11,10]你说经过这个K型械灵身边吗？没事的，因为我们的生命值已经都被它封印了……",
            {
                "type": "animate",
                "name": "E_sweat",
                "loc": "hero"
            },
            "\t[青铜斗士,E680]\b[up,11,10]再见，我们溜了。",
            {
                "type": "hide",
                "loc": [
                    [
                        10,
                        11
                    ],
                    [
                        11,
                        10
                    ],
                    [
                        11,
                        11
                    ]
                ],
                "remove": true
            },
            {
                "type": "animate",
                "name": "zone",
                "loc": [
                    10,
                    11
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "zone",
                "loc": [
                    11,
                    10
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "zone",
                "loc": [
                    11,
                    11
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        9,
                        10
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        8,
                        11
                    ]
                ],
                "remove": true
            }
        ],
        "11,5": [
            {
                "type": "if",
                "condition": "core.getBlockId(3,6) == \"specialDoor\"",
                "true": [
                    "本层左侧的机关门在解救右下的NPC后打开。",
                    {
                        "type": "if",
                        "condition": "flag:hard == 1",
                        "true": [
                            "记得使用“轻点”的技巧。站在道具旁边，双击角色或者按空格键，即可捡起道具。\n这个技巧非常重要！"
                        ]
                    }
                ],
                "false": [
                    "你已经打开本层的机关门。"
                ]
            }
        ]
    },
    "changeFloor": {
        "12,6": {
            "floorId": "Ch4_12",
            "loc": [
                0,
                6
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,327,  0,110280,330,  0, 21,110280, 22,110280,331,  0, 17],
    [ 17,330,672, 81,  0, 22,  0,110280,328,110280,110280,329, 17],
    [ 17, 21,  0,110280,110280,110280,673,110280,672, 81,  0,678, 17],
    [ 17,110280,110280,110280,110280,  0,330,110280,110280,110280, 82,110280, 17],
    [ 17,327,330,110280,  0,650, 81,  0,110280,  0,  0,129, 17],
    [ 17,654, 23, 85,331,  0,  0,  0,678,  0,330,  0,  0],
    [ 17,328,330,110280,  0,650,110280,110280,110280, 81,  0, 21, 17],
    [ 17,110280,110280,110280,330,  0,  0,673,  0,  0,332,  0, 17],
    [ 17,334,330,110280,110280, 81,110280,110280,110280,679,110304,110305, 17],
    [ 17,328,  0,110280,  0,673,  0,110280,  0,  0,  0,690, 17],
    [ 17,  0,678, 81,331,  0, 21, 82,  0,671,690,690, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,172],
    [  0,172,172,172,172,172,172,172,172,172,172,172,110417],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,172,172,172,172,172,172,172,172,172,172,172,  0],
    [  0,110417,110417,110417,110417,110417,110417,110417,110417,110417,110417,110417,  0]
],
    "fgmap": [

],
    "bg2map": [
    [173,173,173,173,173,173,173,173,173,173,173,173,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 94],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,173],
    [173,173,173,173,173,173,173,173,173,173,173,173,173]
],
    "fg2map": [

],
    "flyPoint": [
        12,
        6
    ],
    "hard1_enemy_ratio": 95,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}