main.floors.Ch4_88=
{
    "floorId": "Ch4_88",
    "title": "览伟桥-2",
    "name": "览伟桥-2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "area19.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 50,
    "defaultGround": "T817",
    "bgm": "area19.mp3",
    "color": null,
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[孤鸣,E909]\b[down,6,4]你们总算来了，两个脆弱不堪的经验包！\n你们将面对的是我，孤鸣，有史以来最努力、实力最强的二等公民！",
        "\t[孤鸣,E909]\b[down,6,4]你们之前肯定没听过我的大名，这很正常，毕竟我之前一直闭关修炼，用赚来的经验值从铁焚大人那里换来了无数次的强化！这次只要将你们击败，立下大功，我一定能更进一步，晋升为真正的一等公民！",
        "\t[孤鸣,E909]\b[down,6,4]你们肯定在想战胜我的几率是多少，我告诉你们，是零！\n没有人比我更努力，没有人能卷赢我！我曾消灭过恒河沙数的竞争者，如今我的实力早已恐怖如斯，你们也必定会被我\r[yellow]踩！在！脚！下！\r",
        "\t[hero]\b[down,null]这家伙脑子不太好使的样子，嘴上说着狠话，脚下一步都不挪。",
        "\t[晴芸,hero3]\b[down,null]也许是他的直觉使他明白，他不能脱离身边小兵的支援。",
        "\t[hero]\b[down,null]被动等死而已，等我准备好了再去收拾他。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,11": [
            "（以下内容复制自第四章前篇四区的某个木牌）\n关于游猎：\n可见范围可被门或者墙阻挡，不会被物品或其他敌人阻挡。\n\n移动方向的优先级由 core.utils.scan 决定，依次是\r[yellow]上左下右\r。\n例如，当你位于游猎怪的右下角时，怪物往下走或往右走都可以射你，那么根据上述优先级，它会往下走。"
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "Ch4_87",
            "loc": [
                6,
                0
            ]
        },
        "6,0": {
            "floorId": "Ch4_89",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "6,4": [
            {
                "type": "if",
                "condition": "flag:last_battle_enemyId != \"E909\"",
                "true": [
                    {
                        "type": "exit"
                    }
                ]
            },
            {
                "type": "if",
                "condition": "core.status.hero.loc.y < 4",
                "true": [
                    {
                        "type": "setBlock",
                        "number": "E910",
                        "loc": [
                            [
                                6,
                                4
                            ]
                        ]
                    }
                ],
                "false": [
                    {
                        "type": "setBlock",
                        "number": "E909",
                        "loc": [
                            [
                                6,
                                4
                            ]
                        ]
                    }
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    2,
                    3
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    4,
                    3
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    8,
                    3
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    10,
                    3
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    6,
                    2
                ]
            },
            "\t[孤鸣,E909]\b[down,6,4]你……你竟然这么强……这该死的命运，为何如此不公！",
            "\t[孤鸣,E909]\b[down,6,4]我奋斗不息，付出数倍于常人的努力，每天闭关修炼16小时、全年无休，卷死无数竞争者，才成为有史以来最强的二等公民！最后竟败于一个外表脆弱不堪的智障机器人！",
            "\t[孤鸣,E909]\b[down,6,4]杀了我吧！这狗屁不通的世界，没有待下去的必要了！",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[hero]\b[down,hero]好像，有道理哦……",
            "\t[晴芸,hero3]\b[down,hero]如果只要埋头修炼就能一直得到回报，这世界才真的没有道理。",
            "\t[孤鸣,E909]\b[down,6,4]滚，我不需要一个养尊处优的大小姐给我灌鸡汤！你这种赢在起跑线的一等公民，有什么资格对努力家指指点点？我根本不屑于用正眼看你！",
            "\t[晴芸,hero3]\b[down,hero]直视我，胆小鬼。",
            "\t[孤鸣,E909]\b[down,6,4]你！你说谁胆子小！",
            "\t[晴芸,hero3]\b[down,hero]我早就不是这里的公民了。何况，一等公民也好，二等公民也好，都是第零公民的狗，没有本质区别。\n你不会真以为狗通过努力就能变成人了吧？",
            "\t[孤鸣,E909]\b[down,6,4]那是当然，我通过努力赢得了那么多奖励，才让我有如今二等公民顶端的地位和力量。只要这种状况持续下去……",
            "\t[晴芸,hero3]\b[down,hero]但是不可能一直持续的。\n他们将荣誉授予你，只是为了给其他人树立一个奋斗的“榜样”，让他们产生奋斗就能改变命运的错觉。",
            "\t[晴芸,hero3]\b[down,hero]但是你跟他们不是一类人，你根本不了解他们，也不可能融入他们。\n你即使击败我们立下大功，被管理者晋升为真正的一等公民，你也永远不可能真正被他们接纳。",
            "\t[孤鸣,E909]\b[down,6,4]哼，那又如何，我做的努力、获得的回报都是实实在在的，属于自己的！\n如果他们敢这样对我，这样蔑视我的努力，我直接“\r[yellow]王侯将相，宁有种乎\r”！",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": [
                    6,
                    4
                ]
            },
            "\t[孤鸣,E909]\b[down,6,4]等等，你们是……这，原来是这样吗……\n原来你们在第五层……",
            {
                "type": "animate",
                "name": "dark",
                "loc": [
                    6,
                    4
                ]
            },
            "\t[孤鸣,E909]\b[down,6,4]\r[red]不对！我落得如今境地都是你们害的！只要杀了你们，我就能得到我想要的一……\r",
            "\t[hero]\b[down,hero]危险！",
            {
                "type": "animate",
                "name": "crossattack",
                "loc": [
                    6,
                    4
                ]
            },
            "\t[孤鸣,E909]\b[down,6,4]……谔谔，啊啊啊啊！",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "animate",
                "name": "explosion",
                "loc": [
                    6,
                    4
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[hero]\b[down,hero]你没事吧？",
            "\t[晴芸,hero3]\b[down,hero]我没事，但是，怎么会这样……",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[晴芸,hero3]\b[down,hero]本来他已经放弃抵抗了。\n但刚才有一种外部力量，使得他突然再次敌视我们了。",
            "\t[hero]\b[down,hero]拓岩镇的那些人也是，无理由地敌视我们。\n也许尝试与他们交流就是错误的，这场两方争斗的结果必然是其中一方的灭亡。",
            "\t[晴芸,hero3]\b[down,hero]……\n不对，我还是很在意，那种外部力量的来源。\n如果说，所有的对立和仇恨，原本是不存在的，都是因此而生……"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [ 17, 17, 17, 17, 17,197,  0,197, 17, 17, 17, 17, 17],
    [197,661,197,197,566,197,333,197,566,197,197,661,197],
    [197,333,815,197,332,197, 85,197,332,197,819,333,197],
    [197,197, 85,  0, 85,811,662,811, 85,  0, 85,197,197],
    [568,197,661,197,820,197,909,197,820,197,661, 81,334],
    [332,197,809,197,566,197,567,197,566,197, 21,160810,160811],
    [ 82,197, 81,197, 83,197, 82,197, 83,197,813,160818,160819],
    [  0, 21,  0,660,816,197,  0,810,334,820,  0, 81,333],
    [197, 83,197,197, 82,197, 81,197,197, 81,197,197,566],
    [333,665,834, 81,332,  0,566,  0, 82,334,197,568, 83],
    [662, 22,660,197,  0,333,  0, 21,197, 82,808,197,666],
    [824,664,566,197, 22,  0,334,129,197,197, 22,808,665],
    [ 17, 17, 17, 17, 17,197,  0,197, 17, 17, 17, 17, 17]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,318,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,318,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0, 91,  0,  0,  0,  0,  0,  0],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [  0,  0,  0,  0,  0,  0, 93,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "upFloor": [
        6,
        0
    ],
    "downFloor": [
        6,
        12
    ],
    "hard1_enemy_ratio": 95
}