main.floors.Ch4_65=
{
    "floorId": "Ch4_65",
    "title": "拓岩镇-5",
    "name": "拓岩镇-5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T770",
    "bgm": "area18.mp3",
    "color": [
        0,
        0,
        0,
        0.4
    ],
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[五等公民,N691]\b[down,4,7]该死的虎魔帮，大丈夫不与竖子为伍！",
        "\t[虎魔甲士,E771]\b[down,5,6]我不明白，为何不加入我们？你恐怕不知道我加入虎魔帮之前，是何等卑微的六等公民，如今你看看洛渔神赐我的神力，你就不想变得跟我一样强壮吗？",
        "\t[五等公民,N691]\b[down,4,7]你的力量的确很强，但你脑子不好使。\n人应该是有独立思考能力的生物，像你这种无情的膜拜机器，这辈子真的是白活了。",
        "\t[虎魔甲士,E771]\b[down,5,6]不，不是这样的！虽然我脑子不好使，但我换来了力量，这难道不值得吗？",
        "\t[五等公民,N691]\b[down,4,7]呸！变成你这种大脑发育不完全小脑完全不发育的样子，还不如死了算了！",
        "\t[虎魔甲士,E771]\b[down,5,6]你说的不对，人死了就什么都没有了，好死不如赖活着，我觉得很值得！",
        {
            "type": "playSound",
            "name": "053-Cannon02.ogg"
        },
        {
            "type": "vibrate",
            "direction": "horizontal",
            "time": 200,
            "speed": 10,
            "power": 10,
            "async": true
        },
        "\t[虎魔死士,E773]\b[up,5,8]够了！你跟他争什么值得不值得的？根本没什么可争的，我就一句话：\n在这拓岩镇，膜洛渔者活，不膜者死，我就问你，膜还是不膜？",
        {
            "type": "waitAsync"
        },
        {
            "type": "animate",
            "name": "E_dots",
            "loc": [
                4,
                7
            ]
        },
        "\t[五等公民,N691]\b[down,4,7]一言定争，鉴定为纯纯的脑瘫。",
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    7
                ]
            ],
            "remove": true
        },
        {
            "type": "setBlock",
            "number": "X140658",
            "loc": [
                [
                    4,
                    7
                ]
            ]
        },
        {
            "type": "animate",
            "name": "jianji2",
            "loc": [
                4,
                7
            ]
        },
        "\t[虎魔甲士,E771]\b[down,5,6]大哥！",
        "\t[虎魔死士,E773]\b[up,5,8]哼，冥顽不灵，一刀劈死完事。\n以洛渔神之名。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[虎魔甲士,E771]\b[down,5,6]杀……杀人不好吧……而且，我，我晕血……",
        "\t[虎魔死士,E773]\b[up,5,8]亵渎洛渔神的垃圾，杀了就杀了。\n清洁工。",
        {
            "type": "show",
            "loc": [
                [
                    4,
                    6
                ]
            ],
            "time": 500
        },
        {
            "type": "move",
            "loc": [
                4,
                6
            ],
            "time": 500,
            "keep": true,
            "steps": [
                "down:1"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "hide",
            "loc": [
                [
                    4,
                    7
                ]
            ],
            "remove": true,
            "time": 500
        },
        "\t[虎魔死士,E773]\b[up,5,8]行了，你可以睁眼了，已经都打扫干净了。",
        "\t[虎魔甲士,E771]\b[down,5,6]……我，我……",
        "\t[虎魔死士,E773]\b[up,5,8]哎，像你这么拉跨的新人我还真没见过。\n不过不用担心，以洛渔神之名，你会习惯的，相信我。",
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "right:1"
            ]
        },
        {
            "type": "animate",
            "name": "E_dots",
            "loc": "hero"
        },
        "\t[hero]\b[down,null]挡路的这家伙，叫做\r[yellow]戾气斩除者\r？那边都杀人了你不管吗？",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[戾气斩除者,E784]\b[down,null]分析指定方向情绪数据……\n结果：虔诚80%，愧疚20%。\n综合评价：\r[yellow]4.9分\r。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[戾气斩除者,E784]\b[down,null]检测面前单位情绪数据……\n结果：戾气99.891%。\n综合评价：\r[red]理应斩除\r。",
        "\t[hero]\b[down,null]？？？我如果是人类，恐怕早就死于高血压了。",
        "\t[晴芸,hero3]\b[down,null]管理者的狗腿子而已，你不会真的指望它对我们讲道理吧？\n当它说我们有戾气的时候，我们最好真的有！",
        "\t[hero]\b[down,null]……好，干死它们！"
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[3, 4, 100]\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "4,6": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "0,8": {
            "floorId": "Ch4_64",
            "loc": [
                12,
                5
            ]
        },
        "6,0": {
            "floorId": "Ch4_66",
            "loc": [
                5,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [150048,150049,150048,150049,150048,150049,  0,150048,150049,150048,150049,150048,150049],
    [180,180,330,656,774, 21,  0,658,180, 21,180,656,332],
    [180,180,180,180,180,790,180, 82,180,773,180,772,180],
    [ 21, 82,331,778,  0,331,  0, 82, 21,  0,774,  0,180],
    [657,180,  0,180,330,  0,334,180,  0,771,180,331,180],
    [331,774,330,180,180, 82,180,180,180,657, 81,  0,180],
    [656,180,772,150116,799,771,  0,331,779,  0,180, 81,333],
    [180,180,  0, 81,691,  0, 21,  0,180,330,180,180,180],
    [  0,  0,784,180,180,773,180,180,180,  0,777,  0,330],
    [180,180,  0,180,331,  0,656,180,331,  0,180, 21,  0],
    [334,180,772,180, 81,180,180,180,180,  0, 81,  0,180],
    [331,180,  0,180, 22,  0,180,661,180,778,180,331,  0],
    [330,777,  0,777,  0,784,656,773,180,333,180,180,783]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,150100,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,150108,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0, 91,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "upFloor": [
        6,
        0
    ],
    "downFloor": [
        0,
        8
    ],
    "hard1_enemy_ratio": 95
}