main.floors.Ch4_128=
{
    "floorId": "Ch4_128",
    "title": "千虹广场-8",
    "name": "千虹广场-8",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "area21.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0,
            "w": 416,
            "h": 416
        }
    ],
    "ratio": 50,
    "defaultGround": "T754",
    "bgm": "area21.mp3",
    "color": [
        0,
        0,
        0,
        0.3
    ],
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "1,1": [
            "\t[系统提示]需要清理前面所有敌人。正在检测中……",
            {
                "type": "function",
                "function": "function(){\ncore.plugin.checkEnemy(\"Ch4_122\", \"Ch4_128\");\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainEnemyCount>0)",
                "true": [
                    "共有${flag:remainEnemyCount}个敌人未清除。",
                    {
                        "type": "if",
                        "condition": "(flag:remainEnemyCount>641)",
                        "true": [
                            "当前剩余敌人较多，请自行检查。"
                        ],
                        "false": [
                            "剩余敌人：${flag:remainEnemyInfo}"
                        ]
                    }
                ],
                "false": [
                    "检测通过！",
                    {
                        "type": "function",
                        "function": "function(){\ncore.setFlag(\"setBlock_disable_refresh\", true);\nfor (var x = 8; x < 13; ++x) {\n\tfor (var y = 0; y < 13; ++y) {\n\t\tcore.hideBgFgMap(\"fg\", [x, y]);\n\t}\n}\ncore.setFlag(\"setBlock_disable_refresh\", false);\ncore.redrawMap();\n}"
                    },
                    {
                        "type": "hide"
                    }
                ]
            },
            {
                "type": "function",
                "function": "function(){\ncore.removeFlag(\"remainEnemyInfo\");\ncore.removeFlag(\"remainEnemyCount\");\n}"
            }
        ],
        "2,1": [
            "\t[系统提示]需要拾取本区域所有宝石。正在检测中……",
            {
                "type": "if",
                "condition": "!core.plugin.checkGem(\"Ch4_122\", \"Ch4_128\")",
                "true": [
                    "仍然有宝石未拾取。"
                ],
                "false": [
                    "检测通过！",
                    {
                        "type": "hide"
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "2,12": {
            "floorId": "Ch4_127",
            "loc": [
                10,
                0
            ]
        },
        "12,6": {
            "floorId": "Ch4_129",
            "loc": [
                0,
                7
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {
        "1,3": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_128_2_2",
                "operator": "+=",
                "value": "1"
            }
        ],
        "3,3": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_128_2_2",
                "operator": "+=",
                "value": "1"
            }
        ],
        "1,7": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_128_2_6",
                "operator": "+=",
                "value": "1"
            }
        ],
        "3,7": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_128_2_6",
                "operator": "+=",
                "value": "1"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "2,6": {
            "0": {
                "condition": "flag:door_Ch4_128_2_6==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_Ch4_128_2_6",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            }
        },
        "2,2": {
            "0": {
                "condition": "flag:door_Ch4_128_2_2==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_Ch4_128_2_2",
                        "operator": "=",
                        "value": "null"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [197,197,197,197,197, 17, 17, 17,200,200,200,200,200],
    [197,126,911, 23,197, 17, 17, 17,200,200,200,200,200],
    [197,197, 85,197,197, 17, 17, 17,200,200,200, 23,200],
    [197,886,665,886,197, 17, 17, 17,200,200,200, 84,200],
    [197,197,896,197,197, 17, 17, 17,200,  0, 83,  0,200],
    [ 23,703,664,703, 23, 17, 17, 17,200, 83,200, 83,200],
    [197,197, 85,197,197, 17, 17, 17,200,  0,805, 23,  0],
    [197,898,666,898,197, 17, 17, 17,200, 83,200,200,200],
    [197,197, 83,197,197, 17, 17, 17,200,  0, 84,  0,200],
    [881,197,  0,851,197, 17, 17, 17,200, 83,200, 84,200],
    [ 82,197,334,  0,197, 17, 17, 17,200,  0, 83, 23,200],
    [881, 82,  0, 23,197, 17, 17, 17,200,200,200,  0,200],
    [197,197,  0,197,197, 17, 17, 17,200,200,200,200,200]
],
    "hard1_enemy_ratio": 95,
    "bgmap": [
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754],
    [916,916,916,916,916,  0,  0,  0,754,754,754,754,754]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141],
    [  0,  0,  0,  0,  0,  0,  0,  0,141,141,141,141,141]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 94],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0, 93,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "upFloor": [
        12,
        6
    ],
    "downFloor": [
        2,
        12
    ],
    "weather": [
        "rain",
        1
    ]
}