main.floors.Ch4_5=
{
    "floorId": "Ch4_5",
    "title": "通幽径-5",
    "name": "通幽径-5",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T641",
    "firstArrive": [],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[2, 6, 100],\n\t[10, 6, 100]\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "7,12": [
            "\t[系统提示]给没打过第三章的玩家再次说明机关门的特点：\n\r[yellow]机关门的开启条件是在\\i[flower]花形图案上击败一定数量的怪物。\r\n前方的6个\\i[E647]龙蝠身下各有一个花形图案。显然，在这里，只要击杀所有龙蝠即可开门，即使你使用\\i[skill6]后抛改变了它们的位置，也只是把它们从一个花形图案扔到另一个上面。"
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "Ch4_4",
            "loc": [
                6,
                0
            ]
        },
        "6,0": {
            "floorId": "Ch4_6",
            "loc": [
                6,
                12
            ]
        }
    },
    "afterBattle": {
        "5,6": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_5_6_3",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(6,3);\n}"
            }
        ],
        "7,6": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_5_6_3",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(6,3);\n}"
            }
        ],
        "5,8": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_5_6_3",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(6,3);\n}"
            }
        ],
        "7,8": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_5_6_3",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(6,3);\n}"
            }
        ],
        "5,4": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_5_6_3",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(6, 3);\n}"
            }
        ],
        "7,4": [
            {
                "type": "setValue",
                "name": "flag:door_Ch4_5_6_3",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(6,3);\n}"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "6,3": {
            "0": {
                "condition": "flag:door_Ch4_5_6_3==6",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_Ch4_5_6_3",
                        "value": "null"
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.hideBgFgMap(\"bg2\", [\n\t[5, 4],\n\t[7, 4],\n\t[5, 6],\n\t[7, 6],\n\t[5, 8],\n\t[7, 8]\n]);\n}"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "map": [
    [159,159,159,159,159,159, 91,159,159,159,159,159,159],
    [159,327,  0,545, 81,652,333,653, 82,547,  0,328,159],
    [159,  0,330,  0,159,386,654, 22,159,  0,330,  0,159],
    [159,547,159,159,159,159, 85,159,159,159,159, 81,159],
    [159,  0,159,330,159,647,  0,647,159,  0, 21,  0,159],
    [159, 21,159,327,159,  0,585,  0,159,330,  0,545,159],
    [159,  0,669,543,159,647,  0,647,159,  0,669,327,159],
    [159,  0, 81,  0,159,  0,585,  0,159,648,159,  0,159],
    [159,648,159,642,159,647,  0,647,159,  0,159,330,159],
    [159,329,159,328,159,159, 83,159,159, 81,159,159,159],
    [159,159,159,159,159,334,  0,334,159,649,327,  0,159],
    [159,334, 81,334, 81,  0,  0,  0, 84, 21,  0,330,159],
    [159,159,159,159,159,159, 93,129,159,159,159,159,159]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,171,171,171,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,869,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,668,  0,  0,  0,  0,  0,  0,  0,668,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,168,  0,168,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,168,  0,168,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,168,  0,168,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "bgm": "area13.mp3",
    "downFloor": [
        6,
        12
    ],
    "upFloor": [
        6,
        0
    ],
    "color": [
        0,
        0,
        0,
        0.6
    ],
    "hard1_enemy_ratio": 95,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}