main.floors.Ch4_car=
{
    "floorId": "Ch4_car",
    "title": "车内",
    "name": "车内",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canFlyFrom": false,
    "canUseQuickShop": true,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T770",
    "bgm": "area18.mp3",
    "color": null,
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "setVolume",
            "value": 90,
            "time": 0
        },
        "\t[械灵-Angel,E704]\b[down,null]恭喜你们圆满完成了任务。\n虎魔帮没有了膜拜对象，想必要树倒猢狲散了。",
        "\t[晴芸,hero3]\b[down,null]虽然，我觉得打完就跑对那里的普通居民挺不负责任的……\n不过即使这样也比让虎魔帮统治那里强。",
        "\t[械灵-Angel,E704]\b[down,null]我们之后会回来建立新的秩序的，但现在时间很紧迫。\n下一站是\r[yellow]摩宇城\r。",
        "\t[晴芸,hero3]\b[down,null]终于！要来了吗！",
        "\t[械灵-Angel,E704]\b[down,null]那位大人已经率领主力部队抵达摩宇城外围，并且以反抗军的名号正式宣战了。\n接下来我向9922讲解一下摩宇城的大致结构。\n晴芸小姐如果发现我讲的有什么错误请立即打断我。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[械灵-Angel,E704]\b[down,null]摩宇城分为三大部分，三等和二等公民居住的下城区，一等公民和第零公民所处的上城区，以及穿插于各处的独立空间\r[yellow]望梅界\r。",
        "\t[械灵-Angel,E704]\b[down,null]你们之前已经从福平那里听说玉梅天的信息了，实际上望梅界正是借用了一点相关的力量而建立的，所以其中的空间有些扭曲。你可能进入望梅界只走了很短的一段路，但出来的时候发现自己到了很远的地方。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[械灵-Angel,E704]\b[down,null]已经有可靠的消息表明，狱贤躲在上城区中心的\r[yellow]摩极大厦\r里，并派他的下属阻挡反抗军。\n虽然这些防卫军根本不可能是那位大人的对手，顶多只能拖延些时间而已，不过这是个危险的信号，毕竟我们并不知道拖久了以后会发生什么。而且，另一个目标福博还未曾露面。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[械灵-Angel,E704]\b[down,null]鉴于这个特殊的情况，你们的任务是——尽快找到狱贤。虽然不知道他在躲着做什么，但对我们来讲肯定不是什么好事，这是本次行动中最大的不稳定因素。",
        "\t[械灵-Angel,E704]\b[down,null]你们不必与杂鱼敌人缠斗，但为了到达摩极大厦，仍然需要从下城区开始，一路杀上去。\n晴芸小姐能帮助规划出最优的路线吧？",
        "\t[晴芸,hero3]\b[down,null]没问题，我对摩宇城的地形非常熟悉。",
        "\t[hero]\b[down,null]那么我只需要负责打架就行了。听起来不难。\n那你呢？",
        "\t[械灵-Angel,E704]\b[down,null]我和其他械灵不会直接去一线战斗，而是跟随在相对安全的后方进行清理工作。\n我们械灵的战斗力其实不强，即使那位大人给我们也灌注了一点至尊之力……\n不过我们仍然能发挥自己的作用。",
        "\t[hero]\b[down,null]嗯，之前在格沃堡的时候对它们拥有的各种奇怪特技有所体会。",
        "\t[械灵-Angel,E704]\b[down,null]没错，之前你在拓岩镇应该见过那种炸门的机器人，但是跟我们械灵的炸门技术相比差远了。",
        "\t[晴芸,hero3]\b[down,null]对了，说起这个，械灵的那些特技到底是什么原理？我感觉像是一些特殊的魔法力量？",
        "\t[械灵-Angel,E704]\b[down,null]是的，我们械灵的魔法可谓是自成一派，你对原理感兴趣的话我可以给你仔细讲讲。",
        "在之后的路途中，械灵-Angel开始讲解械灵特技的原理。\n9922很快就放弃了，它发现自己似乎没有半点魔法天赋，根本听不明白。\n晴芸很有兴致，时不时提出问题。不知不觉间，已经到达了目的地。",
        {
            "type": "if",
            "condition": "flags.hard==2",
            "true": [
                {
                    "type": "setValue",
                    "name": "status:hp",
                    "operator": "*=",
                    "value": "1.5",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:hp",
                    "operator": "+=",
                    "value": "100000000",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:mana",
                    "operator": "+=",
                    "value": "1500"
                },
                "\t[系统提示]经过短暂的休息，\r[orange]生命*1.5（普通难度福利）\r，再回复1e生命和1500能量。"
            ],
            "false": [
                {
                    "type": "setValue",
                    "name": "status:hp",
                    "operator": "+=",
                    "value": "100000000",
                    "norefresh": true
                },
                {
                    "type": "setValue",
                    "name": "status:mana",
                    "operator": "+=",
                    "value": "1500"
                },
                "\t[系统提示]经过短暂的休息，回复1e生命和1500能量。"
            ]
        },
        {
            "type": "changeFloor",
            "floorId": "Ch4_80",
            "loc": [
                0,
                6
            ],
            "direction": "right",
            "time": 2000
        }
    ],
    "eachArrive": [],
    "parallelDo": "if (timestamp - core.getFlag('lastTime', 0) > 3000) {\n\tcore.vibrate(\"horizontal\", 300, 3, 3);\n\n\tcore.setFlag('lastTime', timestamp);\n}",
    "events": {
        "6,5": {
            "trigger": null,
            "enable": true,
            "noPass": null,
            "displayDamage": false,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {},
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,150528,150529,150529,150529,150531,  0,  0,  0,  0],
    [  0,  0,  0,  0,150536,150035,150036,150037,150539,  0,  0,  0,  0],
    [  0,  0,  0,  0,150544,150043,150044,150045,150547,  0,  0,  0,  0],
    [  0,  0,  0,  0,150544,  0,862,  0,150555,  0,  0,  0,  0],
    [  0,  0,  0,  0,150552,  0,  0,387,150547,  0,  0,  0,  0],
    [  0,  0,  0,  0,150544,150611,150612,150613,150547,  0,  0,  0,  0],
    [  0,  0,  0,  0,150552,150619,150620,150621,150555,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150514,150514,150514,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150514,150514,150514,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150514,150514,150514,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150514,150514,150514,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150514,150514,150514,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150514,150514,150514,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150514,150514,150514,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505],
    [150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505,150505]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,150649,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,150560,150561,150562,150562,150563,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "hard1_enemy_ratio": 95
}