main.floors.Ch4_10=
{
    "floorId": "Ch4_10",
    "title": "通幽径-10",
    "name": "通幽径-10",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T641",
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "area14.mp3"
        }
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.plugin.setBgLight([\n\t[6, 0, 641]\n]);\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "6,7": [
            "\t[系统提示]需要清理前面所有敌人。正在检测中……",
            {
                "type": "function",
                "function": "function(){\ncore.plugin.checkEnemy(\"Ch4_1\", \"Ch4_9\");\n}"
            },
            {
                "type": "if",
                "condition": "(flag:remainEnemyCount>0)",
                "true": [
                    "共有${flag:remainEnemyCount}个敌人未清除。",
                    {
                        "type": "if",
                        "condition": "(flag:remainEnemyCount>641)",
                        "true": [
                            "当前剩余敌人较多，请自行检查。"
                        ],
                        "false": [
                            "剩余敌人：${flag:remainEnemyInfo}"
                        ]
                    }
                ],
                "false": [
                    "检测通过！",
                    {
                        "type": "hide"
                    }
                ]
            },
            {
                "type": "function",
                "function": "function(){\ncore.removeFlag(\"remainEnemyInfo\");\ncore.removeFlag(\"remainEnemyCount\");\n}"
            }
        ],
        "6,6": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[Moe,E262]\b[down,null]你好，欢迎来到格沃堡，我是Moe，Mo-E。\n二位这么晚来访，有什么事情想办吗？",
                "\t[hero]\b[down,null]是的，我来这里，是为了……额……\n（糟了，该怎么说……）",
                {
                    "type": "animate",
                    "name": "E_question",
                    "loc": [
                        6,
                        6
                    ]
                },
                {
                    "type": "animate",
                    "name": "E_dots",
                    "loc": "hero"
                },
                "\t[hero]\b[down,null]总之我有很重要的事情！还请让我进去！",
                "\t[Moe,E262]\b[down,null]这个理由的话，不行诶……",
                "\t[hero]\b[down,null]看来只能来硬的了！",
                "\t[晴芸,hero3]\b[down,null]哎等等……",
                {
                    "type": "battle",
                    "loc": [
                        6,
                        6
                    ]
                }
            ]
        },
        "6,5": [
            {
                "type": "confirm",
                "text": "进去就无法返回了。",
                "yes": [
                    {
                        "type": "changeFloor",
                        "floorId": "Ch4_11",
                        "loc": [
                            6,
                            12
                        ],
                        "time": 1000
                    }
                ],
                "no": []
            }
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "Ch4_9",
            "loc": [
                1,
                0
            ]
        }
    },
    "afterBattle": {
        "6,6": [
            {
                "type": "setBlock",
                "number": "E262",
                "loc": [
                    [
                        6,
                        6
                    ]
                ]
            },
            "\t[Moe,E262]\b[down,null]这位客人真的很粗暴呢。这样的话，我是不会放你过去的。",
            "\t[hero]\b[down,null]（这，这家伙竟然这么强……）",
            "\t[晴芸,hero3]\b[down,null]（想什么呢，除灵者都不敢正面强攻的地方，你也敢来硬的？）",
            "\t[hero]\b[down,null]（……好吧，我是智障。）",
            "\t[晴芸,hero3]\b[down,null]（让开，我来。）",
            {
                "type": "sleep",
                "time": 1000
            },
            "\t[晴芸,hero3]\b[down,null]你好，我是从城里出来旅游的，听说这里是秉凌大人的故居，特意前来拜访。",
            "\t[Moe,E262]\b[down,null]来这里拜访，真是稀客啊。",
            "\t[晴芸,hero3]\b[down,null]毕竟一路上的野兽着实凶残，要不是我有这智械当保镖，恐怕也来不了这里。\n而且，大家都说这里是很偏僻、落后的地方，但我了解过秉凌大人的一些事迹，我知道这里肯定不像他们说的那样糟糕，是这样的吧？",
            "\t[Moe,E262]\b[down,null]这个智械是你的保镖？所以你在见到人的时候都是先让保镖跟对方交流的吗？",
            "\t[晴芸,hero3]\b[down,null]诶嘿，总得试探一下嘛。\n何况你应该也发现了，我这保镖脑子不太好使，所以需要多给它一些机会来锻炼呀~",
            "\t[Moe,E262]\b[down,null]可是我感觉你这保镖攻击性有点强呢，你确定你有能力管好它，不让它滥伤无辜？",
            "\t[晴芸,hero3]\b[down,null]当然没问题！喂，听到没有？",
            {
                "type": "animate",
                "name": "E_sweat",
                "loc": "hero"
            },
            "\t[hero]\b[down,null]……是，主人。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": [
                    6,
                    6
                ]
            },
            {
                "type": "sleep",
                "time": 500
            },
            "\t[Moe,E262]\b[down,null]既然是来访的客人，那么——\n欢迎来到格沃堡。",
            {
                "type": "hide",
                "loc": [
                    [
                        6,
                        6
                    ]
                ],
                "remove": true
            },
            {
                "type": "animate",
                "name": "light2",
                "loc": [
                    6,
                    6
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    4,
                    6
                ]
            },
            {
                "type": "openDoor",
                "loc": [
                    8,
                    6
                ]
            },
            "\t[晴芸,hero3]\b[down,null]好啦，搞定~",
            "\t[hero]\b[down,null]这，这就能过去了？",
            "\t[晴芸,hero3]\b[down,null]当然啦，不然呢？你想跟门卫大战三百回合，然后再闯入格沃堡内部杀它们个片甲不留？",
            "\t[hero]\b[down,null]我，好像没那么厉害……",
            "\t[晴芸,hero3]\b[down,null]我看刚才那个门卫从头到尾都没把我们视为威胁，估计它这么轻易地放我们进去，是觉得就算咱们图谋不轨，也搞不出什么风浪。",
            {
                "type": "animate",
                "name": "E_sweat",
                "loc": "hero"
            },
            "\t[hero]\b[down,null]嗯，这么说，还挺有道理的……\n不对，我们搞不了事还为什么要冲到这个鬼地方呀，这一个门卫都这么强，进去不是找死吗？\n而且这门卫不会什么时候突然又冒出来把我们击杀了吧……",
            "\t[晴芸,hero3]\b[down,null]不，我觉得来这里非常正确。\n我之前看过有关格沃堡的一些资料，对这里还是很了解的，里面不会很危险。\n总之快进去看看吧。"
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0,  0,100961,100124,100963,100964,100965,100966,100967,100120,100121,100122,100123],
    [  0,  0,100969,100970,100971,100972,100973,100974,100975,100970,  0,  0,  0],
    [  0,  0,100977,100978,100979,100980,100981,100982,100983,100978,  0,  0,  0],
    [  0,  0,100985,100986,100987,100988,100989,100990,100991,100986,  0,  0,  0],
    [  0,  0,  0,  0,100995,100996,100997,100998,100999,  0,  0,  0,  0],
    [ 17, 17, 17, 17,101003,101004,101005,101006,101007, 17, 17, 17, 17],
    [  0,331,  0, 21, 85,  0,262,  0, 85, 21,  0,331,  0],
    [334,  0, 30,  0,159,159,126,159,159,  0, 30,  0,334],
    [  0,330,  0, 21,159,656,654,657,159, 21,  0,330,  0],
    [332,  0,334,  0,159,159, 83,159,159,  0,334,  0,332],
    [159,159,159,159,159,331,  0,330,159,159,159,159,159],
    [159,330,567,330, 84,  0,  0,  0, 84,330,567,330,159],
    [159,159,159,159,159,159, 93,159,159,159,159,159,159]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [171,171,171,171,  0,  0, 91,  0,  0,171,171,171,171],
    [171,171,171,171,  0,  0,  0,  0,  0,171,171,171,171],
    [171,171,171,171,  0,171,171,171,  0,171,171,171,171],
    [171,171,171,171,  0,  0,  0,  0,  0,171,171,171,171],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,171,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [100337,100338,100339,100340,  0,  0,  0,  0,  0,100336,100337,100338,100339],
    [100345,100346,100347,100348,  0,  0,  0,  0,  0,100344,100345,100346,100347],
    [100353,100354,100355,100356,  0,  0,  0,  0,  0,100352,100353,100354,100355],
    [100361,100362,100363,100364,  0,  0,  0,  0,  0,100360,100361,100362,100363],
    [100369,100370,100371,100372,  0,  0,  0,  0,  0,100368,100369,100370,100371],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "bgm": "area13.mp3",
    "color": [
        0,
        0,
        0,
        0.6
    ],
    "downFloor": [
        6,
        12
    ],
    "hard1_enemy_ratio": 95,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}