main.floors.Ch4_82=
{
    "floorId": "Ch4_82",
    "title": "华炳街-2",
    "name": "华炳街-2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "T817",
    "bgm": "area19.mp3",
    "color": [
        0,
        0,
        0,
        0.2
    ],
    "firstArrive": [
        {
            "type": "setBlock",
            "number": "npc1",
            "loc": [
                [
                    11,
                    6
                ]
            ]
        },
        {
            "type": "move",
            "loc": [
                11,
                6
            ],
            "time": 200,
            "keep": true,
            "steps": [
                "up:1",
                "left:2"
            ]
        },
        {
            "type": "turnBlock",
            "direction": "down",
            "loc": [
                [
                    9,
                    5
                ]
            ]
        },
        "\t[三等公民,npc0]\b[down,9,5]救命……",
        {
            "type": "hide",
            "loc": [
                [
                    9,
                    5
                ]
            ],
            "remove": true
        },
        {
            "type": "setBgFgBlock",
            "name": "bg",
            "number": "X140658",
            "loc": [
                [
                    9,
                    5
                ]
            ]
        },
        {
            "type": "animate",
            "name": "snipe",
            "loc": [
                9,
                5
            ]
        },
        "\t[摩宇自卫队A,E820]\b[down,9,6]什么人！",
        "\t[摩宇自卫队B,E820]\b[up,7,10]我靠，老哥你啥情况？你看清楚来者是谁了吗就开枪？",
        "\t[摩宇自卫队A,E820]\b[down,9,6]我……我太紧张了，以为是敌人偷袭我背后了……",
        "\t[摩宇自卫队B,E820]\b[up,7,10]算了算了，杀就杀吧，反正也没人管。\n不过有一说一，咱加入自卫队不就是为了混点军饷，等仗打完了在望梅界多混几天吗，也不求能拿下什么战功，只要苟住不就行了？",
        "\t[摩宇自卫队A,E820]\b[down,9,6]老哥说的在理，混就完事了，天下兴亡关咱这种三等公民屁事！\n打打杀杀的事情让这些机器人去做就好，只要我不主动开枪，说不定敌人也不会打我呢。",
        "\t[摩宇自卫队B,E820]\b[up,7,10]那可不行，听说反叛军那些智械可坏了，见到人类就杀，\r[yellow]有好多手无寸铁的平民都惨遭毒手\r。",
        "\t[摩宇自卫队A,E820]\b[down,9,6]我去，这么恐怖的吗？",
        "\t[摩宇自卫队B,E820]\b[up,7,10]那是，刚才被你击毙的平民应该就是为了逃命来的。\n所以咱苟归苟，该开枪的时候也别含糊。懂？",
        "\t[摩宇自卫队A,E820]\b[down,9,6]懂。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "12,6": {
            "floorId": "Ch4_83",
            "loc": [
                0,
                1
            ]
        },
        "1,12": {
            "floorId": "Ch4_81",
            "loc": [
                11,
                0
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [197,197,197,197,197,197,197,197,197,197,197,197,197],
    [197,566,197,334,566,197,332, 22,816,660,197,662,197],
    [197,660,197,197,809,197,161024,161025,  0,807, 81,820,197],
    [197,334,333,809, 21, 81,332,  0, 22,  0,197,661,197],
    [197,197,197, 81,197,197,811,160851, 81,197,197,197,197],
    [197,  0,334,  0, 82, 82,660,  0,332,  0,  0,  0,197],
    [197,660,197,807,197,197,197,197,197,820,197,  0,  0],
    [197, 81,197,  0,332, 82,811,197,566,  0, 81,333,197],
    [197,  0,197,814,  0,160619,  0,661,  0,334,197,809,197],
    [197,332,810,  0,333,816,332,  0,333,  0,197,332,197],
    [197,  0,197,197,809,197,197,820,161024,161025,197,  0,197],
    [197,  0,197, 21,333,661,197,  0,333,807,  0,334,197],
    [197,  0,197,197,197,197,197,197,197,197,197,197,197]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 94],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0, 93,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "upFloor": [
        12,
        6
    ],
    "downFloor": [
        1,
        12
    ],
    "hard1_enemy_ratio": 95
}