main.floors.Ch4_92_2=
{
    "floorId": "Ch4_92_2",
    "title": "上城区入口",
    "name": "上城区入口",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [
        {
            "name": "area19.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 50,
    "defaultGround": "T916",
    "bgm": null,
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,11": [
            {
                "type": "show",
                "loc": [
                    [
                        6,
                        9
                    ]
                ]
            },
            {
                "type": "animate",
                "name": "yongchang",
                "loc": [
                    6,
                    9
                ]
            },
            "\t[2 2 2 1,N2221]\b[up,6,9]真没想到反倒是你们抢先一步击败了铁焚。刚才我被这家伙随机传送到十万八千里之外了，真是见鬼……",
            "\t[晴芸,hero3]\b[down,null]这里就你一个吗？你的除零者呢？",
            "\t[2 2 2 1,N2221]\b[up,6,9]分散在各处与摩宇城的防卫军缠斗。不得不承认，铁焚成功地拖延了许多时间，现在敌人的高级机甲正源源不断地从城市中心的\r[yellow]摩极大厦\r涌出，其单体战斗力远在除零者机甲之上。",
            "\t[2 2 2 1,N2221]\b[up,6,9]这种时候就不能指望那些杂兵了。必须利用突出的个人实力破局。\n我先上了，你们跟好。",
            {
                "type": "openDoor",
                "loc": [
                    6,
                    8
                ]
            },
            {
                "type": "move",
                "loc": [
                    6,
                    9
                ],
                "time": 150,
                "keep": true,
                "steps": [
                    "up:3"
                ]
            },
            "\t[摩宇特战军A,E821]\b[down,5,4]有人来了！不是防卫军的人！\n救命！我们不想要战争！我们要和平！",
            "\t[摩宇特战军B,E821]\b[down,7,4]摩宇城是高层管理的家园，不是我们这些平民的家园！我们不想守护它！",
            {
                "type": "setVolume",
                "value": 0,
                "time": 1000,
                "async": true
            },
            {
                "type": "animate",
                "name": "fire_mute",
                "loc": [
                    5,
                    4
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "fire",
                "loc": [
                    7,
                    4
                ]
            },
            "\t[摩宇特战军A,E821]\b[down,5,4]对，我们不想……谔谔……",
            "\t[晴芸,hero3]\b[up,hero]又出现了！那种外部力量！",
            {
                "type": "sleep",
                "time": 500
            },
            "\t[摩宇特战军B,E821]\b[down,7,4]\r[red]就凭你们这点实力也敢来摩宇城送死？真是太逊了！\r",
            "\t[摩宇特战军A,E821]\b[down,5,4]\r[red]弱诶，你很弱诶！\r",
            "\t[2 2 2 1,N2221]\b[down,6,6]哦？那么，接我一招试试？",
            {
                "type": "waitAsync"
            },
            {
                "type": "move",
                "loc": [
                    6,
                    6
                ],
                "time": 30,
                "keep": true,
                "steps": [
                    "up:2"
                ]
            },
            {
                "type": "animate",
                "name": "crossattack",
                "loc": [
                    5,
                    4
                ],
                "async": true
            },
            {
                "type": "animate",
                "name": "crossattack",
                "loc": [
                    7,
                    4
                ],
                "async": true
            },
            {
                "type": "move",
                "loc": [
                    6,
                    4
                ],
                "time": 30,
                "steps": [
                    "up:5"
                ]
            },
            {
                "type": "hide",
                "loc": [
                    [
                        5,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "hide",
                "loc": [
                    [
                        7,
                        4
                    ]
                ],
                "remove": true
            },
            {
                "type": "function",
                "function": "function(){\ncore.setBgFgBlock(\"bg2\", \"X140648\", 5, 4);\ncore.setBgFgBlock(\"bg2\", \"X140665\", 7, 4);\n}"
            },
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[hero]\b[up,hero]这俩人好惨……",
            "\t[晴芸,hero3]\b[up,hero]刚才这两人身上爆发的外部力量，与之前孤鸣身上出现的略有不同，但特性极为相似，很可能是同源的。",
            "\t[晴芸,hero3]\b[up,hero]绝对不是偶然。孤鸣和刚才这两人，在受到“那个”的影响之后，都突然变得无法沟通。",
            "\t[hero]\b[up,hero]如此，就能轻易地引起厮杀，这就是幕后黑手的手段吗……\n整座城的人，都已经沦为他们的掌中玩物了。",
            {
                "type": "playBgm",
                "name": "area19_2.mp3"
            },
            {
                "type": "setVolume",
                "value": 90,
                "time": 0
            },
            {
                "type": "setValue",
                "name": "flag:Ch4_92_2_entered",
                "value": "1"
            },
            {
                "type": "hide",
                "remove": true
            }
        ],
        "6,9": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "opacity": 1,
            "filter": {
                "blur": 0,
                "hue": 0,
                "grayscale": 0,
                "invert": false,
                "shadow": 0
            },
            "data": []
        }
    },
    "changeFloor": {
        "6,12": {
            "floorId": "Ch4_92",
            "loc": [
                6,
                0
            ]
        },
        "6,0": {
            "floorId": "Ch4_99",
            "loc": [
                6,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [197,197,197,197,197,197,  0,197,197,197,197,197,197],
    [197,823, 82, 84,197,  0,  0,  0,197, 82, 81,825,197],
    [197,197,197,822,197,  0,  0,  0,197, 84,197,197,197],
    [197,881,197, 81, 84,  0,  0,  0, 84,824,197,881,197],
    [197, 82,197, 83,197,821,  0,821,197, 83,197, 82,197],
    [197,334, 81,334, 81,  0,  0,  0, 81,334, 81,334,197],
    [197,197,197, 84,197,  0,  0,  0,197, 84,197,197,197],
    [197,568,569,568, 83,  0,  0,  0, 83,568,569,568,197],
    [197,197,197,197,197,197, 85,197,197,197,197,197,197],
    [160858,197,197,  0,  0,  0,844,  0,  0,  0,197,197,160858],
    [ 17, 17,197,197,  0,  0,  0,  0,  0,197,197, 17, 17],
    [ 17, 17, 17,197,197,  0,  0,  0,197,197, 17, 17, 17],
    [ 17, 17, 17, 17,197,197,  0,197,197, 17, 17, 17, 17]
],
    "bgmap": [
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [145,145,145,145,145,145,145,145,145,145,145,145,145],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,817,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [160850,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,160850],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0, 91,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [318,318,318,318,318,318,318,318,318,318,318,318,318],
    [  0,  0,318,318,318,318,318,318,318,318,318,  0,  0],
    [  0,  0,  0,318,318,318,318,318,318,318,  0,  0,  0],
    [  0,  0,  0,  0,318,318, 93,318,318,  0,  0,  0,  0]
],
    "fg2map": [

],
    "upFloor": [
        6,
        0
    ],
    "downFloor": [
        6,
        12
    ],
    "hard1_enemy_ratio": 95
}