main.floors.Ch4_2C=
{
    "floorId": "Ch4_2C",
    "title": "圣洁教堂-12",
    "name": "圣洁教堂-12",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "ground6",
    "bgm": "area15.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "7,9": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    "秉凌被流放后 神的部下中 有一部分自愿追随 帮他完成未竟的事业\n秉凌用自己的家当 在国土最偏僻的无为村之外 建立了格沃堡\n追随者们也利用各自的财力 购置设备 承担日常开销 支撑着他们共同的研究事业\n与此同时 在神的国土上 用机械取代肉体的技术蓬勃发展\n械造的四肢 器官 赋予常人超凡的身体素质\n机械改造风靡一时 人们纷纷抛弃脆弱的肉体凡胎\n唯有大脑 承载着思想和灵魂 无法抛弃 无可替代",
                    {
                        "type": "animate",
                        "name": "E_question",
                        "loc": "hero"
                    },
                    "\t[hero]看到这里，已经基本明白格沃堡一带的历史了。",
                    "\t[晴芸,hero3]嗯，秉凌和他的追随者们在这里建立了一个比较独立的社会，基本脱离了“神”的管辖。\n许多高等型号的械灵和像你这样的新一代智械，是在那之后才诞生的。",
                    {
                        "type": "sleep",
                        "time": 300
                    },
                    "\t[hero]不过还有个疑问，“用机械取代肉体的技术”，听起来跟改造大脑的“械灵化”相差也不是很大嘛。",
                    "\t[晴芸,hero3]应该是因为改造大脑和改造其他器官相比，有着某种本质的区别吧。\n比如机械手臂或腿的改造技术，很久以前就成熟了。",
                    "\t[hero]你以前也接受过这样的改造吗？",
                    "\t[晴芸,hero3]嗯？何出此言？",
                    "\t[hero]从今天早上咱们相遇开始，到现在接近半夜了，一路走来基本没怎么休息，\n我就是再怎么22也能看出来，你的身体素质远超普通人了。",
                    "\t[晴芸,hero3]算你猜对一半。\n实际上也不算什么秘密，之前提到的“机械改造”是两大飞升方式之一，另一种是“基因编辑”。",
                    {
                        "type": "animate",
                        "name": "E_surprise",
                        "loc": "hero"
                    },
                    "\t[hero]基因……编辑？\n听起来就很厉害，那你是不是一拳能打哭十个我啊？",
                    "\t[晴芸,hero3]你想什么呢！我要那么大力量有用吗！",
                    {
                        "type": "animate",
                        "name": "E_sweat",
                        "loc": "hero"
                    },
                    "\t[晴芸,hero3]而且力量那么大，肯定会变得很能吃吧，然后变成大胖子……\n我又不是什么战斗单位，也不做体力劳动，力量多大并不重要，重要的是耐受力，还有美观！",
                    {
                        "type": "animate",
                        "name": "E_unhappy",
                        "loc": "hero"
                    },
                    "\t[晴芸,hero3]说起来，已经快到午夜了，也不知“幽”那边怎样了……\n算下来，他应该已经如愿取得大赛冠军，并且快赶回来了。",
                    "\t[hero]“幽”这家伙，嘴上说的挺狠，实际根本没把我们当敌人看……\n就是不知为什么他要夺走皇极徽章，难道那东西对他有用处？",
                    "\t[晴芸,hero3]谁知道呢，不过“皇极徽章”，光听名字就像是神器。\n我们在这里瞎猜也没用，所以，继续，冲吖~",
                    {
                        "type": "setValue",
                        "name": "flag:zzzl_2_3",
                        "value": "1"
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.hideBgFgMap(\"fg\", [\n\t[7, 9]\n]);\n}"
                    },
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    }
                ],
                "false": []
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "Ch4_2B",
            "loc": [
                8,
                12
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [175,175,175,175,175,175,  0,175,175,175,175,175,175],
    [175,653,686, 81,175,331,  0,175, 30,331,652,333,175],
    [175,685,175,  0,701,  0,  0,175,175,175,697,175,175],
    [175,657,175,331,175,175, 82,175,175, 82,  0,330,175],
    [175,331,175,  0, 81,  0,  0,175,  0, 30,175,175,175],
    [175,175,175, 21,175,  0, 81,  0,697,  0,175,331,175],
    [175,  0,  0,  0,687,  0,  0,334,  0,654,684,332,175],
    [175,689,175, 82,175, 82,175,175,175,687,175, 82,175],
    [175,652,175,332,333,332,175,  0,677, 23,684, 82,175],
    [175,331,175,175,175,175,175,120113,  0,587,  0,334,175],
    [175, 82,175,175,175,175,175,  0,653,  0,653,  0,175],
    [175,566,330,566,175,568, 84,566,  0,658,  0,566,175],
    [175,175,175,175,175,175,175,175,175,175,175,175,175]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,492,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0, 91,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,120120,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        6,
        0
    ],
    "hard1_enemy_ratio": 95,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}