main.floors.Ch4_52=
{
    "floorId": "Ch4_52",
    "title": "荒烟村-2",
    "name": "荒烟村-2",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canFlyFrom": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "sand",
    "bgm": "area17.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "10,4": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    {
                        "type": "if",
                        "condition": "(!(\"Ch4_53\" in flags.__visited__))",
                        "true": [
                            "\t[系统提示]天赋树三技能【裂地重拳】的效果可能比较难理解，这里提供一个效果示意图。\n利用这个技能的\r[yellow]牵引效果\r通过这里吧！"
                        ]
                    }
                ]
            },
            {
                "type": "drawImage",
                "image": "skill12explain.png",
                "x": 31,
                "y": 42
            },
            {
                "type": "sleep",
                "time": 500
            },
            {
                "type": "wait",
                "forceChild": true,
                "data": [
                    {
                        "case": "condition",
                        "condition": "true",
                        "action": [
                            {
                                "type": "function",
                                "function": "function(){\ncore.clearMap('uievent');\n}"
                            }
                        ]
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "0,6": {
            "floorId": "Ch4_51",
            "loc": [
                12,
                7
            ]
        },
        "11,0": {
            "floorId": "Ch4_53",
            "loc": [
                3,
                12
            ]
        }
    },
    "beforeBattle": {},
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "cannotMoveIn": {},
    "map": [
    [176,330,656, 21,757, 81,176,176,176,176,176,  0,176],
    [176,656, 82,176, 81,330,176, 21,176,331,176,  0,176],
    [176,176, 82,176,176,  0,176,334,176,330,176, 21,176],
    [176,  0,330,  0,176, 21,176,735,  0,736, 81,737,332],
    [176,730,130031,654,176,  0,176, 21,176, 81,129,  0,739],
    [176,  0,130039,  0,176,733,176,176,176,330,  0,334,  0],
    [  0,  0, 81,  0,735,  0,331,732,  0,  0,  0,179,179],
    [176,732,176,733,130031,  0,176,  0,130029,130030,736,179,654],
    [176,  0,176,  0,130039,733,176,736,652, 81,  0,733, 21],
    [176, 21,176,330, 81,  0, 21, 82,176,176,  0,179, 81],
    [176,  0,176,176,176,736,176,331, 21,176,736,179,334],
    [176,654,176,176,334,652,176,654,  0,176,331,179, 81],
    [176, 81,330,331, 81,176,176,176,732, 81, 21,179,334]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 91,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,130022,130023],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,130005,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "color": [
        0,
        0,
        0,
        0.6
    ],
    "weather": [
        "fog",
        3
    ],
    "upFloor": [
        11,
        0
    ],
    "downFloor": [
        0,
        6
    ],
    "hard1_enemy_ratio": 95
}