main.floors.Ch4_24=
{
    "floorId": "Ch4_24",
    "title": "圣洁教堂-4",
    "name": "圣洁教堂-4",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "ground6",
    "bgm": "area15.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,3": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    "Ⅱ. 智械起源\n在\r[yellow]摩宇城\r的中心 有一高等公民 名为\r[yellow]秉凌\r 是神最信任的部下\n秉凌说 自己有办法把中等公民也彻底解放\n中等公民的工作更为复杂 须有人的灵智才能完成\n让机器具有人的灵智 问题便迎刃而解\n神便允许秉凌去做 还分派一些他最信任的部下作为帮手 要他六年之内做出成果",
                    {
                        "type": "animate",
                        "name": "E_dots",
                        "loc": "hero"
                    },
                    "\t[hero]竟然，真的找到后续了。\n至尊之录的第二章，似乎变成秉凌的个人传记了。\n不过毕竟是械灵之父、格沃堡的创始人，有传记倒是不奇怪。",
                    "\t[晴芸,hero3]看来秉凌以前拥有的地位相当不一般啊。摩宇城的高等公民，也就是公民九等中最高的等级。\n而且能直接与所谓的“神”交流，这样的人就算在一等公民里面，恐怕也是凤毛麟角。",
                    "\t[hero]凌驾于一等公民之上的“神”……\n话说，这里提到的\r[yellow]摩宇城\r，你听说过吗？",
                    "\t[晴芸,hero3]当然听说过，\r[yellow]我就是从那里过来的\r。\n摩宇城是全国最大的城市，那些“神”就住在城市中心的禁地中，控制着整个国家的运转。",
                    {
                        "type": "animate",
                        "name": "E_surprise",
                        "loc": "hero"
                    },
                    "\t[晴芸,hero3]你很惊讶，为什么我之前一直没有对你提起这个？\n因为我不太想提起这件事……",
                    {
                        "type": "animate",
                        "name": "E_dots",
                        "loc": "hero"
                    },
                    "\t[晴芸,hero3]言归正传，在我看来这些“神”没什么作为，国土之外有大片的未知区域，他们却禁止任何探索行为。\n明明有充足的资源却不扩张，这在历史上是极为罕见的。直到现在，我们也不知道国土外都有什么，那极少数从国土之外的魔法界过来的人，对此也知之甚少。",
                    "\t[晴芸,hero3]摩宇城，摸鱼城，城如其名啊……",
                    {
                        "type": "animate",
                        "name": "E_sweat",
                        "loc": "hero"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:zzzl_2_1",
                        "value": "1"
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.hideBgFgMap(\"fg\", [\n\t[6, 3]\n]);\n}"
                    },
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    "\t[hero]咦，旁边还有一张纸条……",
                    "旁边的纸条写着一行小字：\n当多个\r[yellow]移形换位\r守护同一个目标时，左上方的守护者优先。"
                ],
                "false": [
                    "旁边的纸条写着一行小字：\n当多个\r[yellow]移形换位\r守护同一个目标时，左上方的守护者优先。"
                ]
            }
        ],
        "6,1": [
            {
                "type": "animate",
                "name": "E_unhappy",
                "loc": "hero"
            },
            "\t[hero]又是岔路……",
            "\t[晴芸,hero3]这还用想，肯定是哪边敌人弱往哪边走呀~\n说起来，前面的桌子上好像有什么东西……",
            {
                "type": "hide",
                "remove": true
            }
        ]
    },
    "changeFloor": {
        "6,0": {
            "floorId": "Ch4_23",
            "loc": [
                2,
                12
            ]
        },
        "0,8": {
            "floorId": "Ch4_25",
            "loc": [
                12,
                1
            ]
        },
        "12,8": {
            "floorId": "Ch4_29",
            "loc": [
                0,
                1
            ]
        },
        "6,12": {
            "floorId": "Ch4_2D",
            "loc": [
                6,
                12
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [175,175,175,175,175,175,  0,175,175,175,175,175,175],
    [175,334,333,334, 82, 21,  0, 21, 82,334,333,334,175],
    [175,175,175,175,175,  0, 22,  0,175,175,175,175,175],
    [175, 21,  0,331,674,656,120113,657,689,331,  0, 22,175],
    [175,175, 82,175,175,  0,  0,  0,175,175, 82,175,175],
    [175,  0,687,  0,175, 81,644, 81,175,334,687,334,175],
    [175,677,331,587,175,653,175,652,175,587,  0,684,175],
    [175,175,334,175,175,  0,175,  0,175,175,686,175,175],
    [  0, 21,  0, 84,332, 82,175, 81,332, 84, 21,  0,  0],
    [175,175, 82,175,175,334,644,334,175,175, 82,175,175],
    [175, 21,687,677,175,175,  0,175,175,677,687, 21,175],
    [175,654,  0, 22,656,175, 83,175,657, 22,  0,654,175],
    [175,175,175,175,175,175, 87,175,175,175,175,175,175]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,492,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0, 91,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,120120,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0, 94],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        6,
        0
    ],
    "hard1_enemy_ratio": 95,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}