main.floors.East8=
{
    "floorId": "East8",
    "title": "花月道-8",
    "name": "花月道-8",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "grass",
    "bgm": "village.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "steps": [
                "up"
            ]
        },
        "\t[hero]这里看样子是个休息站之类的地方。",
        "\t[晴芸,hero3]奇怪，现在不是比赛期间吗，怎么感觉这里的这么多智械都在摸鱼……",
        "\t[hero]先到处问问吧。"
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.values.animateSpeed = 450;\n}"
        }
    ],
    "parallelDo": "",
    "events": {
        "9,11": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    "\t[魔法老头,magician]来自魔法界的装备，能帮你在比赛中大展身手！",
                    "\t[hero]魔法界？这世上真的有魔法？",
                    "\t[魔法老头,magician]哼，你是第1188个问这个问题的家伙了。\n魔法界的天地法则与这里截然不同，才造就了辉煌的魔法文明。\n简单来讲，魔法界与这里是完全不同的两个世界。",
                    "\t[魔法老头,magician]自古以来，两个世界相互隔绝，双方的交流还是近几十年才开始有的事情。\n双方的人员到对方的世界访问之后，都出现了水土不服的情况。",
                    "\t[魔法老头,magician]比如我们这些魔法师，在你们这个世界里根本无法利用天地能量施放高等级的法术，纵使是在魔法界里能呼风唤雨的大法师，在你们这的战斗力也就比凡人稍微强一点。",
                    "\t[魔法老头,magician]于是自然就有人开始研究，在这个几乎没有魔力的世界，魔法师能够做什么。\n很快，我们就发现，虽然这片天地对魔力有一种排斥，但我们仍然可以把魔力储存在物体中。",
                    "\t[魔法老头,magician]最成功的一个分支是魔匙学，注入魔法力量的钥匙和门已经走入人们的生活，并成为支撑这次比赛的重要基础。",
                    "\t[hero]（钥匙和魔法……突然想到了某个人……）",
                    "\t[魔法老头,magician]另一个很成功的分支是装备附魔学。我这里出售的附魔装备十分受参赛者们的欢迎，现在只剩下三件了，要不要买一个试试？\n\r[yellow]只能选一件\r，多了不卖。",
                    "\t[hero]只能买一件？奇怪的规则……我看看。",
                    {
                        "type": "openShop",
                        "id": "South8Shop",
                        "open": true
                    }
                ],
                "false": [
                    "\t[魔法老头,magician]如果你在我这里买过装备了，就看不到我卖的东西了。",
                    {
                        "type": "openShop",
                        "id": "South8Shop",
                        "open": true
                    }
                ]
            }
        ],
        "9,1": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    "\t[智械参赛者,rogue]出售黄宝石，1颗500金币。",
                    "\t[hero]咦，你不是参赛者吗，怎么转行做商人了？",
                    "\t[智械参赛者,rogue]哎，因为我实力不足啊，再往前也捞不到什么好处了。\n而且前方似乎有大事要发生了。",
                    {
                        "type": "animate",
                        "name": "E_question",
                        "loc": "hero"
                    },
                    "\t[hero]什么大事？",
                    "\t[智械参赛者,rogue]我也不知道，我只是偷偷看到了许多除灵者在往前方的某个地点集结，而且全部都是高级型号！随便拎一个出来能吊打10个我的那种！",
                    "\t[hero]（是了，肯定是除灵者剿杀“幽”的行动。等他们完成任务，说不定转过头来就会对我下手……）",
                    "\t[智械参赛者,rogue]总之我这点实力肯定不会去趟那个浑水了。我收集的这些黄宝石放我手里也没用了，不如在这卖个好价钱。\n你应该知道黄宝石的作用吧？",
                    "\t[晴芸,hero3]当然知道，可以吃……唔！",
                    "\t[hero]（闭嘴！）\n不要管这个吃货，我当然知道黄宝石可以带在身上提供一点微弱而持久的增益。\n只是，就这么点作用，你卖500金币也太贵了吧？",
                    "\t[智械参赛者,rogue]哼，爱买不买，反正我闲得很，有很多时间等待好的买家，实在没人买我还可以留着作为收藏。\n指望我降价是不可能的。",
                    {
                        "type": "animate",
                        "name": "E_dots",
                        "loc": "hero"
                    }
                ],
                "false": []
            },
            {
                "type": "choices",
                "text": "\t[智械参赛者,rogue]出售黄宝石，1颗500金币。（剩余${3-flag:East8_sold_yellowGem}颗）",
                "choices": [
                    {
                        "text": "买！",
                        "need": "status:money>=500",
                        "action": [
                            {
                                "type": "playSound",
                                "name": "buy.mp3"
                            },
                            {
                                "type": "setValue",
                                "name": "status:money",
                                "operator": "-=",
                                "value": "500"
                            },
                            {
                                "type": "setValue",
                                "name": "item:yellowGem",
                                "operator": "+=",
                                "value": "1"
                            },
                            {
                                "type": "setValue",
                                "name": "flag:East8_sold_yellowGem",
                                "operator": "+=",
                                "value": "1"
                            }
                        ]
                    },
                    {
                        "text": "再想想",
                        "action": []
                    }
                ]
            },
            {
                "type": "if",
                "condition": "flag:East8_sold_yellowGem >= 3",
                "true": [
                    "\t[智械参赛者,rogue]卖完了，溜了。",
                    {
                        "type": "function",
                        "function": "function(){\ncore.hideBgFgMap(\"bg2\", [9, 2]);\n}"
                    },
                    {
                        "type": "hide",
                        "remove": true
                    },
                    {
                        "type": "animate",
                        "name": "zone",
                        "loc": "hero"
                    }
                ],
                "false": []
            }
        ],
        "1,5": [
            {
                "type": "animate",
                "name": "E_unhappy",
                "loc": [
                    1,
                    5
                ],
                "async": true
            },
            "\t[智械参赛者,rogue]\b[this,1,5]哎，这次比赛什么好处都没捞到，感觉其他参赛者都比我强，我太难了。",
            {
                "type": "animate",
                "name": "E_dots",
                "loc": "hero"
            },
            "\t[晴芸,hero3]\b[this,hero]我建议你去其他区域看看，比如西边的截浪滩，基本没什么竞争。",
            "\t[智械参赛者,rogue]\b[this,1,5]是吗，还有这种好事！\n好，我先去了！",
            {
                "type": "hide",
                "loc": [
                    [
                        1,
                        5
                    ]
                ],
                "remove": true
            },
            {
                "type": "animate",
                "name": "zone",
                "loc": [
                    1,
                    5
                ]
            },
            {
                "type": "animate",
                "name": "E_sweat",
                "loc": "hero"
            }
        ],
        "11,11": [
            {
                "type": "while",
                "condition": "true",
                "data": [
                    {
                        "type": "choices",
                        "text": "\t[魔法神像,moneyShop]你可以在这里兑换钥匙！",
                        "choices": [
                            {
                                "text": "4黄钥匙换1蓝钥匙",
                                "color": [
                                    250,
                                    247,
                                    71,
                                    1
                                ],
                                "need": "core.itemCount(\"yellowKey\") >= 4",
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "item:yellowKey",
                                        "operator": "-=",
                                        "value": "4"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "item:blueKey",
                                        "operator": "+=",
                                        "value": "1"
                                    }
                                ]
                            },
                            {
                                "text": "1蓝钥匙换3黄钥匙",
                                "color": [
                                    119,
                                    119,
                                    255,
                                    1
                                ],
                                "need": "core.itemCount(\"blueKey\") >= 1",
                                "action": [
                                    {
                                        "type": "setValue",
                                        "name": "item:blueKey",
                                        "operator": "-=",
                                        "value": "1"
                                    },
                                    {
                                        "type": "setValue",
                                        "name": "item:yellowKey",
                                        "operator": "+=",
                                        "value": "3"
                                    }
                                ]
                            },
                            {
                                "text": "不换！",
                                "color": [
                                    255,
                                    255,
                                    255,
                                    1
                                ],
                                "action": [
                                    {
                                        "type": "break",
                                        "n": 1
                                    }
                                ]
                            }
                        ]
                    }
                ]
            },
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    {
                        "type": "animate",
                        "name": "E_sweat",
                        "loc": "hero"
                    },
                    "\t[hero]\b[this,hero]这商店也太黑了吧……有什么存在的意义吗？",
                    "\t[魔法老头,magician]\b[this,9,11]这商店的主要功能其实不是换钥匙，而是为了防止某些人依靠\r[yellow]钥匙垄断\r获利。",
                    {
                        "type": "animate",
                        "name": "E_question",
                        "loc": "hero"
                    },
                    "\t[魔法老头,magician]\b[this,9,11]从成本上讲，一蓝略大于三黄。但是曾有投机商人大肆囤积蓝钥匙，导致市面上几乎没有蓝钥匙流通，使得黄蓝兑换比一度达到惊人的10比1！",
                    "\t[魔法老头,magician]\b[this,9,11]当黄蓝兑换比达到顶点时，投机者再迅速将囤积的蓝钥匙卖出。许多购买者此时还没有意识到蓝钥匙即将迅速贬值，以高价买入，被坑得血本无归。",
                    "\t[hero]\b[this,hero]？？？可是我还是没懂啊，蓝门的收益明明就只是略大于3个黄门，怎么会有人拿4个甚至10个黄钥匙换1把蓝钥匙呢？",
                    "\t[魔法老头,magician]\b[this,9,11]如果你不管走到哪，都告诉你10把黄钥匙和1把蓝钥匙之间可以互相兑换呢？",
                    {
                        "type": "animate",
                        "name": "E_dots",
                        "loc": "hero"
                    },
                    "\t[晴芸,hero3]\b[this,hero]我明白啦！\n然后那些价值达到1/10个蓝门的黄门全都被开了，这样一来，剩下的所有蓝门的收益都大于10个黄门啦！",
                    "\t[魔法老头,magician]\b[this,9,11]如果一个人有能力完全掌控某一片区域的钥匙兑换比，也就是形成该区域的\r[yellow]钥匙垄断\r，那么他可以轻而易举地利用垄断优势，不断调控钥匙兑换比，收割普通用户。",
                    "\t[魔法老头,magician]\b[this,9,11]这意味着魔法钥匙和门给人们带来的好处都被垄断者收走了。\n对于魔法钥匙和门的推广是极为不利的。",
                    "\t[魔法老头,magician]\b[this,9,11]这个商店，就是钥匙生产方制裁垄断者的手段。按照规定，任何有超过5377把钥匙流通的区域，都必须设立这样的兑换处。",
                    {
                        "type": "animate",
                        "name": "E_unhappy",
                        "loc": "hero"
                    },
                    "\t[hero]\b[this,hero]还是似懂非懂……",
                    "\t[晴芸,hero3]\b[this,hero]总之你就把它当成一个比较黑心的商店吧！不要去质疑它存在的意义就行！",
                    "\t[hero]\b[this,hero]……好吧。"
                ]
            }
        ],
        "11,6": [
            "\t[智械参赛者A,rogue]听说前面的路不太好走啊，北边的路有一堆械灵，南边的路则被除灵者设立的大阵堵住了。",
            "\t[智械参赛者B,rogue]就是啊，这除灵者平日里到处找械灵杀，现在怎么不去北边清理械灵呢，我看此事蹊跷，背后定有天大秘密。",
            "\t[智械参赛者A,rogue]这下大多数参赛者应该都没有能力继续前进了，主办方不管管吗？",
            "\t[智械参赛者B,rogue]谁知道呢。\n哎，只怪我等太弱了，连一堆低等械灵都处理不了……",
            "\t[智械参赛者A,rogue]确实，要是1188还在的话哪还用受这种气，就算寻常的高等械灵，处理起来也不在话下……",
            {
                "type": "turnBlock",
                "direction": "down",
                "loc": [
                    [
                        11,
                        6
                    ]
                ]
            }
        ],
        "11,7": [
            "\t[智械参赛者A,rogue]听说前面的路不太好走啊，北边的路有一堆械灵，南边的路则被除灵者设立的大阵堵住了。",
            "\t[智械参赛者B,rogue]就是啊，这除灵者平日里到处找械灵杀，现在怎么不去北边清理械灵呢，我看此事蹊跷，背后定有天大秘密。",
            "\t[智械参赛者A,rogue]这下大多数参赛者应该都没有能力继续前进了，主办方不管管吗？",
            "\t[智械参赛者B,rogue]谁知道呢。\n哎，只怪我等太弱了，连一堆低等械灵都处理不了……",
            "\t[智械参赛者A,rogue]确实，要是1188还在的话哪还用受这种气，就算寻常的高等械灵，处理起来也不在话下……",
            {
                "type": "turnBlock",
                "direction": "up",
                "loc": [
                    [
                        11,
                        7
                    ]
                ]
            }
        ],
        "5,1": [
            "\t[？？,N618]哎，一不小心就和同伴走散了，我太难了。"
        ],
        "3,0": [
            "\t[hero]……没必要到那边去。",
            {
                "type": "moveHero",
                "steps": [
                    "down"
                ]
            }
        ],
        "1,1": [
            "\t[智械参赛者,rogue]主办方从来没说过比赛场地里有这么多除灵者啊！\n这些除灵者现在占领要道，攻击一切路过者，我刚才亲眼看到有智械差点被击毙！\n这比赛没法进行了！"
        ]
    },
    "changeFloor": {
        "6,12": {
            "floorId": "East7",
            "loc": [
                6,
                0
            ]
        },
        "12,4": {
            "floorId": "East9",
            "loc": [
                0,
                6
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [50031,50031,50031,  0,50031,50031,50031,50031,50031,50031,50031,50031,50031],
    [50031,393,  0,  0,  0,618,50031, 33,50031,393,50031, 33,50031],
    [50031,  0,  0,  0,  0,  0,50031, 33,50031,  0,50031, 33,50031],
    [50031,  0,  0,  0,  0,  0,50031, 81,50031,  0,50031, 81,50031],
    [50031,  0,  0,  0,  0,  0,30029,  0,  0,  0,  0,  0, 94],
    [50031,396,  0,  0,  0,  0,30035,  0,  0,  0,  0,  0,50031],
    [50031,50031,50031,50031,50031,  0,  0,  0,  0,  0,  0,393,50031],
    [50031,332, 82,332, 82,  0,  0,  0,  0,  0,  0,398,50031],
    [50031,50031,50031,50031,50031,  0,  0,  0,  0,  0,  0,  0,50031],
    [50031,331,50031,331,50031,  0,  0,  0,  0,  0,  0,  0,50031],
    [50031,332, 84,332, 84,  0,  0,  0,50031,  0,  0,  0,50031],
    [50031,334,50031,334,50031,  0,  0,  0,50031,140,  7,131,  8],
    [50031,50031,50031,50031,50031,50031, 93,50031,50031,50031,50031,50031,50031]
],
    "bgmap": [
    [  0,  0,  0,147,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50023,147,50023,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,50001,  0,147,  0,  0,  0,  0,  0,147,  0,  0,  0],
    [  0,  0,  0,147,147,147,  0,  0,  0,147,  0,  0,  0],
    [  0,50006,  0,  0,  0,147,  0,  0,147,147,147,147,147],
    [  0,  0,  0,  0,  0,147,  0,  0,147,50001,  0,  0,  0],
    [  0,  0,  0,  0,  0,147,147,  0,147,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,147,147,147,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,50001,147,  0,  0,  0,50002,  0,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,147,147,147,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,147,147,147,  0],
    [  0,  0,  0,  0,  0,50006,147,50006,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,495,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,492,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        6,
        6
    ],
    "hard1_enemy_ratio": 80,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true,
    "weather": [
        "sun",
        5
    ]
}