main.floors.MT23=
{
    "floorId": "MT23",
    "title": "主塔 23 层",
    "name": "孤狼战场-23",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "area5.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 10,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,1": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142, 88,142, 27, 21,  0, 81, 32,226, 21,142, 32,142],
    [142,  0,142,334, 31,375,142,  0,142, 32,142, 22,142],
    [142, 31,142,142,142,142,142,225,142,142,142,227,142],
    [142,  0,225, 28,  0,226,  0, 21,142,  0,225,  0,142],
    [142,225,142,142, 81,142,142,354,142, 32,142,376,142],
    [142, 32,142, 21,  0, 28,142,  0, 81,  0,142,142,142],
    [142, 82,142,  0, 22,  0,380, 31,142, 31,142, 27,142],
    [142,226, 32,379,  0, 32,142,  0,379,  0,379,  0,142],
    [142, 27,142,142, 81,142,142,226,142,142,142, 81,142],
    [142, 31, 81,354, 21,375, 81,  0,142, 32,375,  0,142],
    [142, 87,142, 31, 21, 27,142, 32,142, 31, 28, 31,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "area5.mp3",
    "hard1_enemy_ratio": 75,
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}