main.floors.MT25=
{
    "floorId": "MT25",
    "title": "主塔 25 层",
    "name": "孤狼战场-25",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "area5.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 10,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "11,11": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,11": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142, 81, 81,334,232,334,142, 21,225, 28, 81, 34,142],
    [142, 34,142,  0, 21,  0,142,  0,142,142, 81,142,142],
    [142, 28,142, 32,380, 32,142,379,142, 21, 32, 27,142],
    [142,225,142,142, 81,142,142, 31, 81,379,226, 32,142],
    [142,  0, 31,379,  0, 27,225,  0,142,  0,225, 21,142],
    [142, 32,142,142,142,142,142, 27,142,142, 81,142,142],
    [142,  0, 31,354,  0, 29,226,  0,142, 21,  0, 34,142],
    [142,225,142,142, 82,142,142, 31, 81,  0, 28,  0,142],
    [142, 27,142,227, 21,375,142,225,142,375,  0, 29,142],
    [142,  0,142, 34,369, 34, 81, 32,142,142, 81,142,142],
    [142, 87,142, 27,334, 28,142, 21,225, 22,  0, 88,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "area5.mp3",
    "hard1_enemy_ratio": 75,
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}