main.floors.MT28=
{
    "floorId": "MT28",
    "title": "主塔 28 层",
    "name": "孤狼战场-28",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "area5.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 10,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,5": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "9,6": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142,370, 33,142,  0,381, 32,382, 22,381, 32,382,142],
    [142, 81,142,142, 21,142,142,142,142,142,142, 29,142],
    [142, 34,381, 81,  0,142, 28,226, 34,369, 81,  0,142],
    [142,142,142,142,376,142,142,168,142,142,142,278,142],
    [142, 88,  0, 21,  0,142,226,377,227, 28,142, 21,142],
    [142,  0, 27,142,168,142, 34,232,369, 87,142,  0,142],
    [142, 22,142,142, 81,142,142,142,142,142,142, 27,142],
    [142,  0,168,355, 34,  0, 21,227,  0,  0,232,  0,142],
    [142,142,142, 82,142,142,378,142,142,142,142, 82,142],
    [142, 27,142,  0,376,142, 27,142,226,274,226,  0,142],
    [142,381, 81, 28,  0, 34, 83, 34,  0, 27,  0, 28,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "area5.mp3",
    "hard1_enemy_ratio": 75,
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}