main.floors.MT29=
{
    "floorId": "MT29",
    "title": "主塔 29 层",
    "name": "孤狼战场-29",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "area5.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 10,
    "defaultGround": "ground",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "9,6": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [142,142,142,142,142,142,142,142,142,142,142,142,142],
    [142, 87,227,142, 27,355, 81,  0, 34,142, 27,227,142],
    [142,232,378, 81, 34,227,142, 28,381,142, 34,355,142],
    [142,142,142,  0,142,142,142,142, 81,142,142, 81,142],
    [142, 34,142, 28,  0,355,  0,142,  0,  0,370,  0,142],
    [142,227,142,142,142,142, 34,142, 21,142,142, 28,142],
    [142, 81,227, 27,270, 82,  0,382,  0, 88,142,  0,142],
    [142,232,142,142,142,142, 21,142, 33,142,142, 34,142],
    [142, 34,142, 27,  0,278,  0, 82,  0,  0,381,  0,142],
    [142,142,142,355,142,142,142,142, 27,  0,142,142,142],
    [142, 27,142,  0,370,  0, 29,142,142,355,142, 34,142],
    [142,278, 81, 32,142, 21,  0, 81, 34,  0,278, 29,142],
    [142,142,142,142,142,142,142,142,142,142,142,142,142]
],
    "bgmap": [

],
    "fgmap": [

],
    "bgm": "area5.mp3",
    "hard1_enemy_ratio": 75,
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}