main.floors.MT36=
{
    "floorId": "MT36",
    "title": "主塔 36 层",
    "name": "圣殿入口-36",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [],
    "ratio": 10,
    "defaultGround": "ground3",
    "bgm": null,
    "firstArrive": [
        {
            "type": "loadBgm",
            "name": "area6.mp3"
        },
        {
            "type": "setValue",
            "name": "flag:mdef_ratio",
            "value": "1"
        },
        {
            "type": "function",
            "function": "function(){\ncore.plugin.removeMaps(\"MT21\", \"MT35\");\n}"
        }
    ],
    "eachArrive": [
        {
            "type": "pauseBgm"
        }
    ],
    "parallelDo": "",
    "events": {
        "6,5": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    "\t[七彩侍卫,N407]尊敬的二位小姐，欢迎来到\r[yellow]辉煌圣殿\r。",
                    "\t[七彩侍卫,N407]二位初来乍到，对这里不太了解，容我稍作介绍。",
                    "\t[七彩侍卫,N407]辉煌圣殿是\r[red]那位大人\r为我们创造的乌托邦(utopia)。在这里，一切物资充足，智械和人类和平共处，一起尽享天伦之乐。",
                    "\t[hero]（\r[red]那位大人\r……是2221吗……\n创造了一个乌托邦？怎么和设想的不太一样……）",
                    "\t[七彩侍卫,N407]二位虽然是从底层上来的，不过既然你们来到了这里，就是我们的一员，我很乐意服侍二位。",
                    "\t[芳芷,hero2]那么，你能提供什么服务呢？",
                    "\t[七彩侍卫,N407]在下不才，提供的服务名为“忒修斯之抚”，拥有这样能力的侍卫，放眼整个辉煌圣殿也勉强能算是凤毛麟角吧。",
                    {
                        "type": "animate",
                        "name": "E_unhappy",
                        "loc": "hero"
                    },
                    "\t[七彩侍卫,N407]具体来讲，就是用高级金属为客户打造新的身躯。\n这位绿头发的小姐倒还好点，但是这位蓝头发的小姐……不仅身上的金属品质一般，而且还带有一股粗犷之气，和您秀气的外表可是十分的不相称啊。",
                    {
                        "type": "animate",
                        "name": "E_sweat",
                        "loc": "hero"
                    },
                    "\t[hero]（小声）果然我身躯的材质不如绿姐姐的吗……",
                    "\t[芳芷,hero2]要怪就怪你的创造者吧，往好了想，他好歹还算是草草收尾，而不是半途而废……",
                    "\t[七彩侍卫,N407]不用担心，您的新身躯的打造就交给我吧，我保证能让您获得脱胎换骨般的变化。"
                ]
            },
            {
                "type": "if",
                "condition": "(!flag:36FShop_finish)",
                "true": [
                    {
                        "type": "openShop",
                        "id": "36FShop",
                        "open": true
                    }
                ],
                "false": [
                    "\t[七彩侍卫,N407]恭喜您，已经完成了脱胎换骨，想必您已经完全融入这个集体了吧？",
                    "\t[hero]啊这……是啊，谢谢你。",
                    "\t[七彩侍卫,N407]不用客气，十分感谢您对我的支持。"
                ]
            }
        ]
    },
    "changeFloor": {
        "6,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [143,143,143,143,143,143,143,143,143,143,143,143,143],
    [143,332, 81, 81, 22,143, 87,143, 22, 81, 81,332,143],
    [143,143, 81,143,143,143, 83,143,143,143, 81,143,143],
    [143, 53, 53, 53, 84,  0,  0,  0, 84, 53, 53, 53,143],
    [143,143,143,143,143, 24,  0, 24,143,143,143,143,143],
    [143,330, 81,330,143,  0,407,  0,143,330, 81,330,143],
    [143, 81,143, 81,143, 24,  0, 24,143, 81,143, 81,143],
    [143,331,143,330, 81,  0,  0,  0, 81,330,143,331,143],
    [143,143,143,143,143,322,  0,323,143,143,143,143,143],
    [143, 21,143,322,143,  0, 68,  0,143,322,143, 21,143],
    [143, 21, 82,323, 84,323,  0,322, 84,323, 82, 21,143],
    [143, 21,143, 68,143,  0,  0,  0,143, 68,143, 21,143],
    [143,143,143,143,143,143,143,143,143,143,143,143,143]
],
    "bgmap": [

],
    "fgmap": [

],
    "hard1_enemy_ratio": 75,
    "bg2map": [

],
    "fg2map": [

]
}