main.floors.MT37=
{
    "floorId": "MT37",
    "title": "主塔 37 层",
    "name": "辉煌圣殿-37",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "area6.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 10,
    "defaultGround": "ground3",
    "bgm": "area6.mp3",
    "firstArrive": [
        {
            "type": "moveHero",
            "time": 300,
            "steps": [
                "down"
            ]
        },
        "\t[hero]这就是辉煌圣殿吗……周围全是前所未有的强敌……",
        "\t[芳芷,hero2]距离我上次来这里才过去几个月，想不到这里已经被改造成这个样子了……完全看不出以前的一点痕迹了。",
        {
            "type": "changePos",
            "direction": "up"
        },
        "\t[hero]其实刚才我就想问了，你之前说2221背叛了人类，可是刚才那个侍卫又说2221一手打造了这里……它的目的是什么？",
        "\t[芳芷,hero2]是不是觉得2221的行为很奇怪？",
        {
            "type": "animate",
            "name": "E_dots",
            "loc": "hero"
        },
        "\t[芳芷,hero2]其实我也觉得很奇怪。没有人能猜透2221现在的想法。",
        "\t[hero]看来只有找到它当面问个清楚了。不过，我真的能走到那一步吗？……\n现在光是周围这些侍卫就让我感到压力很大了。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[芳芷,hero2]你的学习速度和潜力都不可估量。\n现在你主要还是吃亏在某些外部缺陷上，比如刚才那个七彩侍卫提到的身躯材料，还有你的武器……而这类缺陷很容易弥补。",
        "\t[芳芷,hero2]我相信距离你登上塔顶的日子已经不远了。和之前一样，我把一些提示信息给你，希望能有帮助。",
        "\t[系统提示]绿姐姐的提示已更新！",
        {
            "type": "setValue",
            "name": "flag:current_area",
            "value": "6"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,3": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    "\t[服务员,blueTrader]欢迎光临，二位小姐想买点什么？",
                    "\t[服务员,blueTrader]我这里的花样不多，只有4种饮料，但每一款都是按照传说中源自精灵大陆的秘方特别调制的，绝对不可错过啊！",
                    "\t[hero]精灵大陆？",
                    "\t[服务员,blueTrader]二位没听说过？其实我也是前不久才听说的，据说那个大陆景色十分优美，奇珍异兽数不胜数，居民们擅长刀剑搏斗之术。虽然也有弓箭，但因为箭矢造价高昂，而被喜好节俭的居民们所不齿。",
                    {
                        "type": "animate",
                        "name": "E_dots",
                        "loc": "hero"
                    },
                    "\t[服务员,blueTrader]这些饮料也是，原本是专门为那边的冒险者制作的，但是据说销量很惨淡……",
                    "\t[芳芷,hero2]喂，你这人卖东西怎么自己拆自己的台啊，销量惨淡的话你也能说得出来……",
                    "\t[服务员,blueTrader]我是服务员，不是推销员。作为服务员是一定要实话实说的。",
                    "\t[芳芷,hero2]……好吧。（服务员有这条规矩吗？）",
                    "\t[服务员,blueTrader]我对这些饮料信心十足，它们的质量绝对是上乘，在精灵大陆销量惨淡的原因，一定是因为——\n那边的人太穷了，买不起。",
                    {
                        "type": "animate",
                        "name": "E_sweat",
                        "loc": "hero"
                    },
                    "\t[hero]是这样吗……",
                    {
                        "type": "openShop",
                        "id": "37FShop",
                        "open": true
                    },
                    "\t[hero]这个万能药水这么贵？？？",
                    "\t[服务员,blueTrader]那当然，这可是最为高档的解药，瞬间解除任何异常状态，堪称神药，我可是掉了九九八十一根头发，才终于学会了调制方法！",
                    {
                        "type": "animate",
                        "name": "E_sweat",
                        "loc": "hero"
                    },
                    "\t[服务员,blueTrader]这种药在精灵大陆甚至是有价无市的存在，你在那里根本买不到这种东西。\n要不要买一个，买不了吃亏，买不了上当。而且本店所有商品都可以全额退款！",
                    {
                        "type": "animate",
                        "name": "E_unhappy",
                        "loc": "hero"
                    },
                    "\t[hero]……我现在手头有点缺钱，还是免了。",
                    {
                        "type": "exit"
                    }
                ]
            },
            {
                "type": "openShop",
                "id": "37FShop",
                "open": true
            }
        ],
        "6,10": {
            "trigger": "action",
            "enable": true,
            "noPass": null,
            "displayDamage": true,
            "data": [
                "\t[舒爽侍卫,blueMS]二位小姐，请问我有什么可以帮您的吗？",
                "\t[hero]您让一下路就行，我们想到楼上走走。",
                "\t[舒爽侍卫,blueMS]很抱歉，这个不行。",
                {
                    "type": "battle",
                    "loc": [
                        6,
                        10
                    ]
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[hero]哎，总归还是得靠战斗开路。"
            ]
        }
    },
    "changeFloor": {
        "6,11": {
            "floorId": ":next",
            "stair": "downFloor"
        },
        "6,1": {
            "floorId": ":before",
            "stair": "upFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [143,143,143,143,143,143,143,143,143,143,143,143,143],
    [143, 21, 21,276, 81,322, 88,323,143,330, 22,258,143],
    [143,143,143,143,143,  0,  0,  0,143,143,143, 81,143],
    [143,247, 21, 21,143, 21,138, 21,257,  0, 22,  0,143],
    [143, 81,143,143,143,252,143,143,143, 83,143,143,143],
    [143,  0,247,  0,258,  0,143, 22,330, 68,330, 53,143],
    [143,322,143,330,143,  0,143,322,323,214,323,322,143],
    [143,258,143, 81,143,  0,143,143,143, 81,143,143,143],
    [143,  0,330,  0,247,  0, 21,  0,259,  0,322,  0,143],
    [143,257,143, 81,143,143, 82,143,143, 82,143,143,143],
    [143,  0,323, 81,143, 22,246, 22,143,213,  0,331,143],
    [143,330,  0, 21,143,330, 87,330,143, 21,322, 22,143],
    [143,143,143,143,143,143,143,143,143,143,143,143,143]
],
    "bgmap": [

],
    "fgmap": [

],
    "hard1_enemy_ratio": 75,
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}