main.floors.MT43=
{
    "floorId": "MT43",
    "title": "主塔 43 层",
    "name": "辉煌圣殿-43",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "area6.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 10,
    "defaultGround": "ground3",
    "bgm": "area6.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "1,7": {
            "floorId": ":before",
            "stair": "upFloor"
        },
        "8,4": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [143,143,143,143,143,143,143,143,143,143,143,143,143],
    [143, 21,323,330,143,330,  0, 21,143, 21,  0,330,143],
    [143, 21,  0,273,143,279,322, 21,143, 21,323,279,143],
    [143,143,143, 81,143, 81,143,143,143,143,143, 81,143],
    [143,258, 81,322,143,  0,330,  0, 87,  0,322,  0,143],
    [143,322,143,228,143,  0,  0,143,143,279,143, 21,143],
    [143,143,143, 81,143,  0,252,  0, 21,  0,213,  0,143],
    [143, 88,  0,330,143,143, 81,143,143,143,143, 81,143],
    [143,  0,323,  0,  0,279, 68,143, 22,322,143,245,143],
    [143, 81,143,213,143,143, 81,143,279, 22,143,330,143],
    [143,  0,258,  0,143,323,228,143, 82,143,143,  0,143],
    [143, 21,322, 21,143, 21,330,143,  0,331,366,  0,143],
    [143,143,143,143,143,143,143,143,143,143,143,143,143]
],
    "bgmap": [

],
    "fgmap": [

],
    "hard1_enemy_ratio": 75,
    "bg2map": [

],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}