main.floors.MT63=
{
    "floorId": "MT63",
    "title": "主塔 63 层",
    "name": "未来走廊-63",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": true,
    "cannotViewMap": false,
    "images": [
        {
            "name": "area7_2.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 10,
    "defaultGround": "ground7",
    "bgm": "area7.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]敌人又强了一个档次……天空也暗了下来，\n似乎感觉距离登上塔顶不远了。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "MT62",
            "stair": "upFloor"
        },
        "1,1": {
            "floorId": ":next",
            "stair": "downFloor"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [144,144,144,144,144,144,144,144,144,144,144,144,144],
    [144, 87,  0, 81,  0,331,  0,331,  0,144,331,324,144],
    [144,144, 82,144,451,144, 81,144,455,144,144,449,144],
    [144,325,  0,331,  0,144,459,144,  0,333,  0,334,144],
    [144,144, 81,144,144,144,455,144,144,144, 81,144,144],
    [144,326,  0,144,324,331,458,331,325,144,454,325,144],
    [144, 81,458,144,144,144, 82,144,144,144,449,331,144],
    [144,332,  0,347,  0,331,  0,331,  0,347, 81,144,144],
    [144,144,144,144, 81,144,458,144,345,144,458, 21,144],
    [144,331,  0,144,345,144,  0,144,  0,144,331,324,144],
    [144, 22,324,144, 21,144,331,144,331,144,144, 81,144],
    [144,331,519, 81,334,144,  0,144,  0,455,332,  0,144],
    [144,144,144,144,144,144, 88,144,144,144,144,144,144]
],
    "bgmap": [

],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "hard1_enemy_ratio": 75,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}