main.floors.MT70_2=
{
    "floorId": "MT70_2",
    "title": "数据中心",
    "name": "数据中心",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "images": [
        {
            "name": "area7_2.jpg",
            "canvas": "bg",
            "x": 0,
            "y": 0
        }
    ],
    "ratio": 10,
    "defaultGround": "ground8",
    "bgm": "area7.mp3",
    "firstArrive": [],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "6,3": [
            {
                "type": "if",
                "condition": "(!switch:A)",
                "true": [
                    {
                        "type": "setValue",
                        "name": "switch:A",
                        "value": "1"
                    },
                    {
                        "type": "animate",
                        "name": "E_surprise",
                        "loc": "hero",
                        "async": true
                    },
                    "\t[hero]这是……一个庞大的资料库。",
                    "\t[hero]结果，还是没找到真正的2221，没找到回去的办法，没见到我的创造者，也没有找到离开这座塔的线索……什么都没找到。",
                    "\t[hero]不过，既然这里是个资料库，也许有一些相关的信息……",
                    "\t[hero]刚才那个家伙，说我如果能悟出更深层次的“道”，也能突破这里。\n原来如此，它的意思是这样……",
                    "9922就这样随着未来走廊漂浮在太空之中，无法离开，也无法联络上外界。\n走廊源源不断地汲取着太空中散逸的能量，这使得它能一直维持自身和其中机械的运转——包括9922。",
                    "资料库的庞大超乎想象，其中几乎记录了人类历史上被记录下来的所有东西，这对于9922这样的通用学习机器人而言，是一个巨大的宝库。",
                    "也许有一天，9922能在自我学习中突破自己的“道”。\n又或者某一天，未来走廊会到达其旅途的终点——如果它存在的话。",
                    "走出这个困境，解开创造者的谜团，乃至找到2221的那一天，会到来吗？",
                    "……",
                    {
                        "type": "sleep",
                        "time": 500
                    },
                    "9922，第二章结束。",
                    "\t[系统提示]进入游戏后连续撞击主角上方的机关门，即可直接进入第三章。"
                ]
            },
            {
                "type": "choices",
                "text": "\t[系统提示]第二章结束，可以在这里提交成绩。",
                "choices": [
                    {
                        "text": "进入第三章",
                        "color": [
                            255,
                            203,
                            0,
                            1
                        ],
                        "action": [
                            {
                                "type": "insert",
                                "name": "第二章结束"
                            }
                        ]
                    },
                    {
                        "text": "提交成绩",
                        "action": [
                            {
                                "type": "if",
                                "condition": "(core.itemCount(\"greenKey\") == 14)",
                                "true": [
                                    {
                                        "type": "win",
                                        "reason": "Chap.2-迈向未来"
                                    }
                                ],
                                "false": [
                                    {
                                        "type": "win",
                                        "reason": "Chap.2-奋起直追"
                                    }
                                ]
                            }
                        ]
                    },
                    {
                        "text": "我再想想",
                        "action": []
                    }
                ]
            }
        ]
    },
    "changeFloor": {
        "6,6": {
            "floorId": "MT70"
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 17,30027,  0,  0,30025,  0,30033,  0,30025,  0,  0,30027, 17],
    [ 17,  0,  0,  0,30031,  0,  0,  0,30031,  0,  0,  0, 17],
    [ 17,30006,30007,  0,  0,  0,30023,  0,  0,  0,30002,30003, 17],
    [ 17,30012,30013,  0,  0,  0, 91,  0,  0,  0,30008,30009, 17],
    [ 17,30018,30019,  0,  0,  0,  0,  0,  0,  0,30018,30019, 17],
    [ 17,30033,  0,  0,30026,  0, 89,  0,30026,  0,  0,30033, 17],
    [ 17,  0,  0,  0,30032,  0,  0,  0,30032,  0,  0,  0, 17],
    [ 17,30014,30015,  0,  0,  0,30022,  0,  0,  0,30004,30005, 17],
    [ 17,30020,30021,  0,  0,  0,30028,  0,  0,  0,30010,30011, 17],
    [ 17,30018,30019,  0,30024,  0,  0,  0,30024,  0,30018,30019, 17],
    [ 17,30027,  0,  0,30030,  0,30033,  0,30030,  0,  0,30027, 17],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "bgmap": [

],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,30000,30001,  0,  0,  0,  0,  0,  0,  0,30000,30001,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,30000,30001,  0,  0,  0,  0,  0,  0,  0,30000,30001,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,318,318,318,318,318,318,318,318,318,318,318,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "flyPoint": [
        6,
        6
    ],
    "hard1_enemy_ratio": 75,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}