main.floors.North6=
{
    "floorId": "North6",
    "title": "裕麓山-6",
    "name": "裕麓山-6",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "grass",
    "bgm": "area11.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 800
        },
        {
            "type": "if",
            "condition": "core.getFlag(\"East8_sold_yellowGem\", 0) < 3",
            "true": [
                "\t[hero]这附近的黄宝石好像不多……想要解锁这神秘徽章最后一级的能力，\r[yellow]必须要在花月道那里买黄宝石\r了。"
            ],
            "false": [
                "\t[hero]黄宝石……加上之前在花月道买的，足够解锁这神秘徽章最后一级的能力了。"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]黄宝石到底是什么？它们好像总是出现在械灵附近，似乎和械灵有什么关联。",
        "\t[芳芷,hero2]你真当我什么都懂啦，哼。",
        {
            "type": "animate",
            "name": "E_sweat",
            "loc": "hero"
        },
        "\t[芳芷,hero2]可以肯定的是，黄宝石和械灵紧密相关。\n你相信灵魂的存在吗？有思想的物体都有一个灵魂吗？",
        "\t[hero]……我不知道，姑且算相信吧。",
        "\t[芳芷,hero2]有一种猜想是，生物变成械灵的过程，本质上是植入的机械芯片的灵魂取代原生灵魂的过程。\n被驱赶而出的原生灵魂形成了黄宝石。",
        "\t[芳芷,hero2]这是我听过最靠谱的猜想了，唯一不完善的地方是对“灵魂”的定义。\n“灵魂”到底是什么，至今没有人说得清。",
        "\t[hero]……好吧。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "0,12": [
            "\t[系统提示]你可以隔着竖着的悬崖放魔力莱姆或推动敌人。\n别问为什么，问就是feature。"
        ]
    },
    "changeFloor": {
        "0,11": {
            "floorId": "North4",
            "loc": [
                12,
                3
            ]
        },
        "1,0": {
            "floorId": "North7",
            "loc": [
                8,
                12
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [  0, 91,  0,325,  0, 17, 17, 17, 17, 17, 17, 17, 17],
    [ 30,  0, 21,  0,  0,  0,  0,  0,534,  0, 21,  0,555],
    [ 17,  0, 17, 17, 17, 17, 17, 17, 82,50012,  0,80049,  0],
    [ 17,  0, 17, 17, 17, 17, 17, 17,  0,325,545,  0,330],
    [ 17,  0, 17, 17, 17, 17, 17, 17,331,  0, 81,  0, 20],
    [ 17,  0, 17, 17, 17,330,324,334, 17, 17, 17,  0, 17],
    [ 17,  0, 17, 17, 17,  0, 21,325, 17, 17, 17,  0, 17],
    [ 17,  0, 17, 17, 17,545,  0,330, 17, 17, 17,556, 17],
    [ 17,534, 17, 17, 17,543,326,  0,547,  0,547,  0,  0],
    [30029, 82,  0,330,  0,334,  0,330,50007,  0, 81,324,330],
    [30035,  0,551,  0,  0,  0, 17, 17, 17,  0, 17, 17, 17],
    [ 92,  0,80013,80014,324, 82, 17, 17, 17,555, 17, 17, 17],
    [129, 20,331, 81,  0,534,  0,  0,  0,  0,  0,  0, 22]
],
    "hard1_enemy_ratio": 80,
    "bgmap": [
    [  0,  0,  0,  0,  0,80072,80073,80073,80073,80073,80073,80073,80073],
    [  0,  0,  0,  0,50001,  0,  0,  0,  0,  0,  0,  0,  0],
    [80057,80108,80057,80057,80057,80057,80057,80057,80051,  0,  0,  0,  0],
    [80065,80116,80065,80065,80066,80065,80065,80065,80048,  0,  0,  0,  0],
    [80065,80116,80060,80065,80066,80073,80073,80073,80048,  0,  0,  0,  0],
    [80065,80116,80065,80065,80066,  0,  0,  0,80056,80057,80057,80108,80057],
    [80065,80116,80065,80065,80066,  0,  0,  0,80064,80065,80065,80116,80065],
    [80065,80116,80060,80065,80066,  0,80040,80041,80072,80073,80073,80116,80073],
    [80073,80116,80073,80073,80074,  0,80048,  0,  0,50001,  0,80124,  0],
    [  0,80124,50001,  0,  0,  0,80048,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,80056,80057,80057,80108,80057,80057,80057],
    [  0,  0,  0,  0,  0,  0,80072,80065,80065,80116,80073,80073,80073],
    [  0,  0,  0,  0,  0,  0,  0,50002,  0,80124,  0,  0,  0]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "flyPoint": [
        0,
        11
    ],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}