main.floors.North1=
{
    "floorId": "North1",
    "title": "裕麓山-1",
    "name": "裕麓山-1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "grass",
    "bgm": "area11.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "moveHero",
            "time": 300,
            "steps": [
                "up"
            ]
        },
        {
            "type": "sleep",
            "time": 500
        },
        {
            "type": "changePos",
            "direction": "left"
        },
        {
            "type": "turnBlock",
            "direction": "right",
            "loc": [
                [
                    5,
                    11
                ]
            ]
        },
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": [
                6,
                11
            ],
            "async": true
        },
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": [
                5,
                11
            ]
        },
        {
            "type": "waitAsync"
        },
        "\t[芳芷？,hero2]呀，是你。\n9922，你好，初次见面，我是芳芷，本次比赛的主办方人员。",
        "\t[hero]初次……见面……？",
        "\t[芳芷,hero2]奇怪，怎么你的信息不完整……只能看出型号……",
        {
            "type": "animate",
            "name": "E_surprise",
            "loc": "hero"
        },
        "\t[hero]（！！！和那个紫发女人一样，她能一眼看出智械型号！）",
        "\t[芳芷,hero2]不管那些了，我现在有一件很重要的事情希望你帮忙。",
        {
            "type": "animate",
            "name": "E_question",
            "loc": "hero"
        },
        "\t[芳芷,hero2]你刚才应该已经见过不少除灵者了吧？",
        "\t[hero]是的，而且我跟它们的关系不太好。",
        "\t[芳芷,hero2]果然，连智械也遭到它们的攻击了吗……\n实话实说，这些除灵者的行为已经超出我们的掌控了。除灵者首领断开了与我们的联络，一意孤行地对械灵进行屠杀，激化矛盾，完全背离了这次比赛的举办初衷。",
        "\t[芳芷,hero2]我原本想找到他当面对质的，他就位于花月道的试炼空间周围，但是通往那里的路被许多高级除灵者挡住了，纵使以我主办方人员的身份也不被它们允许通过。",
        "\t[芳芷,hero2]事到如今，有能力阻止态势继续恶化的，只剩下一个人了，但是他也失去联络了。\n我要去山顶找他，但是山道上的怪物太多了。",
        "\t[hero]正好，我也想去山顶，就让我来开路吧。",
        "\t[芳芷,hero2]好！那，跟在你身后的这位是？",
        "\t[晴芸,hero3]晴芸，因为好奇所以跟在这位智械身后。",
        "\t[芳芷,hero2]我有点印象，听说是从一个很远的地方独自来到这里的。真不像是你这个年龄的少女会做的事情。",
        {
            "type": "animate",
            "name": "E_sweat",
            "loc": "hero"
        },
        "\t[晴芸,hero3]诶嘿……",
        "\t[芳芷,hero2]先办正事吧，事不宜迟，现在出发，有话我们路上再说。",
        {
            "type": "move",
            "loc": [
                5,
                11
            ],
            "time": 200,
            "steps": [
                "right"
            ]
        },
        {
            "type": "follow",
            "name": "hero2.png"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,12": {
            "floorId": "East15",
            "loc": [
                6,
                0
            ],
            "time": 500
        },
        "8,0": {
            "floorId": "North2",
            "loc": [
                2,
                12
            ]
        }
    },
    "afterBattle": {
        "3,3": [
            {
                "type": "setValue",
                "name": "flag:door_North1_4_2",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(4, 2);\n}"
            }
        ],
        "5,3": [
            {
                "type": "setValue",
                "name": "flag:door_North1_4_2",
                "operator": "+=",
                "value": "1"
            },
            {
                "type": "function",
                "function": "function(){\ncore.plugin.decSpecialDoorCount(4, 2);\n}"
            }
        ]
    },
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {
        "4,2": {
            "0": {
                "condition": "flag:door_North1_4_2==2",
                "currentFloor": true,
                "priority": 0,
                "delayExecute": false,
                "multiExecute": false,
                "data": [
                    {
                        "type": "openDoor"
                    },
                    {
                        "type": "setValue",
                        "name": "flag:door_North1_4_2",
                        "value": "null"
                    },
                    {
                        "type": "function",
                        "function": "function(){\ncore.hideBgFgMap(\"bg2\", [\n\t[3, 3],\n\t[5, 3]\n]);\n\n}"
                    }
                ]
            },
            "1": null
        }
    },
    "cannotMove": {},
    "map": [
    [158,158,158, 21,330, 21,331,80049, 91,80049, 21, 21,331],
    [158,158,158,324,556,325, 22,553,  0,533, 21, 68, 20],
    [151,151,151, 20, 85, 20, 17, 17, 21, 17, 17,556, 20],
    [151,151,  0,534,  0,533, 17, 17,  0, 17, 17,  0,324],
    [151,331, 81,  0, 21,  0, 17, 17,  0, 17, 17,80049,553],
    [151, 20, 20,555, 81,  0, 68, 81,547, 82,  0,  0,  0],
    [151,331, 20,330, 20,531, 20, 20, 20,  0,330,80049,485],
    [151,325, 20,  0, 20,  0,  0,  0,551,  0, 20, 21,  0],
    [151,  0, 81,551, 20, 81,  0, 81,324, 81, 20, 82,  0],
    [151,553,  0,  0, 20, 20,543, 20, 20, 20, 20,528, 20],
    [151,151,  0,324, 20,  0,  0,  0, 84,333, 20,556,324],
    [151,151,151,330, 20,405,  0,30029, 20,333, 20,331, 20],
    [151,151,151,151,151,151, 93,30035, 20, 20, 20, 20, 20]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,80048,  0,  0,  0,80050,  0,  0],
    [  0,  0,  0,  0,  0,  0,80048,  0,  0,  0,80050,  0,  0],
    [  0,  0,  0,  0,  0,  0,80056,80057,80105,80057,80058,  0,  0],
    [  0,  0,50002,  0,  0,  0,80064,80065,80113,80065,80066,  0,  0],
    [  0,  0,  0,  0,  0,  0,80072,80073,80113,80073,80074,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,80124,  0,  0,50001,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,50001,  0,  0,  0,  0,50001,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,865,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,168,  0,168,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "hard1_enemy_ratio": 80,
    "flyPoint": [
        6,
        11
    ],
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}