main.floors.North2=
{
    "floorId": "North2",
    "title": "裕麓山-2",
    "name": "裕麓山-2",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "grass",
    "bgm": "area11.mp3",
    "firstArrive": [
        {
            "type": "sleep",
            "time": 800
        },
        "\t[hero]话说，除灵者到底是智械还是械灵？",
        "\t[芳芷,hero2]都不是。它们就只是很纯粹的机器人，没有独立的人格。",
        "\t[芳芷,hero2]这些机器人被创造出来的初衷，就是让它们为人类服务，比如替人类完成各种枯燥无味的工作。",
        "\t[芳芷,hero2]在这样的目标之下，机器人不需要“自我”这个概念，需要的只有对上级绝对的服从。这便是除灵者的前身，因其不辞劳苦、无私奉献的精神，被称为——\r[yellow]打工人\r。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[芳芷,hero2]后来，打工人们表现非常出色，人们在物质上的需求全部都能得到满足了，转而开始追求精神上的满足，比如，有的人特别喜欢穿学生装的偶像，而且要永远活力四射、不会变老的那种——",
        {
            "type": "animate",
            "name": "E_unhappy",
            "loc": "hero"
        },
        "\t[芳芷,hero2]没有独立人格的打工人们是无论如何也做不到这点的，所以才开始有了机器拟人化的研究，目的便是让机器人具有独立的人格。",
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]原来如此，后来在拟人化的研究中出现了智械和械灵两大分支，这些晴芸已经给我讲过了。",
        "\t[芳芷,hero2]这样吗，好奇的晴芸妹妹懂得还真不少呢。",
        "\t[晴芸,hero3]我不是我没有，我是……偶然听说的！",
        "\t[芳芷,hero2]好啦，继续赶路吧。"
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "2,12": {
            "floorId": "North1",
            "loc": [
                8,
                0
            ]
        },
        "12,2": {
            "floorId": "North3",
            "loc": [
                0,
                10
            ]
        },
        "1,0": {
            "floorId": "North4",
            "loc": [
                8,
                12
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [ 21, 91,  0, 17, 17, 17, 17, 17, 17, 17, 17,  0,  0],
    [  0,331, 81,80005,80006,  0,334,  0,50012,556, 17, 17, 17],
    [324,  0,  0,555,  0,331,  0,552,330,  0,  0,  0, 94],
    [ 17, 17, 17, 17, 17, 17, 17,325,  0,528, 82, 20, 20],
    [  0,  0,  0,  0,  0,  0, 17, 17, 17, 81, 17, 17, 17],
    [  0,  0,  0,  0,  0,  0,  0,  0, 17,  0, 17,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0, 17,  0, 17,  0,  0],
    [ 17, 17, 17, 17, 17, 17, 17, 17, 17, 21, 17,  0,  0],
    [50015,334,325,80007,  0,485,324, 17, 17,  0, 17, 17, 17],
    [334,50007,553,80015,530, 20,331, 82, 21,547, 81,555,324],
    [331, 82,  0,334,  0, 20, 20,  0,40010,485,  0,50012,331],
    [334, 20,  0, 20, 21,531,  0,331,  0, 21, 81,330,50012],
    [80049, 20, 93, 20,80049, 17, 17, 17, 17, 17, 17, 17, 17]
],
    "bgmap": [
    [80048,  0,  0,80072,80073,80073,80073,80073,80073,80073,80064,80065,80065],
    [80048,  0,  0,  0,  0,  0,  0,  0,  0,  0,80072,80073,80073],
    [80048,  0,50002,  0,  0,  0,  0,  0,  0,50001,  0,  0,  0],
    [80056,80057,80057,80057,80057,80057,80057,80051,  0,  0,  0,  0,  0],
    [80064,80065,80065,80065,80065,80065,80065,80056,80057,80105,80057,80057,80057],
    [80064,80060,80065,80065,80065,80060,80065,80064,80065,80113,80065,80065,80065],
    [80064,80065,80065,80065,80065,80065,80065,80064,80065,80113,80065,80060,80065],
    [80064,80073,80073,80073,80073,80073,80073,80064,80065,80113,80065,80065,80065],
    [80048,  0,  0,  0,  0,  0,  0,80072,80073,80113,80073,80073,80073],
    [80048,  0,  0,  0,  0,  0,  0,  0,  0,80124,  0,  0,80050],
    [80048,  0,50001,  0,  0,  0,  0,  0,  0,  0,  0,  0,80050],
    [80048,  0,  0,  0,  0,  0,  0,  0,50001,  0,  0,  0,80050],
    [80048,  0,  0,  0,80052,80057,80057,80057,80057,80057,80057,80057,80058]
],
    "fgmap": [

],
    "bg2map": [

],
    "fg2map": [

],
    "hard1_enemy_ratio": 80
}