main.floors.South1=
{
    "floorId": "South1",
    "title": "停风林-1",
    "name": "停风林-1",
    "width": 13,
    "height": 13,
    "canFlyTo": true,
    "canUseQuickShop": false,
    "cannotViewMap": false,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "grass",
    "firstArrive": [
        {
            "type": "setValue",
            "name": "flag:talentTree_description",
            "value": "\"看起来很奇特的徽章，但是暂时还不知道怎么用。\""
        },
        {
            "type": "function",
            "function": "function(){\ncore.plugin.removeMaps(\"BMT20\", \"MT70_2\");\ncore.setFlag(\"__visited__\", { South1: true });\ncore.values.animateSpeed = 330;\n// 数据统计不再包含前两章\ncore.setFlag(\"drawStat_start\", \"South1\");\n}"
        },
        {
            "type": "setCurtain",
            "time": 500
        },
        {
            "type": "sleep",
            "time": 1000
        },
        {
            "type": "playSound",
            "name": "mteleport.wav"
        },
        {
            "type": "changePos",
            "loc": [
                6,
                -1
            ]
        },
        {
            "type": "moveHero",
            "time": 10,
            "steps": [
                "down:8"
            ]
        },
        {
            "type": "playSound",
            "name": "048-Explosion01.ogg"
        },
        {
            "type": "animate",
            "name": "explosion_small",
            "loc": "hero",
            "async": true
        },
        {
            "type": "vibrate",
            "direction": "horizontal",
            "time": 1000,
            "speed": 10,
            "power": 10
        },
        {
            "type": "sleep",
            "time": 500
        },
        "\t[hero]这里应该就是虚拟世界内部了。\n虽然是从天而降，但还是没搞明白自己现在的位置……",
        {
            "type": "changePos",
            "direction": "left"
        },
        {
            "type": "animate",
            "name": "E_unhappy",
            "loc": "hero"
        },
        "\t[hero]感觉力量被削弱了不少，周围的怪物几乎一个都打不过。\n我来到这里，目标是什么呢？……难道是，荒野求生？",
        {
            "type": "if",
            "condition": "flag:hard == 1",
            "true": [
                {
                    "type": "setValue",
                    "name": "item:greenKey",
                    "value": "99"
                },
                "\t[系统提示]主角的所有数据均被重置。\n简化难度下所有敌人的生命、攻击、防御均下降20%，并且你已获得99把绿钥匙！\n但是，一旦用过绿钥匙，成绩就会被计入单独的榜单。"
            ],
            "false": [
                {
                    "type": "setValue",
                    "name": "item:greenKey",
                    "value": "99"
                },
                "\t[系统提示]主角的所有数据均被重置。\n你已获得99把绿钥匙，如果觉得难，尽情地咸吧！\n但是，一旦用过绿钥匙，就会被计入单独的榜单。"
            ]
        }
    ],
    "eachArrive": [
        {
            "type": "function",
            "function": "function(){\ncore.values.animateSpeed = 330;\n}"
        }
    ],
    "parallelDo": "",
    "events": {},
    "changeFloor": {
        "6,0": {
            "floorId": "South11",
            "loc": [
                6,
                12
            ]
        },
        "6,12": {
            "floorId": "South2",
            "loc": [
                6,
                0
            ]
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [149,149,149,149,149,149, 91,149,149,149,149,149,149],
    [149,50073,50074,149,149,149, 85,149,149,149,50073,50074,149],
    [149,  0,323,  0,481,  0,467,  0,471,  0,322,  0,149],
    [149,471,149,149,149,  0, 29,  0,149,149,149,481,149],
    [149,334,149, 22,149,149, 83,149,149, 22,149,334,149],
    [149,  0,481,  0,471,  0,  0,  0,481,  0,471,  0,149],
    [149,149,149, 81,149, 22,  0, 32,149, 81,149,149,149],
    [149,149,149, 81,149,  0,  0,  0,149, 81,149,149,149],
    [149, 34,  0, 30,149, 27,  0, 28,149, 30,  0, 34,149],
    [149,  0, 21,  0,149,149,444,149,149,  0, 21,  0,149],
    [149,471,149,149,149,  0,489,  0,149,149,149,481,149],
    [149,  0, 32,  0,467, 21,  0, 21,467,  0, 32,  0,149],
    [149,149,149,149,149,149, 93,149,149,149,149,149,149]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,147,  0,  0,  0,  0,  0,  0],
    [50072,  0,  0,50075,  0,  0,147,  0,  0,50072,  0,  0,50075],
    [  0,  0,  0,50009,  0,  0,147,  0,  0,50009,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,50002,  0,  0,147,  0,  0,50002,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,50010,147,50010,  0,  0,  0,  0,  0],
    [  0,  0,50010,  0,  0,  0,147,  0,  0,  0,50010,  0,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,  0,  0,  0,  0],
    [  0,50001,  0,  0,  0,  0,147,  0,  0,  0,  0,50001,  0],
    [  0,  0,  0,  0,  0,  0,147,  0,  0,  0,  0,  0,  0]
],
    "fgmap": [
    [50064,50065,50066,50067,  0,  0,  0,  0,  0,50064,50065,50066,50067],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [

],
    "fg2map": [

],
    "bgm": "area8.mp3",
    "flyPoint": [
        6,
        6
    ],
    "upFloor": null,
    "downFloor": null,
    "hard1_enemy_ratio": 80,
    "beforeBattle": {},
    "cannotMoveIn": {},
    "canFlyFrom": true
}