main.floors.West11=
{
    "floorId": "West11",
    "title": "截浪滩尽头",
    "name": "截浪滩尽头",
    "width": 13,
    "height": 13,
    "canFlyTo": false,
    "canUseQuickShop": false,
    "cannotViewMap": true,
    "cannotMoveDirectly": false,
    "images": [],
    "ratio": 50,
    "defaultGround": "sand",
    "bgm": "dungeon2.mp3",
    "firstArrive": [
        {
            "type": "confirm",
            "text": "接下来是一段剧情，是否跳过？",
            "yes": [],
            "no": [
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "moveHero",
                    "time": 300,
                    "steps": [
                        "right:6",
                        "down:3"
                    ]
                },
                {
                    "type": "setBlock",
                    "number": "hero3",
                    "loc": [
                        [
                            6,
                            4
                        ]
                    ]
                },
                {
                    "type": "unfollow",
                    "name": "hero3.png"
                },
                "\t[hero]\b[down,hero]果然这边什么都没有，没有械灵，没有小动物，就连乱石都没几颗……",
                {
                    "type": "move",
                    "loc": [
                        6,
                        4
                    ],
                    "time": 300,
                    "keep": true,
                    "steps": [
                        "left:1",
                        "down:2",
                        "right:1"
                    ]
                },
                {
                    "type": "turnBlock",
                    "direction": "down",
                    "loc": [
                        [
                            6,
                            6
                        ]
                    ]
                },
                "\t[晴芸,hero3]\b[down,6,6]……",
                "\t[hero]\b[down,hero]怎么了？",
                "\t[晴芸,hero3]\b[down,6,6]我只是想……稍微休息一下。",
                "\t[hero]\b[down,hero]也是，这一路走下来有些累也是正常的。",
                "\t[晴芸,hero3]\b[down,6,6]每次望着大海，都能真切地感觉到自己的渺小……\n在这个世界上，凭我自己的力量所能改变的东西，太少了。",
                {
                    "type": "animate",
                    "name": "E_dots",
                    "loc": "hero"
                },
                {
                    "type": "turnBlock",
                    "direction": "up",
                    "loc": [
                        [
                            6,
                            6
                        ]
                    ]
                },
                "\t[晴芸,hero3]\b[down,6,6]但是你不一样。跟随你一路走来，我见证了你在短短几个小时之内战斗力突飞猛进的过程。\n这让我愈加相信，你有能力改变许多事情。",
                {
                    "type": "sleep",
                    "time": 1000
                },
                "\t[hero]\b[down,hero]……",
                {
                    "type": "turnBlock",
                    "direction": "down",
                    "loc": [
                        [
                            6,
                            6
                        ]
                    ]
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[晴芸,hero3]\b[down,6,6]不管前方的道路再怎么坎坷，也必须坚持走下去，因为别无选择。",
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[hero]\b[down,hero]……你还好吗？怎么感觉你突然像是变了一个人似的。\n而且，你有什么特别想改变的东西吗？",
                "\t[晴芸,hero3]\b[down,6,6]……没什么，就当我是胡思乱想吧。",
                "\t[hero]\b[down,hero]其实，前方的道路也许很困难，但你本没有必要去面对的。\n尽管交给我吧，我会努力做好的。",
                "\t[晴芸,hero3]\b[down,6,6]不行，我不放心。\n姐姐虽然很聪明，成长速度很快，但是还是太……单纯了。",
                {
                    "type": "animate",
                    "name": "E_sweat",
                    "loc": "hero"
                },
                "\t[hero]\b[down,hero]（被她这么说总感觉怪怪的……）",
                "\t[hero]\b[down,hero]你直接说我是智障就行了。确实，\n到现在为止我还有很多没想明白的事情，比如你为什么要跟着我来，比如刚才村庄里熟悉的面孔是怎么回事，比如这个比赛背后的阴谋是什么……",
                "\t[晴芸,hero3]\b[down,6,6]只要走下去，总会真相大白。",
                "\t[hero]\b[down,hero]……",
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "turnBlock",
                    "direction": "up",
                    "loc": [
                        [
                            6,
                            6
                        ]
                    ]
                },
                "\t[晴芸,hero3]\b[down,6,6]我们出发吧。",
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]你们没有出发的机会了。",
                {
                    "type": "changePos",
                    "direction": "up"
                },
                {
                    "type": "show",
                    "loc": [
                        [
                            6,
                            2
                        ],
                        [
                            5,
                            3
                        ],
                        [
                            4,
                            2
                        ],
                        [
                            7,
                            3
                        ],
                        [
                            8,
                            2
                        ]
                    ]
                },
                {
                    "type": "animate",
                    "name": "heal",
                    "loc": [
                        6,
                        2
                    ]
                },
                "\t[hero]\b[down,hero]怎么又是你们？",
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]清除所有械灵和所有与械灵有关的物体，就是我们除灵者的使命。",
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]虽然你确实是纯正的智械，但我们在截浪滩一带安排的监控已经看得很清楚了，\n你收集黄宝石，并且将它转化为力量，此等行为与械灵无异。\n事实清楚，证据确凿，我们决定立即将你击毙。",
                {
                    "type": "animate",
                    "name": "E_dots",
                    "loc": "hero"
                },
                "\t[hero]\b[down,hero]（可恶……以我现在的实力和状态，正面硬拼依然没有丝毫胜算……\n这次被堵在这种人迹罕至的地方，恐怕是不会再有人来帮我了……）",
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]那边的人类小姑娘，立即让开。",
                "\t[hero]\b[down,hero]晴芸，你快跑吧，他们的敌意是针对我的。",
                {
                    "type": "animate",
                    "name": "E_dots",
                    "loc": [
                        6,
                        6
                    ]
                },
                {
                    "type": "move",
                    "loc": [
                        6,
                        6
                    ],
                    "time": 300,
                    "keep": true,
                    "steps": [
                        "up:2"
                    ]
                },
                "\t[晴芸,hero3]\b[down,6,4]我拒绝。",
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]？？？",
                "\t[hero]\b[down,hero]？？？",
                {
                    "type": "sleep",
                    "time": 500
                },
                "\t[晴芸,hero3]\b[down,6,4]你们这些除灵者，打着正义的旗帜，做的净是些强盗行为。",
                "\t[晴芸,hero3]\b[down,6,4]真要是想清理械灵，为什么不直接去\r[yellow]格沃堡\r？放着械灵的老巢不管，反倒跑到这荒郊野岭来欺负最低级型号的械灵，顺便给无辜者扣个“械灵相关”的帽子杀人越货，这就是你们除灵者的使命？",
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]我们怎么做还轮不到你来指导。现在，立即，让开。",
                "\t[晴芸,hero3]\b[down,6,4]我不让开，你动手吧。",
                "\t[hero]\b[down,hero]（？？？你疯了？）",
                {
                    "type": "sleep",
                    "time": 1000
                },
                {
                    "type": "animate",
                    "name": "E_dots",
                    "loc": [
                        6,
                        2
                    ]
                },
                {
                    "type": "animate",
                    "name": "E_dots",
                    "loc": "hero"
                },
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]哼，真是碍事。",
                "\t[晴芸,hero3]\b[down,6,4]果然，你这个级别的除灵者是不能擅自攻击人类的，你甚至没有能力违反上级定下的规矩，对吧？",
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]无妨。那边的智械听着，我们已经将你的行为上报，等上级腾出手核实情况、下发\r[yellow]格杀许可\r之后，你躲在谁背后都不好使！",
                "\t[除灵者Ⅱ型,N515]\b[down,6,2]你，你这小姑娘也一样给我等着，等我们有了格杀许可，你再挡路就连你一起击毙！\n撤！",
                {
                    "type": "hide",
                    "loc": [
                        [
                            6,
                            2
                        ],
                        [
                            5,
                            3
                        ],
                        [
                            4,
                            2
                        ],
                        [
                            7,
                            3
                        ],
                        [
                            8,
                            2
                        ]
                    ],
                    "remove": true
                },
                {
                    "type": "animate",
                    "name": "zone",
                    "loc": [
                        6,
                        2
                    ]
                },
                {
                    "type": "sleep",
                    "time": 500
                },
                {
                    "type": "animate",
                    "name": "E_unhappy",
                    "loc": "hero"
                },
                "\t[hero]\b[down,hero]……我感觉我真是太丢脸了，还需要你来保护我。",
                {
                    "type": "turnBlock",
                    "direction": "down",
                    "loc": [
                        [
                            6,
                            4
                        ]
                    ]
                },
                "\t[晴芸,hero3]\b[down,6,4]哪里，我觉得我才丢脸，没有什么战斗力，以这种方式才能帮上一点忙。",
                "\t[hero]\b[down,hero]这种打打杀杀的任务本来就不是你需要负责的。\n所以，你回村庄好好休息吧，我自己走完剩下的路。",
                "\t[晴芸,hero3]\b[down,6,4]可是那些除灵者说不定还在监视你呢。你确定我离开你之后，他们不会突然出现，然后把姐姐……？",
                "\t[hero]\b[down,hero]……啊，这……",
                {
                    "type": "playSound",
                    "name": "jump.mp3"
                },
                {
                    "type": "jump",
                    "from": [
                        6,
                        4
                    ],
                    "dxy": [
                        0,
                        0
                    ],
                    "time": 300,
                    "keep": true,
                    "async": true
                },
                "\t[晴芸,hero3]\b[down,6,4]嘿嘿，所以现在是我在保护你啦！\n我们一起出发吧！目标，花月道！",
                {
                    "type": "waitAsync",
                    "excludeAnimates": true
                },
                "\t[hero]\b[down,hero]（哎，真拿她没办法……）",
                {
                    "type": "move",
                    "loc": [
                        6,
                        4
                    ],
                    "time": 100,
                    "steps": [
                        "down:1"
                    ]
                },
                {
                    "type": "follow",
                    "name": "hero3.png"
                }
            ]
        },
        "\t[系统提示]通往花月道的道路已经开启。",
        {
            "type": "openDoor",
            "loc": [
                11,
                6
            ],
            "floorId": "Village"
        }
    ],
    "eachArrive": [],
    "parallelDo": "",
    "events": {
        "4,2": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "data": []
        },
        "5,3": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "data": []
        },
        "6,2": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "data": []
        },
        "7,3": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "data": []
        },
        "8,2": {
            "trigger": null,
            "enable": false,
            "noPass": null,
            "displayDamage": true,
            "data": []
        }
    },
    "changeFloor": {
        "0,2": {
            "floorId": "West10",
            "loc": [
                12,
                9
            ],
            "time": 800
        }
    },
    "afterBattle": {},
    "afterGetItem": {},
    "afterOpenDoor": {},
    "autoEvent": {},
    "cannotMove": {},
    "map": [
    [60057,60057,60057,60057,60057,60057,60057,60057,60058,  0, 17,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,60015, 17,  0,  0],
    [  0,  0,  0,  0,535,  0,538,  0,535,  0, 17,  0,  0],
    [  0,  0,  0,  0,  0,535,  0,535,  0,  0, 17,  0,  0],
    [ 17, 17, 17, 17,  0,  0,  0,  0,  0,  0, 17,  0,  0],
    [  0,  0,  0, 17,  0,  0,  0,  0,  0,  0, 17,  0,  0],
    [  0,  0,  0, 17,  0,  0,  0,  0,  0,  0, 17,  0,  0],
    [  0,  0,  0, 17,  0,  0,  0,  0,  0,  0, 17,  0,  0],
    [  0,  0,  0, 17, 17,  0,  0,  0,  0, 17, 17,  0,  0],
    [  0,  0,  0,  0, 17, 17, 17, 17, 17, 17,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,150,154,155,156],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,150,154,155,156],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,150,154,155,156],
    [150,150,150,150,150,  0,  0,  0,  0,150,154,155,156],
    [154,154,154,154,150,  0,  0,  0,  0,150,154,155,156],
    [155,155,155,154,150,  0,  0,  0,  0,150,154,155,156],
    [156,156,155,154,150,  0,  0,  0,  0,150,154,155,156],
    [156,156,155,154,150,150,  0,  0,150,150,154,155,156],
    [156,156,155,154,154,150,150,150,150,154,154,155,156],
    [156,156,155,155,154,154,154,154,154,154,155,155,156],
    [156,156,156,155,155,155,155,155,155,155,155,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156],
    [156,156,156,156,156,156,156,156,156,156,156,156,156]
],
    "fgmap": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,60006,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "bg2map": [
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [ 92,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0],
    [  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0,  0]
],
    "fg2map": [

],
    "beforeBattle": {},
    "cannotMoveIn": {}
}